
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>动力学模块 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="loose-ends.html" />
    
    
    <link rel="prev" href="collision-module.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="overview.html">
            
                <a href="overview.html">
            
                    
                    概述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="hello-box2d.html">
            
                <a href="hello-box2d.html">
            
                    
                    你好，Box2D
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="testbed.html">
            
                <a href="testbed.html">
            
                    
                    试验台
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="common-module.html">
            
                <a href="common-module.html">
            
                    
                    通用模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="collision-module.html">
            
                <a href="collision-module.html">
            
                    
                    碰撞模块
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.7" data-path="dynamics-module.html">
            
                <a href="dynamics-module.html">
            
                    
                    动力学模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="loose-ends.html">
            
                <a href="loose-ends.html">
            
                    
                    松散的末端
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" >
            
                <span>
            
                    
                    工具书类
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="faq.html">
            
                <a href="faq.html">
            
                    
                    FAQ
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >动力学模块</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x52A8;&#x529B;&#x5B66;&#x6A21;&#x5757;">&#x52A8;&#x529B;&#x5B66;&#x6A21;&#x5757;</h2>
<p>&#x52A8;&#x529B;&#x5B66;&#x6A21;&#x5757;&#x662F;Box2D&#x4E2D;&#x6700;&#x590D;&#x6742;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x4E5F;&#x662F;&#x60A8;&#x53EF;&#x80FD;&#x4E0E;&#x4E4B;&#x4EA4;&#x4E92;&#x6700;&#x591A;&#x7684;&#x90E8;&#x5206;&#x3002;Dynamics&#x6A21;&#x5757;&#x4F4D;&#x4E8E;Common&#x548C;Collision&#x6A21;&#x5757;&#x4E4B;&#x4E0A;&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x73B0;&#x5728;&#x5E94;&#x8BE5;&#x5BF9;&#x8FD9;&#x4E9B;&#x6A21;&#x5757;&#x6BD4;&#x8F83;&#x719F;&#x6089;&#x4E86;&#x3002;</p>
<p>&#x52A8;&#x6001;&#x6A21;&#x5757;&#x5305;&#x542B;&#xFF1A;</p>
<ul>
<li>&#x5939;&#x5177;&#x7B49;&#x7EA7;</li>
<li>&#x521A;&#x4F53;&#x7C7B;</li>
<li>&#x63A5;&#x89E6;&#x7B49;&#x7EA7;</li>
<li>&#x8054;&#x5408;&#x7C7B;</li>
<li>&#x4E16;&#x754C;&#x7EA7;</li>
<li>&#x4FA6;&#x542C;&#x5668;&#x7C7B;</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x7C7B;&#x4E4B;&#x95F4;&#x6709;&#x5F88;&#x591A;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x6240;&#x4EE5;&#x5F88;&#x96BE;&#x63CF;&#x8FF0;&#x4E00;&#x4E2A;&#x7C7B;&#x800C;&#x4E0D;&#x5F15;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x7C7B;&#x3002;&#x5728;&#x4E0B;&#x9762;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x4F1A;&#x770B;&#x5230;&#x4E00;&#x4E9B;&#x5C1A;&#x672A;&#x63CF;&#x8FF0;&#x7684;&#x7C7B;&#x7684;&#x5F15;&#x7528;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x4ED4;&#x7EC6;&#x9605;&#x8BFB;&#x672C;&#x7AE0;&#x4E4B;&#x524D;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5FEB;&#x901F;&#x6D4F;&#x89C8;&#x672C;&#x7AE0;&#x3002;</p>
<p>&#x4EE5;&#x4E0B;&#x7AE0;&#x8282;&#x5C06;&#x4ECB;&#x7ECD;&#x52A8;&#x529B;&#x5B66;&#x6A21;&#x5757;&#x3002;</p>
<h1 id="&#x8EAB;&#x4F53;">&#x8EAB;&#x4F53;</h1>
<p>&#x7269;&#x4F53;&#x6709;&#x4F4D;&#x7F6E;&#x548C;&#x901F;&#x5EA6;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5BF9;&#x7269;&#x4F53;&#x65BD;&#x52A0;&#x529B;&#x3001;&#x529B;&#x77E9;&#x548C;&#x8109;&#x51B2;&#x3002;&#x5B9E;&#x4F53;&#x53EF;&#x4EE5;&#x662F;&#x9759;&#x6001;&#x7684;&#x3001;&#x8FD0;&#x52A8;&#x7684;&#x6216;&#x52A8;&#x6001;&#x7684;&#x3002;&#x4EE5;&#x4E0B;&#x662F;&#x8F66;&#x8EAB;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#xFF1A;</p>
<h3 id="b2&#x9759;&#x4F53;">b2_&#x9759;&#x4F53;</h3>
<p>&#x9759;&#x6001;&#x7269;&#x4F53;&#x5728;&#x6A21;&#x62DF;&#x4E0B;&#x4E0D;&#x4F1A;&#x79FB;&#x52A8;&#xFF0C;&#x5176;&#x884C;&#x4E3A;&#x5C31;&#x50CF;&#x5B83;&#x6709;&#x65E0;&#x9650;&#x5927;&#x7684;&#x8D28;&#x91CF;&#x4E00;&#x6837;&#x3002;&#x5728;&#x5185;&#x90E8;&#xFF0C;Box2D&#x4E3A;&#x8D28;&#x91CF;&#x548C;&#x53CD;&#x5411;&#x8D28;&#x91CF;&#x5B58;&#x50A8;&#x96F6;&#x3002;&#x9759;&#x6001;&#x5B9E;&#x4F53;&#x53EF;&#x4EE5;&#x7531;&#x7528;&#x6237;&#x624B;&#x52A8;&#x79FB;&#x52A8;&#x3002;&#x9759;&#x6B62;&#x7269;&#x4F53;&#x7684;&#x901F;&#x5EA6;&#x4E3A;&#x96F6;&#x3002;&#x9759;&#x6001;&#x5B9E;&#x4F53;&#x4E0D;&#x4F1A;&#x4E0E;&#x5176;&#x4ED6;&#x9759;&#x6001;&#x6216;&#x8FD0;&#x52A8;&#x5B66;&#x5B9E;&#x4F53;&#x78B0;&#x649E;&#x3002;</p>
<h3 id="&#x8FD0;&#x52A8;&#x4F53;">&#x8FD0;&#x52A8;&#x4F53;</h3>
<p>&#x8FD0;&#x52A8;&#x7269;&#x4F53;&#x5728;&#x6A21;&#x62DF;&#x4E0B;&#x6839;&#x636E;&#x5176;&#x901F;&#x5EA6;&#x8FD0;&#x52A8;&#x3002;&#x8FD0;&#x52A8;&#x4F53;&#x5BF9;&#x529B;&#x6CA1;&#x6709;&#x53CD;&#x5E94;&#x3002;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x7531;&#x7528;&#x6237;&#x624B;&#x52A8;&#x79FB;&#x52A8;&#xFF0C;&#x4F46;&#x901A;&#x5E38;&#x8FD0;&#x52A8;&#x4F53;&#x662F;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;&#x5176;&#x901F;&#x5EA6;&#x6765;&#x79FB;&#x52A8;&#x7684;&#x3002;&#x8FD0;&#x52A8;&#x5B66;&#x5B9E;&#x4F53;&#x7684;&#x884C;&#x4E3A;&#x5C31;&#x597D;&#x50CF;&#x5B83;&#x6709;&#x65E0;&#x9650;&#x5927;&#x7684;&#x8D28;&#x91CF;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;Box2D&#x4E3A;&#x8D28;&#x91CF;&#x548C;&#x53CD;&#x5411;&#x8D28;&#x91CF;&#x5B58;&#x50A8;&#x96F6;&#x3002;&#x8FD0;&#x52A8;&#x5B66;&#x5B9E;&#x4F53;&#x4E0D;&#x4F1A;&#x4E0E;&#x5176;&#x4ED6;&#x8FD0;&#x52A8;&#x5B66;&#x6216;&#x9759;&#x6001;&#x5B9E;&#x4F53;&#x78B0;&#x649E;&#x3002;</p>
<h3 id="&#x52A8;&#x6001;&#x8F66;&#x8EAB;">&#x52A8;&#x6001;&#x8F66;&#x8EAB;</h3>
<p>&#x4E00;&#x4E2A;&#x52A8;&#x6001;&#x7269;&#x4F53;&#x88AB;&#x5B8C;&#x5168;&#x6A21;&#x62DF;&#x3002;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x7531;&#x7528;&#x6237;&#x624B;&#x52A8;&#x79FB;&#x52A8;&#xFF0C;&#x4F46;&#x901A;&#x5E38;&#x5B83;&#x4EEC;&#x662F;&#x6839;&#x636E;&#x529B;&#x79FB;&#x52A8;&#x7684;&#x3002;&#x52A8;&#x6001;&#x5B9E;&#x4F53;&#x53EF;&#x4EE5;&#x4E0E;&#x6240;&#x6709;&#x5B9E;&#x4F53;&#x7C7B;&#x578B;&#x53D1;&#x751F;&#x78B0;&#x649E;&#x3002;&#x52A8;&#x6001;&#x7269;&#x4F53;&#x603B;&#x662F;&#x6709;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x975E;&#x96F6;&#x8D28;&#x91CF;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8BD5;&#x56FE;&#x628A;&#x4E00;&#x4E2A;&#x52A8;&#x6001;&#x7269;&#x4F53;&#x7684;&#x8D28;&#x91CF;&#x8BBE;&#x4E3A;&#x96F6;&#xFF0C;&#x5B83;&#x4F1A;&#x81EA;&#x52A8;&#x83B7;&#x5F97;&#x4E00;&#x516C;&#x65A4;&#x7684;&#x8D28;&#x91CF;&#xFF0C;&#x800C;&#x4E14;&#x5B83;&#x4E0D;&#x4F1A;&#x65CB;&#x8F6C;&#x3002;</p>
<p>&#x5B9E;&#x4F53;&#x662F;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#xFF08;&#x5F62;&#x72B6;&#xFF09;&#x7684;&#x652F;&#x67F1;&#x3002;&#x5C38;&#x4F53;&#x643A;&#x5E26;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#xFF0C;&#x5E76;&#x5728;&#x4E16;&#x754C;&#x5404;&#x5730;&#x79FB;&#x52A8;&#x3002;Box2D&#x4E2D;&#x7684;&#x5B9E;&#x4F53;&#x59CB;&#x7EC8;&#x662F;&#x521A;&#x4F53;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x9644;&#x7740;&#x5728;&#x540C;&#x4E00;&#x521A;&#x4F53;&#x4E0A;&#x7684;&#x4E24;&#x4E2A;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x76F8;&#x5BF9;&#x79FB;&#x52A8;&#xFF0C;&#x9644;&#x7740;&#x5230;&#x540C;&#x4E00;&#x4E2A;&#x521A;&#x4F53;&#x4E0A;&#x7684;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x4E5F;&#x4E0D;&#x4F1A;&#x78B0;&#x649E;&#x3002;</p>
<p>&#x5939;&#x5177;&#x5177;&#x6709;&#x78B0;&#x649E;&#x51E0;&#x4F55;&#x4F53;&#x548C;&#x5BC6;&#x5EA6;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x5B9E;&#x4F53;&#x4ECE;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x83B7;&#x5F97;&#x5176;&#x8D28;&#x91CF;&#x7279;&#x6027;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x6784;&#x9020;&#x5B9E;&#x4F53;&#x540E;&#x66FF;&#x4EE3;&#x8D28;&#x91CF;&#x7279;&#x6027;&#x3002;</p>
<p>&#x901A;&#x5E38;&#xFF0C;&#x60A8;&#x5C06;&#x6307;&#x9488;&#x6307;&#x5411;&#x60A8;&#x521B;&#x5EFA;&#x7684;&#x6240;&#x6709;&#x5B9E;&#x4F53;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x67E5;&#x8BE2;&#x5B9E;&#x4F53;&#x4F4D;&#x7F6E;&#x4EE5;&#x66F4;&#x65B0;&#x56FE;&#x5F62;&#x5B9E;&#x4F53;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x4F60;&#x8FD8;&#x5E94;&#x8BE5;&#x4FDD;&#x7559;&#x8EAB;&#x4F53;&#x6307;&#x9488;&#xFF0C;&#x8FD9;&#x6837;&#x5F53;&#x4F60;&#x7528;&#x5B8C;&#x8EAB;&#x4F53;&#x6307;&#x9488;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x53EF;&#x4EE5;&#x9500;&#x6BC1;&#x5B83;&#x4EEC;&#x3002;</p>
<h2 id="&#x8EAB;&#x4F53;&#x5B9A;&#x4E49;">&#x8EAB;&#x4F53;&#x5B9A;&#x4E49;</h2>
<p>&#x5728;&#x521B;&#x5EFA;&#x5B9E;&#x4F53;&#x4E4B;&#x524D;&#xFF0C;&#x5FC5;&#x987B;&#x521B;&#x5EFA;&#x5B9E;&#x4F53;&#x5B9A;&#x4E49;(<a href="https://box2d.org/documentation/structb2_body_def.html" target="_blank"> b2BodyDef&#x516C;&#x53F8;</a>). &#x4E3B;&#x4F53;&#x5B9A;&#x4E49;&#x5305;&#x542B;&#x521B;&#x5EFA;&#x548C;&#x521D;&#x59CB;&#x5316;&#x4E3B;&#x4F53;&#x6240;&#x9700;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>Box2D&#x5C06;&#x6570;&#x636E;&#x590D;&#x5236;&#x51FA;body&#x5B9A;&#x4E49;&#xFF1B;&#x5B83;&#x4E0D;&#x4FDD;&#x7559;&#x6307;&#x5411;&#x4E3B;&#x4F53;&#x5B9A;&#x4E49;&#x7684;&#x6307;&#x9488;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x60A8;&#x53EF;&#x4EE5;&#x5FAA;&#x73AF;&#x4F7F;&#x7528;&#x5B9E;&#x4F53;&#x5B9A;&#x4E49;&#x6765;&#x521B;&#x5EFA;&#x591A;&#x4E2A;&#x5B9E;&#x4F53;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#x8EAB;&#x4F53;&#x5B9A;&#x4E49;&#x7684;&#x4E00;&#x4E9B;&#x5173;&#x952E;&#x6210;&#x5458;&#x3002;</p>
<h2 id="&#x8F66;&#x8EAB;&#x7C7B;&#x578B;">&#x8F66;&#x8EAB;&#x7C7B;&#x578B;</h2>
<p>&#x6B63;&#x5982;&#x672C;&#x7AE0;&#x5F00;&#x5934;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#xFF0C;&#x6709;&#x4E09;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x8F66;&#x8EAB;&#x7C7B;&#x578B;&#xFF1A;&#x9759;&#x6001;&#x3001;&#x8FD0;&#x52A8;&#x5B66;&#x548C;&#x52A8;&#x6001;&#x3002;&#x60A8;&#x5E94;&#x8BE5;&#x5728;&#x521B;&#x5EFA;&#x65F6;&#x5EFA;&#x7ACB;&#x5B9E;&#x4F53;&#x7C7B;&#x578B;&#xFF0C;&#x56E0;&#x4E3A;&#x7A0D;&#x540E;&#x66F4;&#x6539;&#x5B9E;&#x4F53;&#x7C7B;&#x578B;&#x7684;&#x6210;&#x672C;&#x5F88;&#x9AD8;&#x3002;</p>
<pre><code class="lang-c++">b2BodyDef bodyDef;
bodyDef.type = b2_dynamicBody;
</code></pre>
<p>&#x5FC5;&#x987B;&#x8BBE;&#x7F6E;&#x6B63;&#x6587;&#x7C7B;&#x578B;</p>
<h2 id="&#x4F4D;&#x7F6E;&#x548C;&#x89D2;&#x5EA6;">&#x4F4D;&#x7F6E;&#x548C;&#x89D2;&#x5EA6;</h2>
<p>&#x5B9E;&#x4F53;&#x5B9A;&#x4E49;&#x4E3A;&#x60A8;&#x63D0;&#x4F9B;&#x4E86;&#x5728;&#x521B;&#x5EFA;&#x65F6;&#x521D;&#x59CB;&#x5316;&#x5B9E;&#x4F53;&#x4F4D;&#x7F6E;&#x7684;&#x673A;&#x4F1A;&#x3002;&#x8FD9;&#x6BD4;&#x5728;&#x4E16;&#x754C;&#x539F;&#x70B9;&#x521B;&#x5EFA;&#x5B9E;&#x4F53;&#x7136;&#x540E;&#x79FB;&#x52A8;&#x5B9E;&#x4F53;&#x8981;&#x597D;&#x5F97;&#x591A;&#x3002;</p>
<blockquote>
<p><strong>&#x6CE8;&#x610F;&#x5B89;&#x5168;</strong>&#xFF1A;&#x4E0D;&#x8981;&#x5728;&#x539F;&#x70B9;&#x521B;&#x5EFA;&#x5B9E;&#x4F53;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x79FB;&#x52A8;&#x5B83;&#x3002;&#x5982;&#x679C;&#x5728;&#x539F;&#x70B9;&#x521B;&#x5EFA;&#x591A;&#x4E2A;&#x5B9E;&#x4F53;&#xFF0C;&#x5219;&#x6027;&#x80FD;&#x5C06;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#x3002;</p>
</blockquote>
<p>&#x4E00;&#x4E2A;&#x56E2;&#x4F53;&#x6709;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x7684;&#x5174;&#x8DA3;&#x70B9;&#x3002;&#x7B2C;&#x4E00;&#x70B9;&#x662F;&#x7269;&#x4F53;&#x7684;&#x8D77;&#x6E90;&#x3002;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x548C;&#x5173;&#x8282;&#x76F8;&#x5BF9;&#x4E8E;&#x5B9E;&#x4F53;&#x7684;&#x539F;&#x70B9;&#x9644;&#x7740;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x5174;&#x8DA3;&#x70B9;&#x662F;&#x8D28;&#x5FC3;&#x3002;&#x8D28;&#x5FC3;&#x7531;&#x9644;&#x7740;&#x5F62;&#x72B6;&#x7684;&#x8D28;&#x91CF;&#x5206;&#x5E03;&#x786E;&#x5B9A;&#xFF0C;&#x6216;&#x660E;&#x786E;&#x8BBE;&#x7F6E;&#x4E3A;<a href="https://box2d.org/documentation/structb2_mass_data.html" target="_blank"> b2MassData&#x516C;&#x53F8;</a>. Box2D&#x7684;&#x8BB8;&#x591A;&#x5185;&#x90E8;&#x8BA1;&#x7B97;&#x90FD;&#x4F7F;&#x7528;&#x8D28;&#x5FC3;&#x4F4D;&#x7F6E;&#x3002;&#x4F8B;&#x5982;<a href="https://box2d.org/documentation/classb2_body.html" target="_blank">b2Body&#x516C;&#x53F8;</a>&#x5B58;&#x50A8;&#x8D28;&#x5FC3;&#x7684;&#x7EBF;&#x901F;&#x5EA6;</p>
<p>&#x5728;&#x6784;&#x5EFA;&#x5B9E;&#x4F53;&#x5B9A;&#x4E49;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x4E0D;&#x77E5;&#x9053;&#x8D28;&#x5FC3;&#x4F4D;&#x4E8E;&#x4F55;&#x5904;&#x3002;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x5B9E;&#x4F53;&#x539F;&#x70B9;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x4EE5;&#x5F27;&#x5EA6;&#x6307;&#x5B9A;&#x5B9E;&#x4F53;&#x7684;&#x89D2;&#x5EA6;&#xFF0C;&#x8BE5;&#x89D2;&#x5EA6;&#x4E0D;&#x53D7;&#x8D28;&#x5FC3;&#x4F4D;&#x7F6E;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x5982;&#x679C;&#x4EE5;&#x540E;&#x66F4;&#x6539;&#x5B9E;&#x4F53;&#x7684;&#x8D28;&#x91CF;&#x7279;&#x6027;&#xFF0C;&#x5219;&#x8D28;&#x5FC3;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x5B9E;&#x4F53;&#x4E0A;&#x79FB;&#x52A8;&#xFF0C;&#x4F46;&#x539F;&#x70B9;&#x4F4D;&#x7F6E;&#x4E0D;&#x4F1A;&#x66F4;&#x6539;&#xFF0C;&#x9644;&#x7740;&#x7684;&#x5F62;&#x72B6;&#x548C;&#x5173;&#x8282;&#x4E5F;&#x4E0D;&#x4F1A;&#x79FB;&#x52A8;&#x3002;</p>
<pre><code class="lang-c++">b2BodyDef bodyDef;
bodyDef.position.Set(<span class="hljs-number">0.0f</span>, <span class="hljs-number">2.0f</span>); <span class="hljs-comment">// the body&apos;s origin position.</span>
bodyDef.angle = <span class="hljs-number">0.25f</span> * b2_pi; <span class="hljs-comment">// the body&apos;s angle in radians.</span>
</code></pre>
<p>&#x521A;&#x4F53;&#x4E5F;&#x662F;&#x53C2;&#x7167;&#x7CFB;&#x3002;&#x53EF;&#x4EE5;&#x5728;&#x8BE5;&#x6846;&#x67B6;&#x4E2D;&#x5B9A;&#x4E49;&#x88C5;&#x7F6E;&#x548C;&#x63A5;&#x5934;&#x3002;&#x8FD9;&#x4E9B;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x548C;&#x5173;&#x8282;&#x56FA;&#x5B9A;&#x5668;&#x5728;&#x8EAB;&#x4F53;&#x7684;&#x5C40;&#x90E8;&#x6846;&#x67B6;&#x5185;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x79FB;&#x52A8;&#x3002;</p>
<h2 id="&#x963B;&#x5C3C;">&#x963B;&#x5C3C;</h2>
<p>&#x963B;&#x5C3C;&#x7528;&#x4E8E;&#x964D;&#x4F4E;&#x7269;&#x4F53;&#x7684;&#x4E16;&#x754C;&#x901F;&#x5EA6;&#x3002;&#x963B;&#x5C3C;&#x4E0D;&#x540C;&#x4E8E;&#x6469;&#x64E6;&#xFF0C;&#x56E0;&#x4E3A;&#x6469;&#x64E6;&#x53EA;&#x5728;&#x63A5;&#x89E6;&#x65F6;&#x53D1;&#x751F;&#x3002;&#x963B;&#x5C3C;&#x4E0D;&#x80FD;&#x4EE3;&#x66FF;&#x6469;&#x64E6;&#x529B;&#xFF0C;&#x8FD9;&#x4E24;&#x79CD;&#x6548;&#x679C;&#x5E94;&#x8BE5;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x963B;&#x5C3C;&#x53C2;&#x6570;&#x5E94;&#x4ECB;&#x4E8E;0&#x548C;&#x65E0;&#x7A77;&#x5927;&#x4E4B;&#x95F4;&#xFF0C;0&#x8868;&#x793A;&#x65E0;&#x963B;&#x5C3C;&#xFF0C;&#x65E0;&#x7A77;&#x5927;&#x8868;&#x793A;&#x5B8C;&#x5168;&#x963B;&#x5C3C;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x60A8;&#x5C06;&#x4F7F;&#x7528;&#x4ECB;&#x4E8E;0&#x548C;0.1&#x4E4B;&#x95F4;&#x7684;&#x963B;&#x5C3C;&#x503C;&#x3002;&#x6211;&#x4E00;&#x822C;&#x4E0D;&#x4F7F;&#x7528;&#x7EBF;&#x6027;&#x963B;&#x5C3C;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4F7F;&#x7269;&#x4F53;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x662F;&#x6F02;&#x6D6E;&#x7684;&#x3002;</p>
<pre><code class="lang-c++">b2BodyDef bodyDef;
bodyDef.linearDamping = <span class="hljs-number">0.0f</span>;
bodyDef.angularDamping = <span class="hljs-number">0.01f</span>;
</code></pre>
<p>&#x963B;&#x5C3C;&#x8FD1;&#x4F3C;&#x7528;&#x4E8E;&#x7A33;&#x5B9A;&#x6027;&#x548C;&#x6027;&#x80FD;&#x3002;&#x5728;&#x8F83;&#x5C0F;&#x7684;&#x963B;&#x5C3C;&#x503C;&#x4E0B;&#xFF0C;&#x963B;&#x5C3C;&#x6548;&#x5E94;&#x4E3B;&#x8981;&#x4E0E;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x65E0;&#x5173;&#x3002;&#x5728;&#x8F83;&#x5927;&#x7684;&#x963B;&#x5C3C;&#x503C;&#x4E0B;&#xFF0C;&#x963B;&#x5C3C;&#x6548;&#x679C;&#x5C06;&#x968F;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x800C;&#x53D8;&#x5316;&#x3002;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x56FA;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#xFF08;&#x63A8;&#x8350;&#xFF09;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="&#x91CD;&#x529B;&#x79E4;">&#x91CD;&#x529B;&#x79E4;</h2>
<p>&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x201C;&#x91CD;&#x529B;&#x6BD4;&#x4F8B;&#x201D;&#x8C03;&#x6574;&#x5355;&#x4E2A;&#x5B9E;&#x4F53;&#x4E0A;&#x7684;&#x91CD;&#x529B;&#x3002;&#x4F46;&#x662F;&#x8981;&#x5C0F;&#x5FC3;&#xFF0C;&#x589E;&#x52A0;&#x91CD;&#x529B;&#x4F1A;&#x964D;&#x4F4E;&#x7A33;&#x5B9A;&#x6027;&#x3002;</p>
<pre><code class="lang-c++"><span class="hljs-comment">// Set the gravity scale to zero so this body will float</span>
b2BodyDef bodyDef;
bodyDef.gravityScale = <span class="hljs-number">0.0f</span>;
</code></pre>
<h2 id="&#x7761;&#x7720;&#x53C2;&#x6570;">&#x7761;&#x7720;&#x53C2;&#x6570;</h2>
<p>&#x7761;&#x7720;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;&#x6A21;&#x62DF;&#x7269;&#x4F53;&#x662F;&#x5F88;&#x6602;&#x8D35;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8D8A;&#x5C11;&#x6A21;&#x62DF;&#x8D8A;&#x597D;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x7269;&#x4F53;&#x9759;&#x6B62;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x60F3;&#x518D;&#x6A21;&#x62DF;&#x5B83;&#x4E86;&#x3002;</p>
<p>&#x5F53;Box2D&#x786E;&#x5B9A;&#x4E00;&#x4E2A;&#x5B9E;&#x4F53;&#xFF08;&#x6216;&#x4E00;&#x7EC4;&#x5B9E;&#x4F53;&#xFF09;&#x5DF2;&#x505C;&#x6B62;&#x65F6;&#xFF0C;&#x8BE5;&#x5B9E;&#x4F53;&#x5C06;&#x8FDB;&#x5165;&#x7761;&#x7720;&#x72B6;&#x6001;&#xFF0C;&#x8BE5;&#x72B6;&#x6001;&#x7684;CPU&#x5F00;&#x9500;&#x975E;&#x5E38;&#x5C0F;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8EAB;&#x4F53;&#x662F;&#x6E05;&#x9192;&#x7684;&#x5E76;&#x4E14;&#x4E0E;&#x4E00;&#x4E2A;&#x7761;&#x7740;&#x7684;&#x8EAB;&#x4F53;&#x76F8;&#x649E;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x7761;&#x7740;&#x7684;&#x8EAB;&#x4F53;&#x5C31;&#x4F1A;&#x9192;&#x6765;&#x3002;&#x5982;&#x679C;&#x8FDE;&#x5728;&#x8EAB;&#x4E0A;&#x7684;&#x5173;&#x8282;&#x6216;&#x63A5;&#x89E6;&#x70B9;&#x88AB;&#x7834;&#x574F;&#xFF0C;&#x5C38;&#x4F53;&#x4E5F;&#x4F1A;&#x9192;&#x6765;&#x3002;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x624B;&#x52A8;&#x5524;&#x9192;&#x5C38;&#x4F53;&#x3002;</p>
<p>&#x5B9E;&#x4F53;&#x5B9A;&#x4E49;&#x5141;&#x8BB8;&#x60A8;&#x6307;&#x5B9A;&#x5B9E;&#x4F53;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x7761;&#x7720;&#x4EE5;&#x53CA;&#x521B;&#x5EFA;&#x7684;&#x5B9E;&#x4F53;&#x662F;&#x5426;&#x5904;&#x4E8E;&#x7761;&#x7720;&#x72B6;&#x6001;&#x3002;</p>
<pre><code class="lang-c++">b2BodyDef bodyDef;
bodyDef.allowSleep = <span class="hljs-literal">true</span>;
bodyDef.awake = <span class="hljs-literal">true</span>;
</code></pre>
<h2 id="&#x56FA;&#x5B9A;&#x65CB;&#x8F6C;">&#x56FA;&#x5B9A;&#x65CB;&#x8F6C;</h2>
<p>&#x60A8;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x521A;&#x4F53;&#xFF08;&#x4F8B;&#x5982;&#x89D2;&#x8272;&#xFF09;&#x5177;&#x6709;&#x56FA;&#x5B9A;&#x7684;&#x65CB;&#x8F6C;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x7269;&#x4F53;&#x5373;&#x4F7F;&#x5728;&#x8D1F;&#x8F7D;&#x4E0B;&#x4E5F;&#x4E0D;&#x5E94;&#x8BE5;&#x65CB;&#x8F6C;&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x201C;&#x56FA;&#x5B9A;&#x65CB;&#x8F6C;&#x201D;&#x8BBE;&#x7F6E;&#x6765;&#x5B9E;&#x73B0;&#x6B64;&#x76EE;&#x7684;&#xFF1A;</p>
<pre><code class="lang-c++">b2BodyDef bodyDef;
bodyDef.fixedRotation = <span class="hljs-literal">true</span>;
</code></pre>
<p>&#x56FA;&#x5B9A;&#x65CB;&#x8F6C;&#x6807;&#x5FD7;&#x4F7F;&#x8F6C;&#x52A8;&#x60EF;&#x91CF;&#x53CA;&#x5176;&#x53CD;&#x5411;&#x8BBE;&#x7F6E;&#x4E3A;&#x96F6;&#x3002;</p>
<h2 id="&#x5B50;&#x5F39;">&#x5B50;&#x5F39;</h2>
<p>&#x6E38;&#x620F;&#x6A21;&#x62DF;&#x901A;&#x5E38;&#x751F;&#x6210;&#x4E00;&#x7CFB;&#x5217;&#x4EE5;&#x4E00;&#x5B9A;&#x5E27;&#x901F;&#x7387;&#x64AD;&#x653E;&#x7684;&#x56FE;&#x50CF;&#x3002;&#x8FD9;&#x53EB;&#x505A;&#x79BB;&#x6563;&#x6A21;&#x62DF;&#x3002;&#x5728;&#x79BB;&#x6563;&#x4EFF;&#x771F;&#x4E2D;&#xFF0C;&#x521A;&#x4F53;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x5185;&#x8FDB;&#x884C;&#x5927;&#x91CF;&#x7684;&#x8FD0;&#x52A8;&#x3002;&#x5982;&#x679C;&#x7269;&#x7406;&#x5F15;&#x64CE;&#x4E0D;&#x80FD;&#x89E3;&#x91CA;&#x5927;&#x8FD0;&#x52A8;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x770B;&#x5230;&#x4E00;&#x4E9B;&#x7269;&#x4F53;&#x9519;&#x8BEF;&#x5730;&#x901A;&#x8FC7;&#x5BF9;&#x65B9;&#x3002;&#x8FD9;&#x79CD;&#x6548;&#x5E94;&#x88AB;&#x79F0;&#x4E3A;&#x96A7;&#x9053;&#x6548;&#x5E94;&#x3002;</p>
<p>&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;Box2D&#x4F7F;&#x7528;&#x8FDE;&#x7EED;&#x78B0;&#x649E;&#x68C0;&#x6D4B;&#xFF08;CCD&#xFF09;&#x6765;&#x9632;&#x6B62;&#x52A8;&#x6001;&#x7269;&#x4F53;&#x7A7F;&#x8FC7;&#x9759;&#x6001;&#x7269;&#x4F53;&#x3002;&#x8FD9;&#x662F;&#x901A;&#x8FC7;&#x5C06;&#x5F62;&#x72B6;&#x4ECE;&#x65E7;&#x4F4D;&#x7F6E;&#x626B;&#x5230;&#x65B0;&#x4F4D;&#x7F6E;&#x6765;&#x5B8C;&#x6210;&#x7684;&#x3002;&#x5F15;&#x64CE;&#x5728;&#x626B;&#x63CF;&#x671F;&#x95F4;&#x67E5;&#x627E;&#x65B0;&#x7684;&#x78B0;&#x649E;&#xFF0C;&#x5E76;&#x8BA1;&#x7B97;&#x8FD9;&#x4E9B;&#x78B0;&#x649E;&#x7684;&#x78B0;&#x649E;&#x65F6;&#x95F4;&#xFF08;TOI&#xFF09;&#x3002;&#x5C06;&#x5B9E;&#x4F53;&#x79FB;&#x52A8;&#x5230;&#x5176;&#x7B2C;&#x4E00;&#x4E2A;TOI&#xFF0C;&#x7136;&#x540E;&#x89E3;&#x7B97;&#x5668;&#x6267;&#x884C;&#x5B50;&#x6B65;&#x9AA4;&#x4EE5;&#x5B8C;&#x6210;&#x6574;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x9AA4;&#x3002;&#x5B50;&#x6B65;&#x9AA4;&#x4E2D;&#x53EF;&#x80FD;&#x6709;&#x5176;&#x4ED6;TOI&#x4E8B;&#x4EF6;&#x3002;</p>
<p>&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x52A8;&#x6001;&#x7269;&#x4F53;&#x4E4B;&#x95F4;&#x4E0D;&#x4F7F;&#x7528;CCD&#x3002;&#x8FD9;&#x6837;&#x505A;&#x662F;&#x4E3A;&#x4E86;&#x4FDD;&#x6301;&#x6027;&#x80FD;&#x5408;&#x7406;&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x6E38;&#x620F;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x52A8;&#x6001;&#x7269;&#x4F53;&#x6765;&#x4F7F;&#x7528;CCD&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x5411;&#x4E00;&#x5806;&#x52A8;&#x6001;&#x7816;&#x5757;&#x53D1;&#x5C04;&#x9AD8;&#x901F;&#x5B50;&#x5F39;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;CCD&#xFF0C;&#x5B50;&#x5F39;&#x53EF;&#x80FD;&#x4F1A;&#x7A7F;&#x8FC7;&#x7816;&#x5757;&#x3002;</p>
<p>Box2D&#x4E2D;&#x5FEB;&#x901F;&#x79FB;&#x52A8;&#x7684;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x6807;&#x8BB0;&#x4E3A;&#x9879;&#x76EE;&#x7B26;&#x53F7;&#x3002;&#x5B50;&#x5F39;&#x5C06;&#x6267;&#x884C;CCD&#x4E0E;&#x9759;&#x6001;&#x548C;&#x52A8;&#x6001;&#x7269;&#x4F53;&#x3002;&#x4F60;&#x5E94;&#x8BE5;&#x6839;&#x636E;&#x4F60;&#x7684;&#x6E38;&#x620F;&#x8BBE;&#x8BA1;&#x6765;&#x51B3;&#x5B9A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x8EAB;&#x4F53;&#x5E94;&#x8BE5;&#x662F;&#x5B50;&#x5F39;&#x3002;&#x5982;&#x679C;&#x60A8;&#x51B3;&#x5B9A;&#x5C06;&#x5C38;&#x4F53;&#x89C6;&#x4E3A;&#x5B50;&#x5F39;&#xFF0C;&#x8BF7;&#x4F7F;&#x7528;&#x4EE5;&#x4E0B;&#x8BBE;&#x7F6E;&#x3002;</p>
<pre><code class="lang-c++">b2BodyDef bodyDef;
bodyDef.bullet = <span class="hljs-literal">true</span>;
</code></pre>
<p>&#x9879;&#x76EE;&#x7B26;&#x53F7;&#x6807;&#x5FD7;&#x4EC5;&#x5F71;&#x54CD;&#x52A8;&#x6001;&#x5B9E;&#x4F53;&#x3002;</p>
<h2 id="&#x6FC0;&#x6D3B;">&#x6FC0;&#x6D3B;</h2>
<p>&#x60A8;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x521B;&#x5EFA;&#x5B9E;&#x4F53;&#xFF0C;&#x4F46;&#x4E0D;&#x53C2;&#x4E0E;&#x78B0;&#x649E;&#x6216;&#x52A8;&#x529B;&#x5B66;&#x3002;&#x8FD9;&#x79CD;&#x72B6;&#x6001;&#x7C7B;&#x4F3C;&#x4E8E;&#x7761;&#x7720;&#xFF0C;&#x53EA;&#x662F;&#x8EAB;&#x4F53;&#x4E0D;&#x4F1A;&#x88AB;&#x5176;&#x4ED6;&#x8EAB;&#x4F53;&#x5524;&#x9192;&#xFF0C;&#x8EAB;&#x4F53;&#x7684;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x4E5F;&#x4E0D;&#x4F1A;&#x653E;&#x5728;&#x5BBD;&#x76F8;&#x4F4D;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x8EAB;&#x4F53;&#x4E0D;&#x4F1A;&#x53C2;&#x4E0E;&#x78B0;&#x649E;&#x3001;&#x5149;&#x7EBF;&#x6295;&#x5C04;&#x7B49;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x5904;&#x4E8E;&#x975E;&#x6D3B;&#x52A8;&#x72B6;&#x6001;&#x7684;&#x5B9E;&#x4F53;&#xFF0C;&#x7136;&#x540E;&#x91CD;&#x65B0;&#x6FC0;&#x6D3B;&#x5B83;&#x3002;</p>
<pre><code class="lang-c++">b2BodyDef bodyDef;
bodyDef.active = <span class="hljs-literal">true</span>;
</code></pre>
<p>&#x5173;&#x8282;&#x53EF;&#x4EE5;&#x8FDE;&#x63A5;&#x5230;&#x975E;&#x6D3B;&#x52A8;&#x4F53;&#x3002;&#x4E0D;&#x4F1A;&#x6A21;&#x62DF;&#x8FD9;&#x4E9B;&#x5173;&#x8282;&#x3002;&#x5F53;&#x4F60;&#x6FC0;&#x6D3B;&#x4E00;&#x4E2A;&#x7269;&#x4F53;&#x65F6;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x5C0F;&#x5FC3;&#x5B83;&#x7684;&#x5173;&#x8282;&#x6CA1;&#x6709;&#x53D8;&#x5F62;&#x3002;</p>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x6FC0;&#x6D3B;&#x5B9E;&#x4F53;&#x51E0;&#x4E4E;&#x4E0E;&#x4ECE;&#x5934;&#x521B;&#x5EFA;&#x5B9E;&#x4F53;&#x4E00;&#x6837;&#x6602;&#x8D35;&#x3002;&#x6240;&#x4EE5;&#x4F60;&#x4E0D;&#x5E94;&#x8BE5;&#x5728;&#x6D41;&#x5A92;&#x4F53;&#x4E16;&#x754C;&#x4E2D;&#x4F7F;&#x7528;&#x6FC0;&#x6D3B;&#x3002;&#x4F7F;&#x7528;&#x6D41;&#x5A92;&#x4F53;&#x4E16;&#x754C;&#x7684;&#x521B;&#x5EFA;/&#x9500;&#x6BC1;&#x6765;&#x8282;&#x7701;&#x5185;&#x5B58;&#x3002;</p>
<h2 id="&#x7528;&#x6237;&#x6570;&#x636E;">&#x7528;&#x6237;&#x6570;&#x636E;</h2>
<p>&#x7528;&#x6237;&#x6570;&#x636E;&#x662F;&#x7A7A;&#x6307;&#x9488;&#x3002;&#x8FD9;&#x4E3A;&#x60A8;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x94A9;&#x5B50;&#xFF0C;&#x7528;&#x4E8E;&#x5C06;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5BF9;&#x8C61;&#x94FE;&#x63A5;&#x5230;&#x5B9E;&#x4F53;&#x3002;&#x60A8;&#x5E94;&#x8BE5;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#xFF0C;&#x4EE5;&#x4FBF;&#x5BF9;&#x6240;&#x6709;&#x4E3B;&#x4F53;&#x7528;&#x6237;&#x6570;&#x636E;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x3002;</p>
<pre><code class="lang-c++">b2BodyDef bodyDef;
bodyDef.userData.pointer = <span class="hljs-keyword">reinterpret_cast</span>&lt;<span class="hljs-keyword">uintptr_t</span>&gt;(&amp;myActor);
</code></pre>
<h2 id="&#x8F66;&#x8EAB;&#x5382;">&#x8F66;&#x8EAB;&#x5382;</h2>
<p>&#x5C38;&#x4F53;&#x662F;&#x7528;&#x4E16;&#x754C;&#x7EA7;&#x7684;&#x5C38;&#x4F53;&#x5DE5;&#x5382;&#x5236;&#x9020;&#x548C;&#x9500;&#x6BC1;&#x7684;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x4E16;&#x754C;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x4E2A;&#x9AD8;&#x6548;&#x7684;&#x5206;&#x914D;&#x5668;&#x521B;&#x5EFA;&#x4E3B;&#x4F53;&#xFF0C;&#x5E76;&#x5C06;&#x4E3B;&#x4F53;&#x6DFB;&#x52A0;&#x5230;world&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E2D;&#x3002;</p>
<pre><code class="lang-c++">b2World* myWorld;
b2Body* dynamicBody = myWorld-&gt;CreateBody(&amp;bodyDef);

<span class="hljs-comment">// ... do stuff ...</span>

myWorld-&gt;DestroyBody(dynamicBody);
dynamicBody = <span class="hljs-literal">nullptr</span>;
</code></pre>
<blockquote>
<p><strong>&#x6CE8;&#x610F;&#x5B89;&#x5168;</strong>&#xFF1A;&#x4E0D;&#x8981;&#x4F7F;&#x7528;new&#x6216;malloc&#x521B;&#x5EFA;&#x5B9E;&#x4F53;&#x3002;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0D;&#x4F1A;&#x77E5;&#x9053;&#x8EAB;&#x4F53;&#xFF0C;&#x8EAB;&#x4F53;&#x4E5F;&#x4E0D;&#x4F1A;&#x88AB;&#x6B63;&#x786E;&#x521D;&#x59CB;&#x5316;&#x3002;</p>
</blockquote>
<p>Box2D&#x4E0D;&#x4FDD;&#x7559;&#x5BF9;body&#x5B9A;&#x4E49;&#x6216;&#x5B83;&#x6240;&#x5305;&#x542B;&#x7684;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x7684;&#x5F15;&#x7528;&#xFF08;&#x9664;&#x4E86;&#x7528;&#x6237;&#x6570;&#x636E;&#x6307;&#x9488;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E34;&#x65F6;&#x5B9E;&#x4F53;&#x5B9A;&#x4E49;&#x5E76;&#x91CD;&#x7528;&#x76F8;&#x540C;&#x7684;&#x5B9E;&#x4F53;&#x5B9A;&#x4E49;&#x3002;</p>
<p>Box2D&#x5141;&#x8BB8;&#x60A8;&#x901A;&#x8FC7;&#x5220;&#x9664;<a href="https://box2d.org/documentation/classb2_world.html" target="_blank">b2World&#x516C;&#x53F8;</a>&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x4E3A;&#x60A8;&#x5B8C;&#x6210;&#x6240;&#x6709;&#x6E05;&#x7406;&#x5DE5;&#x4F5C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x6CE8;&#x610F;&#x5C06;&#x4FDD;&#x5B58;&#x5728;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#x4E2D;&#x7684;&#x8EAB;&#x4F53;&#x6307;&#x9488;&#x4F5C;&#x5E9F;&#x3002;</p>
<p>&#x9500;&#x6BC1;&#x5B9E;&#x4F53;&#x65F6;&#xFF0C;&#x9644;&#x7740;&#x7684;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x548C;&#x8FD0;&#x52A8;&#x7C7B;&#x578B;&#x5C06;&#x81EA;&#x52A8;&#x9500;&#x6BC1;&#x3002;&#x8FD9;&#x5BF9;&#x4E8E;&#x5982;&#x4F55;&#x7BA1;&#x7406;&#x5F62;&#x72B6;&#x548C;&#x5173;&#x8282;&#x6307;&#x9488;&#x5177;&#x6709;&#x91CD;&#x8981;&#x7684;&#x610F;&#x4E49;&#x3002;</p>
<h2 id="&#x4F7F;&#x7528;&#x8EAB;&#x4F53;">&#x4F7F;&#x7528;&#x8EAB;&#x4F53;</h2>
<p>&#x521B;&#x5EFA;&#x5B9E;&#x4F53;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x5BF9;&#x8BE5;&#x5B9E;&#x4F53;&#x6267;&#x884C;&#x8BB8;&#x591A;&#x64CD;&#x4F5C;&#x3002;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#x8BBE;&#x7F6E;&#x8D28;&#x91CF;&#x5C5E;&#x6027;&#x3001;&#x8BBF;&#x95EE;&#x4F4D;&#x7F6E;&#x548C;&#x901F;&#x5EA6;&#x3001;&#x5E94;&#x7528;&#x529B;&#x4EE5;&#x53CA;&#x8F6C;&#x6362;&#x70B9;&#x548C;&#x5411;&#x91CF;&#x3002;</p>
<h2 id="&#x6D77;&#x91CF;&#x6570;&#x636E;">&#x6D77;&#x91CF;&#x6570;&#x636E;</h2>
<p>&#x7269;&#x4F53;&#x6709;&#x8D28;&#x91CF;&#xFF08;&#x6807;&#x91CF;&#xFF09;&#x3001;&#x8D28;&#x5FC3;&#xFF08;2&#x77E2;&#x91CF;&#xFF09;&#x548C;&#x8F6C;&#x52A8;&#x60EF;&#x91CF;&#xFF08;&#x6807;&#x91CF;&#xFF09;&#x3002;&#x5BF9;&#x4E8E;&#x9759;&#x6001;&#x7269;&#x4F53;&#xFF0C;&#x8D28;&#x91CF;&#x548C;&#x8F6C;&#x52A8;&#x60EF;&#x91CF;&#x8BBE;&#x7F6E;&#x4E3A;&#x96F6;&#x3002;&#x5F53;&#x7269;&#x4F53;&#x6709;&#x56FA;&#x5B9A;&#x7684;&#x8F6C;&#x52A8;&#x65F6;&#xFF0C;&#x5B83;&#x7684;&#x8F6C;&#x52A8;&#x60EF;&#x91CF;&#x4E3A;&#x96F6;&#x3002;</p>
<p>&#x901A;&#x5E38;&#xFF0C;&#x5728;&#x5411;&#x5B9E;&#x4F53;&#x6DFB;&#x52A0;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x65F6;&#xFF0C;&#x5C06;&#x81EA;&#x52A8;&#x5EFA;&#x7ACB;&#x5B9E;&#x4F53;&#x7684;&#x8D28;&#x91CF;&#x7279;&#x6027;&#x3002;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#x8EAB;&#x4F53;&#x7684;&#x8D28;&#x91CF;&#x3002;&#x8FD9;&#x901A;&#x5E38;&#x662F;&#x5F53;&#x4F60;&#x6709;&#x7279;&#x6B8A;&#x7684;&#x6E38;&#x620F;&#x573A;&#x666F;&#x9700;&#x8981;&#x6539;&#x53D8;&#x8D28;&#x91CF;&#x3002;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">void</span> b2Body::SetMassData(<span class="hljs-keyword">const</span> b2MassData* data);
</code></pre>
<p>&#x5728;&#x76F4;&#x63A5;&#x8BBE;&#x7F6E;&#x5B9E;&#x4F53;&#x7684;&#x8D28;&#x91CF;&#x4E4B;&#x540E;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x6062;&#x590D;&#x5230;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x6307;&#x5B9A;&#x7684;&#x81EA;&#x7136;&#x8D28;&#x91CF;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#xFF1A;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">void</span> b2Body::ResetMassData();
</code></pre>
<p>&#x8F66;&#x8EAB;&#x8D28;&#x91CF;&#x6570;&#x636E;&#x53EF;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x529F;&#x80FD;&#x83B7;&#x5F97;&#xFF1A;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">float</span> b2Body::GetMass() <span class="hljs-keyword">const</span>;
<span class="hljs-keyword">float</span> b2Body::GetInertia() <span class="hljs-keyword">const</span>;
<span class="hljs-keyword">const</span> b2Vec2&amp; b2Body::GetLocalCenter() <span class="hljs-keyword">const</span>;
<span class="hljs-keyword">void</span> b2Body::GetMassData(b2MassData* data) <span class="hljs-keyword">const</span>;
</code></pre>
<h2 id="&#x72B6;&#x6001;&#x4FE1;&#x606F;">&#x72B6;&#x6001;&#x4FE1;&#x606F;</h2>
<p>&#x8EAB;&#x4F53;&#x7684;&#x72B6;&#x6001;&#x6709;&#x5F88;&#x591A;&#x65B9;&#x9762;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x51FD;&#x6570;&#x6709;&#x6548;&#x5730;&#x8BBF;&#x95EE;&#x6B64;&#x72B6;&#x6001;&#x6570;&#x636E;&#xFF1A;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">void</span> b2Body::SetType(b2BodyType type);
b2BodyType b2Body::GetType();
<span class="hljs-keyword">void</span> b2Body::SetBullet(<span class="hljs-keyword">bool</span> flag);
<span class="hljs-keyword">bool</span> b2Body::IsBullet() <span class="hljs-keyword">const</span>;
<span class="hljs-keyword">void</span> b2Body::SetSleepingAllowed(<span class="hljs-keyword">bool</span> flag);
<span class="hljs-keyword">bool</span> b2Body::IsSleepingAllowed() <span class="hljs-keyword">const</span>;
<span class="hljs-keyword">void</span> b2Body::SetAwake(<span class="hljs-keyword">bool</span> flag);
<span class="hljs-keyword">bool</span> b2Body::IsAwake() <span class="hljs-keyword">const</span>;
<span class="hljs-keyword">void</span> b2Body::SetEnabled(<span class="hljs-keyword">bool</span> flag);
<span class="hljs-keyword">bool</span> b2Body::IsEnabled() <span class="hljs-keyword">const</span>;
<span class="hljs-keyword">void</span> b2Body::SetFixedRotation(<span class="hljs-keyword">bool</span> flag);
<span class="hljs-keyword">bool</span> b2Body::IsFixedRotation() <span class="hljs-keyword">const</span>;
</code></pre>
<h2 id="&#x4F4D;&#x7F6E;&#x548C;&#x901F;&#x5EA6;">&#x4F4D;&#x7F6E;&#x548C;&#x901F;&#x5EA6;</h2>
<p>&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5B9E;&#x4F53;&#x7684;&#x4F4D;&#x7F6E;&#x548C;&#x65CB;&#x8F6C;&#x3002;&#x8FD9;&#x5728;&#x6E32;&#x67D3;&#x5173;&#x8054;&#x7684;&#x6E38;&#x620F;&#x89D2;&#x8272;&#x65F6;&#x5F88;&#x5E38;&#x89C1;&#x3002;&#x60A8;&#x4E5F;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x4F4D;&#x7F6E;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x4E0D;&#x592A;&#x5E38;&#x89C1;&#xFF0C;&#x56E0;&#x4E3A;&#x60A8;&#x901A;&#x5E38;&#x4F7F;&#x7528;Box2D&#x6765;&#x6A21;&#x62DF;&#x79FB;&#x52A8;&#x3002;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">bool</span> b2Body::SetTransform(<span class="hljs-keyword">const</span> b2Vec2&amp; position, <span class="hljs-keyword">float</span> angle);
<span class="hljs-keyword">const</span> b2Transform&amp; b2Body::GetTransform() <span class="hljs-keyword">const</span>;
<span class="hljs-keyword">const</span> b2Vec2&amp; b2Body::GetPosition() <span class="hljs-keyword">const</span>;
<span class="hljs-keyword">float</span> b2Body::GetAngle() <span class="hljs-keyword">const</span>;
</code></pre>
<p>&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x672C;&#x5730;&#x5750;&#x6807;&#x548C;&#x4E16;&#x754C;&#x5750;&#x6807;&#x4E2D;&#x7684;&#x8D28;&#x5FC3;&#x4F4D;&#x7F6E;&#x3002;Box2D&#x4E2D;&#x7684;&#x5927;&#x90E8;&#x5206;&#x5185;&#x90E8;&#x6A21;&#x62DF;&#x90FD;&#x4F7F;&#x7528;&#x8D28;&#x5FC3;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x60A8;&#x901A;&#x5E38;&#x4E0D;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x5B83;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x60A8;&#x901A;&#x5E38;&#x4F1A;&#x4F7F;&#x7528;&#x8EAB;&#x4F53;&#x53D8;&#x6362;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x6B63;&#x65B9;&#x5F62;&#x7684;&#x8EAB;&#x4F53;&#x3002;&#x7269;&#x4F53;&#x7684;&#x539F;&#x70B9;&#x53EF;&#x80FD;&#x662F;&#x6B63;&#x65B9;&#x5F62;&#x7684;&#x4E00;&#x89D2;&#xFF0C;&#x800C;&#x8D28;&#x5FC3;&#x4F4D;&#x4E8E;&#x6B63;&#x65B9;&#x5F62;&#x7684;&#x4E2D;&#x5FC3;&#x3002;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">const</span> b2Vec2&amp; b2Body::GetWorldCenter() <span class="hljs-keyword">const</span>;
<span class="hljs-keyword">const</span> b2Vec2&amp; b2Body::GetLocalCenter() <span class="hljs-keyword">const</span>;
</code></pre>
<p>&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x7EBF;&#x901F;&#x5EA6;&#x548C;&#x89D2;&#x901F;&#x5EA6;&#x3002;&#x7EBF;&#x901F;&#x5EA6;&#x4EE3;&#x8868;&#x8D28;&#x5FC3;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x8D28;&#x91CF;&#x7279;&#x6027;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x7EBF;&#x901F;&#x5EA6;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;</p>
<h2 id="&#x529B;&#x548C;&#x51B2;&#x52A8;">&#x529B;&#x548C;&#x51B2;&#x52A8;</h2>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x5BF9;&#x7269;&#x4F53;&#x65BD;&#x52A0;&#x529B;&#x3001;&#x529B;&#x77E9;&#x548C;&#x8109;&#x51B2;&#x3002;&#x5F53;&#x5E94;&#x7528;&#x529B;&#x6216;&#x51B2;&#x91CF;&#x65F6;&#xFF0C;&#x5C06;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x65BD;&#x52A0;&#x8F7D;&#x8377;&#x7684;&#x4E16;&#x754C;&#x70B9;&#x3002;&#x8FD9;&#x901A;&#x5E38;&#x4F1A;&#x4EA7;&#x751F;&#x7ED5;&#x8D28;&#x5FC3;&#x7684;&#x529B;&#x77E9;&#x3002;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">void</span> b2Body::ApplyForce(<span class="hljs-keyword">const</span> b2Vec2&amp; force, <span class="hljs-keyword">const</span> b2Vec2&amp; point);
<span class="hljs-keyword">void</span> b2Body::ApplyTorque(<span class="hljs-keyword">float</span> torque);
<span class="hljs-keyword">void</span> b2Body::ApplyLinearImpulse(<span class="hljs-keyword">const</span> b2Vec2&amp; impulse, <span class="hljs-keyword">const</span> b2Vec2&amp; point);
<span class="hljs-keyword">void</span> b2Body::ApplyAngularImpulse(<span class="hljs-keyword">float</span> impulse);
</code></pre>
<p>&#x65BD;&#x52A0;&#x4E00;&#x4E2A;&#x529B;&#x3001;&#x8F6C;&#x77E9;&#x6216;&#x8109;&#x51B2;&#x4F1A;&#x5524;&#x9192;&#x8EAB;&#x4F53;&#x3002;&#x6709;&#x65F6;&#x8FD9;&#x662F;&#x4E0D;&#x53EF;&#x53D6;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x6B63;&#x5728;&#x65BD;&#x52A0;&#x4E00;&#x4E2A;&#x7A33;&#x5B9A;&#x7684;&#x529B;&#xFF0C;&#x5E76;&#x60F3;&#x8BA9;&#x8EAB;&#x4F53;&#x7761;&#x89C9;&#x6765;&#x63D0;&#x9AD8;&#x8868;&#x73B0;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#x3002;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">if</span> (myBody-&gt;IsAwake() == <span class="hljs-literal">true</span>)
{
    myBody-&gt;ApplyForce(myForce, myPoint);
}
</code></pre>
<h2 id="&#x5750;&#x6807;&#x53D8;&#x6362;">&#x5750;&#x6807;&#x53D8;&#x6362;</h2>
<p>body&#x7C7B;&#x6709;&#x4E00;&#x4E9B;&#x5B9E;&#x7528;&#x51FD;&#x6570;&#xFF0C;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x60A8;&#x5728;&#x5C40;&#x90E8;&#x7A7A;&#x95F4;&#x548C;&#x4E16;&#x754C;&#x7A7A;&#x95F4;&#x4E4B;&#x95F4;&#x8F6C;&#x6362;&#x70B9;&#x548C;&#x5411;&#x91CF;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x660E;&#x767D;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#xFF0C;&#x8BF7;&#x9605;&#x8BFB;&#x5409;&#x59C6;&#xB7;&#x8303;&#x7EF4;&#x601D;&#x548C;&#x62C9;&#x5C14;&#x65AF;&#xB7;&#x6BD5;&#x8096;&#x666E;&#x7684;&#x300A;&#x6E38;&#x620F;&#x548C;&#x4EA4;&#x4E92;&#x5E94;&#x7528;&#x7684;&#x57FA;&#x672C;&#x6570;&#x5B66;&#x300B;&#x3002;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x662F;&#x6709;&#x6548;&#x7684;&#xFF08;&#x5185;&#x8054;&#x65F6;&#xFF09;&#x3002;</p>
<pre><code class="lang-c++">b2Vec2 b2Body::GetWorldPoint(<span class="hljs-keyword">const</span> b2Vec2&amp; localPoint);
b2Vec2 b2Body::GetWorldVector(<span class="hljs-keyword">const</span> b2Vec2&amp; localVector);
b2Vec2 b2Body::GetLocalPoint(<span class="hljs-keyword">const</span> b2Vec2&amp; worldPoint);
b2Vec2 b2Body::GetLocalVector(<span class="hljs-keyword">const</span> b2Vec2&amp; worldVector);
</code></pre>
<h2 id="&#x63A5;&#x89E6;&#x5939;&#x5177;&#x3001;&#x63A5;&#x5934;&#x548C;&#x89E6;&#x70B9;">&#x63A5;&#x89E6;&#x5939;&#x5177;&#x3001;&#x63A5;&#x5934;&#x548C;&#x89E6;&#x70B9;</h2>
<p>&#x53EF;&#x4EE5;&#x5BF9;&#x5B9E;&#x4F53;&#x7684;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x8FDB;&#x884C;&#x8FED;&#x4EE3;&#x3002;&#x5982;&#x679C;&#x9700;&#x8981;&#x8BBF;&#x95EE;fixture&#x7684;&#x7528;&#x6237;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">for</span> (b2Fixture* f = body-&gt;GetFixtureList(); f; f = f-&gt;GetNext())
{
    MyFixtureData* data = (MyFixtureData*)f-&gt;GetUserData();
    <span class="hljs-comment">// do something with data ...</span>
}
</code></pre>
<p>&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x53EF;&#x4EE5;&#x8FED;&#x4EE3;&#x5B9E;&#x4F53;&#x7684;&#x5173;&#x8282;&#x5217;&#x8868;&#x3002;</p>
<p>&#x4E3B;&#x4F53;&#x8FD8;&#x63D0;&#x4F9B;&#x5173;&#x8054;&#x8054;&#x7CFB;&#x4EBA;&#x7684;&#x5217;&#x8868;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x6765;&#x83B7;&#x53D6;&#x5173;&#x4E8E;&#x5F53;&#x524D;&#x8054;&#x7CFB;&#x4EBA;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x8BF7;&#x5C0F;&#x5FC3;&#xFF0C;&#x56E0;&#x4E3A;&#x8054;&#x7CFB;&#x4EBA;&#x5217;&#x8868;&#x53EF;&#x80FD;&#x4E0D;&#x5305;&#x542B;&#x4E0A;&#x4E00;&#x65F6;&#x95F4;&#x6B65;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x6240;&#x6709;&#x8054;&#x7CFB;&#x4EBA;&#x3002;</p>
<h1 id="&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;">&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;</h1>
<p>&#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#xFF0C;&#x5F62;&#x72B6;&#x5E76;&#x4E0D;&#x4E86;&#x89E3;&#x7269;&#x4F53;&#xFF0C;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x4E8E;&#x7269;&#x7406;&#x6A21;&#x62DF;&#x6765;&#x4F7F;&#x7528;&#x3002;&#x56E0;&#x6B64;&#xFF0C;Box2D&#x63D0;&#x4F9B;<a href="https://box2d.org/documentation/classb2_fixture.html" target="_blank">B2&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;</a>&#x7C7B;&#x5C06;&#x5F62;&#x72B6;&#x9644;&#x52A0;&#x5230;&#x5B9E;&#x4F53;&#x3002;&#x4E00;&#x4E2A;&#x5B9E;&#x4F53;&#x53EF;&#x4EE5;&#x6709;&#x96F6;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x3002;&#x5177;&#x6709;&#x591A;&#x4E2A;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x7684;&#x5B9E;&#x4F53;&#x6709;&#x65F6;&#x79F0;&#x4E3A;<em>&#x590D;&#x5408;&#x4F53;</em></p>
<p>&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x5355;&#x4E00;&#x5F62;&#x72B6;</li>
<li>&#x5BBD;&#x76F8;&#x4F4D;&#x4EE3;&#x7406;</li>
<li>&#x5BC6;&#x5EA6;&#x3001;&#x6469;&#x64E6;&#x548C;&#x6062;&#x590D;</li>
<li>&#x51B2;&#x7A81;&#x8FC7;&#x6EE4;&#x6807;&#x5FD7;</li>
<li>&#x6307;&#x5411;&#x7236;&#x5B9E;&#x4F53;&#x7684;&#x540E;&#x9000;&#x6307;&#x9488;</li>
<li>&#x7528;&#x6237;&#x6570;&#x636E;</li>
<li>&#x4F20;&#x611F;&#x5668;&#x6807;&#x5FD7;</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x5C06;&#x5728;&#x4EE5;&#x4E0B;&#x7AE0;&#x8282;&#x4E2D;&#x8FDB;&#x884C;&#x63CF;&#x8FF0;&#x3002;</p>
<h2 id="&#x5939;&#x5177;&#x521B;&#x5EFA;">&#x5939;&#x5177;&#x521B;&#x5EFA;</h2>
<p>&#x901A;&#x8FC7;&#x521D;&#x59CB;&#x5316;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x5B9A;&#x4E49;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5B9A;&#x4E49;&#x4F20;&#x9012;&#x7ED9;&#x7236;&#x5B9E;&#x4F53;&#x6765;&#x521B;&#x5EFA;&#x88C5;&#x7F6E;&#x3002;</p>
<pre><code class="lang-c++">b2Body* myBody;
b2FixtureDef fixtureDef;
fixtureDef.shape = &amp;myShape;
fixtureDef.density = <span class="hljs-number">1.0f</span>;
b2Fixture* myFixture = myBody-&gt;CreateFixture(&amp;fixtureDef);
</code></pre>
<p>&#x8FD9;&#x5C06;&#x521B;&#x5EFA;&#x8BBE;&#x5907;&#x5E76;&#x5C06;&#x5176;&#x9644;&#x52A0;&#x5230;&#x5B9E;&#x4F53;&#x3002;&#x60A8;&#x4E0D;&#x9700;&#x8981;&#x5B58;&#x50A8;fixture&#x6307;&#x9488;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x7236;&#x5B9E;&#x4F53;&#x88AB;&#x9500;&#x6BC1;&#x65F6;&#xFF0C;fixture&#x5C06;&#x81EA;&#x52A8;&#x9500;&#x6BC1;&#x3002;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x4E2A;&#x5B9E;&#x4F53;&#x4E0A;&#x521B;&#x5EFA;&#x591A;&#x4E2A;&#x88C5;&#x7F6E;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x9500;&#x6BC1;&#x7236;&#x5B9E;&#x4F53;&#x4E0A;&#x7684;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x505A;&#x6765;&#x5EFA;&#x6A21;&#x4E00;&#x4E2A;&#x6613;&#x788E;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x53EA;&#x7559;&#x4E0B;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#xFF0C;&#x8BA9;&#x5C38;&#x4F53;&#x9500;&#x6BC1;&#x8D1F;&#x8D23;&#x9500;&#x6BC1;&#x9644;&#x7740;&#x7684;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x3002;</p>
<pre><code class="lang-c++">myBody-&gt;DestroyFixture(myFixture);
</code></pre>
<h2 id="&#x5BC6;&#x5EA6;">&#x5BC6;&#x5EA6;</h2>
<p>&#x5939;&#x5177;&#x5BC6;&#x5EA6;&#x7528;&#x4E8E;&#x8BA1;&#x7B97;&#x7236;&#x5B9E;&#x4F53;&#x7684;&#x8D28;&#x91CF;&#x7279;&#x6027;&#x3002;&#x5BC6;&#x5EA6;&#x53EF;&#x4EE5;&#x4E3A;&#x96F6;&#x6216;&#x6B63;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x5728;&#x6240;&#x6709;&#x7684;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x4E0A;&#x4F7F;&#x7528;&#x76F8;&#x4F3C;&#x7684;&#x5BC6;&#x5EA6;&#x3002;&#x8FD9;&#x5C06;&#x63D0;&#x9AD8;&#x5806;&#x53E0;&#x7A33;&#x5B9A;&#x6027;&#x3002;</p>
<p>&#x8BBE;&#x7F6E;&#x201C;&#x5BC6;&#x5EA6;&#x201D;&#x65F6;&#xFF0C;&#x4E0D;&#x4F1A;&#x8C03;&#x6574;&#x5B9E;&#x4F53;&#x7684;&#x8D28;&#x91CF;&#x3002;&#x5FC5;&#x987B;&#x8C03;&#x7528;ResetMassData&#x624D;&#x80FD;&#x53D1;&#x751F;&#x6B64;&#x60C5;&#x51B5;&#x3002;</p>
<pre><code class="lang-c++">b2Fixture* fixture;
fixture-&gt;SetDensity(<span class="hljs-number">5.0f</span>);
b2Body*
body-&gt;ResetMassData();
</code></pre>
<h2 id="&#x6469;&#x64E6;">&#x6469;&#x64E6;</h2>
<p>&#x6469;&#x64E6;&#x529B;&#x7528;&#x4E8E;&#x4F7F;&#x5BF9;&#x8C61;&#x771F;&#x5B9E;&#x5730;&#x6CBF;&#x7740;&#x5F7C;&#x6B64;&#x6ED1;&#x52A8;&#x3002;Box2D&#x652F;&#x6301;&#x9759;&#x6001;&#x548C;&#x52A8;&#x6001;&#x6469;&#x64E6;&#xFF0C;&#x4F46;&#x5BF9;&#x4E24;&#x8005;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x53C2;&#x6570;&#x3002;&#x5728;Box2D&#x4E2D;&#x7CBE;&#x786E;&#x6A21;&#x62DF;&#x6469;&#x64E6;&#xFF0C;&#x6469;&#x64E6;&#x5F3A;&#x5EA6;&#x4E0E;&#x6CD5;&#x5411;&#x529B;&#x6210;&#x6B63;&#x6BD4;&#xFF08;&#x79F0;&#x4E3A;&#x5E93;&#x4ED1;&#x6469;&#x64E6;&#xFF09;&#x3002;&#x6469;&#x64E6;&#x529B;&#x53C2;&#x6570;&#x901A;&#x5E38;&#x8BBE;&#x7F6E;&#x5728;0&#x548C;1&#x4E4B;&#x95F4;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x4F55;&#x975E;&#x8D1F;&#x503C;&#x3002;&#x201C;&#x6469;&#x64E6;&#x529B;&#x201D;&#xFF08;friction&#xFF09;&#x503C;&#x4E3A;0&#x5C06;&#x7981;&#x7528;&#x201C;&#x6469;&#x64E6;&#x529B;&#x201D;&#xFF08;friction&#xFF09;&#xFF0C;&#x503C;&#x4E3A;1&#x65F6;&#xFF0C;&#x6469;&#x64E6;&#x529B;&#x5C06;&#x589E;&#x5F3A;&#x3002;&#x8BA1;&#x7B97;&#x4E24;&#x4E2A;&#x5F62;&#x72B6;&#x4E4B;&#x95F4;&#x7684;&#x6469;&#x64E6;&#x529B;&#x65F6;&#xFF0C;Box2D&#x5FC5;&#x987B;&#x7EC4;&#x5408;&#x4E24;&#x4E2A;&#x7236;&#x5939;&#x5177;&#x7684;&#x6469;&#x64E6;&#x53C2;&#x6570;&#x3002;&#x4F7F;&#x7528;&#x51E0;&#x4F55;&#x5E73;&#x5747;&#x503C;&#xFF1A;</p>
<pre><code class="lang-c++">b2Fixture* fixtureA;
b2Fixture* fixtureB;
<span class="hljs-keyword">float</span> friction;
friction = sqrtf(fixtureA-&gt;friction * fixtureB-&gt;friction);
</code></pre>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5939;&#x5177;&#x7684;&#x6469;&#x64E6;&#x529B;&#x4E3A;&#x96F6;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x63A5;&#x89E6;&#x70B9;&#x7684;&#x6469;&#x64E6;&#x529B;&#x5C31;&#x4E3A;&#x96F6;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x66FF;&#x4EE3;&#x9ED8;&#x8BA4;&#x7684;&#x6DF7;&#x5408;&#x6469;&#x64E6;&#x529B;<code>b2Contact::SetFriction</code>. &#x901A;&#x5E38;&#x5728;<code>b2ContactListener</code>&#x56DE;&#x62E8;</p>
<h2 id="&#x5F52;&#x8FD8;">&#x5F52;&#x8FD8;</h2>
<p>&#x6062;&#x590D;&#x7528;&#x4E8E;&#x4F7F;&#x5BF9;&#x8C61;&#x53CD;&#x5F39;&#x3002;&#x6062;&#x590D;&#x503C;&#x901A;&#x5E38;&#x8BBE;&#x7F6E;&#x4E3A;0&#x5230;1&#x4E4B;&#x95F4;&#x3002;&#x8BF7;&#x8003;&#x8651;&#x5C06;&#x7403;&#x6254;&#x5230;&#x684C;&#x4E0A;&#x3002;&#x503C;&#x4E3A;&#x96F6;&#x8868;&#x793A;&#x7403;&#x4E0D;&#x4F1A;&#x53CD;&#x5F39;&#x3002;&#x8FD9;&#x79F0;&#x4E3A;&#x975E;&#x5F39;&#x6027;&#x78B0;&#x649E;&#x3002;&#x503C;&#x4E3A;1&#x610F;&#x5473;&#x7740;&#x7403;&#x7684;&#x901F;&#x5EA6;&#x5C06;&#x88AB;&#x7CBE;&#x786E;&#x5730;&#x53CD;&#x6620;&#x51FA;&#x6765;&#x3002;&#x8FD9;&#x53EB;&#x505A;&#x5B8C;&#x5168;&#x5F39;&#x6027;&#x78B0;&#x649E;&#x3002;&#x6062;&#x590D;&#x4F7F;&#x7528;&#x4EE5;&#x4E0B;&#x516C;&#x5F0F;&#x7EC4;&#x5408;&#x3002;</p>
<pre><code class="lang-c++">b2Fixture* fixtureA;
b2Fixture* fixtureB;
<span class="hljs-keyword">float</span> restitution;
restitution = b2Max(fixtureA-&gt;restitution, fixtureB-&gt;restitution);
</code></pre>
<p>&#x6062;&#x590D;&#x662F;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x6CA1;&#x6709;&#x5F39;&#x6027;&#x5730;&#x677F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x6709;&#x5F39;&#x6027;&#x7684;&#x8D85;&#x7EA7;&#x7403;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x91CD;&#x5199;&#x9ED8;&#x8BA4;&#x7684;&#x6DF7;&#x5408;&#x6062;&#x590D;<code>b2Contact::SetRestitution</code>. &#x901A;&#x5E38;&#x5728;<a href="https://box2d.org/documentation/classb2_contact_listener.html" target="_blank"> b2ContactListener</a>&#x56DE;&#x62E8;</p>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x5F62;&#x72B6;&#x53D1;&#x751F;&#x591A;&#x4E2A;&#x63A5;&#x89E6;&#x65F6;&#xFF0C;&#x6062;&#x590D;&#x8FC7;&#x7A0B;&#x662F;&#x8FD1;&#x4F3C;&#x6A21;&#x62DF;&#x7684;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;Box2D&#x4F7F;&#x7528;&#x8FED;&#x4EE3;&#x89E3;&#x7B97;&#x5668;&#x3002;&#x5F53;&#x78B0;&#x649E;&#x901F;&#x5EA6;&#x5F88;&#x5C0F;&#x65F6;&#xFF0C;Box2D&#x8FD8;&#x4F7F;&#x7528;&#x975E;&#x5F39;&#x6027;&#x78B0;&#x649E;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x662F;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x6296;&#x52A8;&#x3002;&#x770B;&#x5230;&#x4E86;&#x5417;<code>b2_velocityThreshold</code> .</p>
<h2 id="&#x8FC7;&#x6EE4;">&#x8FC7;&#x6EE4;</h2>
<p>&#x78B0;&#x649E;&#x8FC7;&#x6EE4;&#x5141;&#x8BB8;&#x60A8;&#x9632;&#x6B62;&#x8BBE;&#x5907;&#x4E4B;&#x95F4;&#x7684;&#x78B0;&#x649E;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x5851;&#x9020;&#x4E86;&#x4E00;&#x4E2A;&#x9A91;&#x81EA;&#x884C;&#x8F66;&#x7684;&#x89D2;&#x8272;&#x3002;&#x60A8;&#x5E0C;&#x671B;&#x81EA;&#x884C;&#x8F66;&#x4E0E;&#x5730;&#x5F62;&#x78B0;&#x649E;&#xFF0C;&#x89D2;&#x8272;&#x4E0E;&#x5730;&#x5F62;&#x78B0;&#x649E;&#xFF0C;&#x4F46;&#x4E0D;&#x5E0C;&#x671B;&#x89D2;&#x8272;&#x4E0E;&#x81EA;&#x884C;&#x8F66;&#x78B0;&#x649E;&#xFF08;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x5FC5;&#x987B;&#x91CD;&#x53E0;&#xFF09;&#x3002;Box2D&#x652F;&#x6301;&#x4F7F;&#x7528;&#x7C7B;&#x522B;&#x548C;&#x7EC4;&#x8FDB;&#x884C;&#x8FD9;&#x79CD;&#x51B2;&#x7A81;&#x8FC7;&#x6EE4;&#x3002;</p>
<p>Box2D&#x652F;&#x6301;16&#x4E2A;&#x78B0;&#x649E;&#x7C7B;&#x522B;&#x3002;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x8BBE;&#x5907;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x5B83;&#x5C5E;&#x4E8E;&#x54EA;&#x4E2A;&#x7C7B;&#x522B;&#x3002;&#x8FD8;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x6B64;&#x8BBE;&#x5907;&#x53EF;&#x80FD;&#x4E0E;&#x54EA;&#x4E9B;&#x5176;&#x4ED6;&#x7C7B;&#x522B;&#x53D1;&#x751F;&#x51B2;&#x7A81;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x4E2A;&#x591A;&#x4EBA;&#x6E38;&#x620F;&#x4E2D;&#x6307;&#x5B9A;&#x6240;&#x6709;&#x73A9;&#x5BB6;&#x4E0D;&#x4F1A;&#x4E92;&#x76F8;&#x78B0;&#x649E;&#xFF0C;&#x602A;&#x7269;&#x4E5F;&#x4E0D;&#x4F1A;&#x4E92;&#x76F8;&#x78B0;&#x649E;&#xFF0C;&#x4F46;&#x662F;&#x73A9;&#x5BB6;&#x548C;&#x602A;&#x7269;&#x5E94;&#x8BE5;&#x78B0;&#x649E;&#x3002;&#x8FD9;&#x662F;&#x7528;&#x63A9;&#x853D;&#x4F4D;&#x5B8C;&#x6210;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code class="lang-c++">b2FixtureDef playerFixtureDef, monsterFixtureDef;
playerFixtureDef.filter.categoryBits = <span class="hljs-number">0x0002</span>;
monsterFixtureDef.filter.categoryBits = <span class="hljs-number">0x0004</span>;
playerFixtureDef.filter.maskBits = <span class="hljs-number">0x0004</span>;
monsterFixtureDef.filter.maskBits = <span class="hljs-number">0x0002</span>;
</code></pre>
<p>&#x4EE5;&#x4E0B;&#x662F;&#x53D1;&#x751F;&#x78B0;&#x649E;&#x7684;&#x89C4;&#x5219;&#xFF1A;</p>
<pre><code class="lang-c++">uint16 catA = fixtureA.filter.categoryBits;
uint16 maskA = fixtureA.filter.maskBits;
uint16 catB = fixtureB.filter.categoryBits;
uint16 maskB = fixtureB.filter.maskBits;

<span class="hljs-keyword">if</span> ((catA &amp; maskB) != <span class="hljs-number">0</span> &amp;&amp; (catB &amp; maskA) != <span class="hljs-number">0</span>)
{
    <span class="hljs-comment">// fixtures can collide</span>
}
</code></pre>
<p>&#x4F7F;&#x7528;&#x78B0;&#x649E;&#x7EC4;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x6574;&#x6570;&#x7EC4;&#x7D22;&#x5F15;&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7EC4;&#x7D22;&#x5F15;&#x7684;&#x6240;&#x6709;&#x88C5;&#x7F6E;&#x59CB;&#x7EC8;&#x78B0;&#x649E;&#xFF08;&#x6B63;&#x7D22;&#x5F15;&#xFF09;&#x6216;&#x4ECE;&#x4E0D;&#x78B0;&#x649E;&#xFF08;&#x8D1F;&#x7D22;&#x5F15;&#xFF09;&#x3002;&#x7EC4;&#x7D22;&#x5F15;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x8868;&#x793A;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x76F8;&#x5173;&#x7684;&#x4E8B;&#x7269;&#xFF0C;&#x4F8B;&#x5982;&#x81EA;&#x884C;&#x8F66;&#x7684;&#x96F6;&#x4EF6;&#x3002;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;fixture1&#x548C;fixture2&#x59CB;&#x7EC8;&#x51B2;&#x7A81;&#xFF0C;&#x4F46;&#x662F;fixture3&#x548C;fixture4&#x4ECE;&#x4E0D;&#x51B2;&#x7A81;&#x3002;</p>
<pre><code class="lang-c++">fixture1Def.filter.groupIndex = <span class="hljs-number">2</span>;
fixture2Def.filter.groupIndex = <span class="hljs-number">2</span>;
fixture3Def.filter.groupIndex = <span class="hljs-number">-8</span>;
fixture4Def.filter.groupIndex = <span class="hljs-number">-8</span>;
</code></pre>
<p>&#x6839;&#x636E;&#x7C7B;&#x522B;&#x548C;&#x63A9;&#x7801;&#x4F4D;&#x8FC7;&#x6EE4;&#x4E0D;&#x540C;&#x7EC4;&#x7D22;&#x5F15;&#x7684;&#x5939;&#x5177;&#x4E4B;&#x95F4;&#x7684;&#x51B2;&#x7A81;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x7EC4;&#x8FC7;&#x6EE4;&#x6BD4;&#x7C7B;&#x522B;&#x8FC7;&#x6EE4;&#x5177;&#x6709;&#x66F4;&#x9AD8;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x3002;</p>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;Box2D&#x4E2D;&#x4F1A;&#x51FA;&#x73B0;&#x989D;&#x5916;&#x7684;&#x78B0;&#x649E;&#x8FC7;&#x6EE4;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x5217;&#x8868;&#xFF1A;</p>
<ul>
<li>&#x9759;&#x6001;&#x5B9E;&#x4F53;&#x4E0A;&#x7684;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x53EA;&#x80FD;&#x4E0E;&#x52A8;&#x6001;&#x5B9E;&#x4F53;&#x78B0;&#x649E;&#x3002;</li>
<li>&#x8FD0;&#x52A8;&#x5B9E;&#x4F53;&#x4E0A;&#x7684;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x53EA;&#x80FD;&#x4E0E;&#x52A8;&#x6001;&#x5B9E;&#x4F53;&#x78B0;&#x649E;&#x3002;</li>
<li>&#x540C;&#x4E00;&#x7269;&#x4F53;&#x4E0A;&#x7684;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x4E0D;&#x4F1A;&#x76F8;&#x4E92;&#x78B0;&#x649E;&#x3002;</li>
<li>&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x542F;&#x7528;/&#x7981;&#x7528;&#x7531;&#x5173;&#x8282;&#x8FDE;&#x63A5;&#x7684;&#x5B9E;&#x4F53;&#x4E0A;&#x7684;&#x88C5;&#x7F6E;&#x4E4B;&#x95F4;&#x7684;&#x78B0;&#x649E;&#x3002;</li>
</ul>
<p>&#x6709;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5728;&#x521B;&#x5EFA;&#x8BBE;&#x5907;&#x540E;&#x66F4;&#x6539;&#x78B0;&#x649E;&#x8FC7;&#x6EE4;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;<a href="https://box2d.org/documentation/structb2_filter.html" target="_blank">B2&#x8FC7;&#x6EE4;&#x5668;</a>&#x5728;&#x73B0;&#x6709;&#x5939;&#x5177;&#x4E0A;&#x4F7F;&#x7528;<a href="https://box2d.org/documentation/classb2_fixture.html#ad956250d9f684a407992ec178320127e" target="_blank"> b2Fixture:&#xFF1A;GetFilterData</a>&#x548C;<a href="https://box2d.org/documentation/classb2_fixture.html#a2c5e0d12c174927a4ad550459be334ad" target="_blank"> B2Fixture:&#xFF1A;&#x8BBE;&#x7F6E;&#x7B5B;&#x9009;&#x5668;&#x6570;&#x636E;</a>. &#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x9AA4;&#x4E4B;&#x524D;&#xFF0C;&#x66F4;&#x6539;&#x7B5B;&#x9009;&#x5668;&#x6570;&#x636E;&#x4E0D;&#x4F1A;&#x6DFB;&#x52A0;&#x6216;&#x5220;&#x9664;&#x8054;&#x7CFB;&#x4EBA;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x4E16;&#x754C;&#x7EA7;&#xFF09;&#x3002;</p>
<h2 id="&#x4F20;&#x611F;&#x5668;">&#x4F20;&#x611F;&#x5668;</h2>
<p>&#x6709;&#x65F6;&#x6E38;&#x620F;&#x903B;&#x8F91;&#x9700;&#x8981;&#x77E5;&#x9053;&#x4F55;&#x65F6;&#x4E24;&#x4E2A;&#x5939;&#x5177;&#x91CD;&#x53E0;&#xFF0C;&#x4F46;&#x4E0D;&#x5E94;&#x8BE5;&#x6709;&#x78B0;&#x649E;&#x54CD;&#x5E94;&#x3002;&#x8FD9;&#x662F;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x4F20;&#x611F;&#x5668;&#x6765;&#x5B8C;&#x6210;&#x7684;&#x3002;&#x4F20;&#x611F;&#x5668;&#x662F;&#x68C0;&#x6D4B;&#x78B0;&#x649E;&#x4F46;&#x4E0D;&#x4EA7;&#x751F;&#x54CD;&#x5E94;&#x7684;&#x88C5;&#x7F6E;&#x3002;</p>
<p>&#x60A8;&#x53EF;&#x4EE5;&#x5C06;&#x4EFB;&#x4F55;&#x8BBE;&#x5907;&#x6807;&#x8BB0;&#x4E3A;&#x4F20;&#x611F;&#x5668;&#x3002;&#x4F20;&#x611F;&#x5668;&#x53EF;&#x4EE5;&#x662F;&#x9759;&#x6001;&#x7684;&#x3001;&#x52A8;&#x6001;&#x7684;&#x6216;&#x52A8;&#x6001;&#x7684;&#x3002;&#x8BB0;&#x4F4F;&#xFF0C;&#x6BCF;&#x4E2A;&#x8EAB;&#x4F53;&#x53EF;&#x80FD;&#x6709;&#x591A;&#x4E2A;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x6709;&#x4F20;&#x611F;&#x5668;&#x548C;&#x56FA;&#x4F53;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x7684;&#x4EFB;&#x610F;&#x7EC4;&#x5408;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x4F20;&#x611F;&#x5668;&#x53EA;&#x5728;&#x81F3;&#x5C11;&#x4E00;&#x4E2A;&#x7269;&#x4F53;&#x662F;&#x52A8;&#x6001;&#x7684;&#x65F6;&#x624D;&#x5F62;&#x6210;&#x63A5;&#x89E6;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x4E0D;&#x4F1A;&#x5F97;&#x5230;&#x8FD0;&#x52A8;&#x5B66;&#x5BF9;&#x8FD0;&#x52A8;&#x5B66;&#xFF0C;&#x8FD0;&#x52A8;&#x5B66;&#x5BF9;&#x9759;&#x6001;&#xFF0C;&#x9759;&#x6001;&#x5BF9;&#x9759;&#x6001;&#x7684;&#x63A5;&#x89E6;&#x3002;</p>
<p>&#x4F20;&#x611F;&#x5668;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x63A5;&#x89E6;&#x70B9;&#x3002;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x4F20;&#x611F;&#x5668;&#x7684;&#x72B6;&#x6001;&#xFF1A;</p>
<ol>
<li><code>b2Contact::IsTouching</code></li>
<li><code>b2ContactListener::BeginContact</code>&#x548C;<code>&#x8054;&#x7CFB;&#x4EBA;&#x5217;&#x8868;&#xFF1A;&#xFF1A;EndContact</code></li>
</ol>
<h1 id="&#x5173;&#x8282;">&#x5173;&#x8282;</h1>
<p>&#x5173;&#x8282;&#x7528;&#x4E8E;&#x5C06;&#x5B9E;&#x4F53;&#x7EA6;&#x675F;&#x5230;&#x4E16;&#x754C;&#x6216;&#x5F7C;&#x6B64;&#x3002;&#x6E38;&#x620F;&#x4E2D;&#x7684;&#x5178;&#x578B;&#x4F8B;&#x5B50;&#x5305;&#x62EC;&#x788E;&#x5E03;&#x73A9;&#x5076;&#x3001;&#x8DF7;&#x8DF7;&#x677F;&#x548C;&#x6ED1;&#x8F6E;&#x3002;&#x5173;&#x8282;&#x53EF;&#x4EE5;&#x7528;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x4EE5;&#x4EA7;&#x751F;&#x6709;&#x8DA3;&#x7684;&#x8FD0;&#x52A8;&#x3002;</p>
<p>&#x6709;&#x4E9B;&#x5173;&#x8282;&#x63D0;&#x4F9B;&#x9650;&#x5236;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x8FD0;&#x52A8;&#x8303;&#x56F4;&#x3002;&#x6709;&#x4E9B;&#x63A5;&#x5934;&#x63D0;&#x4F9B;&#x7684;&#x7535;&#x673A;&#x53EF;&#x7528;&#x4E8E;&#x4EE5;&#x89C4;&#x5B9A;&#x7684;&#x901F;&#x5EA6;&#x9A71;&#x52A8;&#x63A5;&#x5934;&#xFF0C;&#x76F4;&#x5230;&#x8D85;&#x8FC7;&#x89C4;&#x5B9A;&#x7684;&#x529B;/&#x626D;&#x77E9;&#x3002;</p>
<p>&#x8054;&#x5408;&#x7535;&#x673A;&#x6709;&#x591A;&#x79CD;&#x7528;&#x9014;&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7535;&#x52A8;&#x673A;&#x901A;&#x8FC7;&#x6307;&#x5B9A;&#x4E0E;&#x5B9E;&#x9645;&#x4F4D;&#x7F6E;&#x548C;&#x6240;&#x9700;&#x4F4D;&#x7F6E;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x6210;&#x6BD4;&#x4F8B;&#x7684;&#x5173;&#x8282;&#x901F;&#x5EA6;&#x6765;&#x63A7;&#x5236;&#x4F4D;&#x7F6E;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7535;&#x52A8;&#x673A;&#x6765;&#x6A21;&#x62DF;&#x5173;&#x8282;&#x6469;&#x64E6;&#x529B;&#xFF1A;&#x5C06;&#x5173;&#x8282;&#x901F;&#x5EA6;&#x8BBE;&#x7F6E;&#x4E3A;&#x96F6;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5C0F;&#x7684;&#xFF0C;&#x4F46;&#x6709;&#x610F;&#x4E49;&#x7684;&#x6700;&#x5927;&#x7535;&#x673A;&#x529B;/&#x8F6C;&#x77E9;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x7535;&#x673A;&#x5C06;&#x8BD5;&#x56FE;&#x963B;&#x6B62;&#x63A5;&#x5934;&#x79FB;&#x52A8;&#xFF0C;&#x76F4;&#x5230;&#x8D1F;&#x8F7D;&#x53D8;&#x5F97;&#x592A;&#x5F3A;&#x3002;</p>
<h2 id="&#x5173;&#x8282;&#x5B9A;&#x4E49;">&#x5173;&#x8282;&#x5B9A;&#x4E49;</h2>
<p>&#x6BCF;&#x4E2A;&#x5173;&#x8282;&#x7C7B;&#x578B;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x5B9A;&#x4E49;&#xFF0C;&#x8BE5;&#x5B9A;&#x4E49;&#x6E90;&#x81EA;<a href="https://box2d.org/documentation/structb2_joint_def.html" target="_blank"> b2JointDef&#x516C;&#x53F8;</a>. &#x6240;&#x6709;&#x7684;&#x5173;&#x8282;&#x90FD;&#x8FDE;&#x63A5;&#x5728;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7269;&#x4F53;&#x4E4B;&#x95F4;&#x3002;&#x4E00;&#x4E2A;&#x7269;&#x4F53;&#x53EF;&#x80FD;&#x9759;&#x6B62;&#x4E0D;&#x52A8;&#x3002;&#x5141;&#x8BB8;&#x9759;&#x6001;&#x548C;/&#x6216;&#x8FD0;&#x52A8;&#x5B9E;&#x4F53;&#x4E4B;&#x95F4;&#x7684;&#x8FD0;&#x52A8;&#x7C7B;&#x578B;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;&#x5F71;&#x54CD;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x5904;&#x7406;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x4E3A;&#x4EFB;&#x4F55;&#x5173;&#x8282;&#x7C7B;&#x578B;&#x6307;&#x5B9A;&#x7528;&#x6237;&#x6570;&#x636E;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x6807;&#x5FD7;&#x4EE5;&#x9632;&#x6B62;&#x9644;&#x7740;&#x7684;&#x5B9E;&#x4F53;&#x5F7C;&#x6B64;&#x78B0;&#x649E;&#x3002;&#x8FD9;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x9ED8;&#x8BA4;&#x884C;&#x4E3A;&#xFF0C;&#x5FC5;&#x987B;&#x8BBE;&#x7F6E;collizeconnected&#x5E03;&#x5C14;&#x503C;&#x4EE5;&#x5141;&#x8BB8;&#x5230;&#x8FDE;&#x63A5;&#x7684;&#x5B9E;&#x4F53;&#x4E4B;&#x95F4;&#x53D1;&#x751F;&#x78B0;&#x649E;&#x3002;</p>
<p>&#x8BB8;&#x591A;&#x8FD0;&#x52A8;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x8981;&#x6C42;&#x60A8;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x51E0;&#x4F55;&#x6570;&#x636E;&#x3002;&#x63A5;&#x5934;&#x901A;&#x5E38;&#x7531;&#x951A;&#x70B9;&#x5B9A;&#x4E49;&#x3002;&#x8FD9;&#x4E9B;&#x70B9;&#x56FA;&#x5B9A;&#x5728;&#x9644;&#x7740;&#x7684;&#x5B9E;&#x4F53;&#x4E2D;&#x3002;Box2D&#x8981;&#x6C42;&#x5728;&#x5C40;&#x90E8;&#x5750;&#x6807;&#x4E2D;&#x6307;&#x5B9A;&#x8FD9;&#x4E9B;&#x70B9;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x5373;&#x4F7F;&#x5F53;&#x524D;&#x5B9E;&#x4F53;&#x53D8;&#x6362;&#x8FDD;&#x53CD;&#x4E86;&#x5173;&#x8282;&#x7EA6;&#x675F;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x5173;&#x8282;&#xFF0C;&#x8FD9;&#x662F;&#x4FDD;&#x5B58;&#x548C;&#x91CD;&#x65B0;&#x52A0;&#x8F7D;&#x6E38;&#x620F;&#x65F6;&#x5E38;&#x89C1;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x67D0;&#x4E9B;&#x5173;&#x8282;&#x5B9A;&#x4E49;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5B9E;&#x4F53;&#x4E4B;&#x95F4;&#x7684;&#x9ED8;&#x8BA4;&#x76F8;&#x5BF9;&#x89D2;&#x5EA6;&#x3002;&#x8FD9;&#x662F;&#x6B63;&#x786E;&#x7EA6;&#x675F;&#x65CB;&#x8F6C;&#x6240;&#x5FC5;&#x9700;&#x7684;&#x3002;</p>
<p>&#x521D;&#x59CB;&#x5316;&#x51E0;&#x4F55;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x5F88;&#x7E41;&#x7410;&#xFF0C;&#x56E0;&#x6B64;&#x8BB8;&#x591A;&#x5173;&#x8282;&#x90FD;&#x5177;&#x6709;&#x521D;&#x59CB;&#x5316;&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x4F7F;&#x7528;&#x5F53;&#x524D;&#x7684;&#x5B9E;&#x4F53;&#x53D8;&#x6362;&#x6765;&#x5220;&#x9664;&#x5927;&#x90E8;&#x5206;&#x5DE5;&#x4F5C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x521D;&#x59CB;&#x5316;&#x51FD;&#x6570;&#x901A;&#x5E38;&#x53EA;&#x80FD;&#x7528;&#x4E8E;&#x539F;&#x578B;&#x8BBE;&#x8BA1;&#x3002;&#x4EA7;&#x54C1;&#x4EE3;&#x7801;&#x5E94;&#x8BE5;&#x76F4;&#x63A5;&#x5B9A;&#x4E49;&#x51E0;&#x4F55;&#x56FE;&#x5F62;&#x3002;&#x8FD9;&#x5C06;&#x4F7F;&#x5173;&#x8282;&#x884C;&#x4E3A;&#x66F4;&#x52A0;&#x5065;&#x58EE;&#x3002;</p>
<p>&#x5176;&#x4F59;&#x8FD0;&#x52A8;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x6570;&#x636E;&#x53D6;&#x51B3;&#x4E8E;&#x8FD0;&#x52A8;&#x7C7B;&#x578B;&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x6765;&#x62A5;&#x9053;&#x8FD9;&#x4E9B;&#x3002;</p>
<h2 id="&#x8054;&#x5408;&#x5DE5;&#x5382;">&#x8054;&#x5408;&#x5DE5;&#x5382;</h2>
<p>&#x5173;&#x8282;&#x662F;&#x4F7F;&#x7528;&#x4E16;&#x754C;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x521B;&#x5EFA;&#x548C;&#x9500;&#x6BC1;&#x7684;&#x3002;&#x8FD9;&#x5C31;&#x5F15;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x8001;&#x95EE;&#x9898;&#xFF1A;</p>
<blockquote>
<p><strong>&#x6CE8;&#x610F;&#x5B89;&#x5168;</strong>&#xFF1A;&#x4E0D;&#x8981;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528;new&#x6216;malloc&#x5728;&#x5806;&#x6808;&#x6216;&#x5806;&#x4E0A;&#x521B;&#x5EFA;&#x5173;&#x8282;&#x3002;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x7684;&#x521B;&#x5EFA;&#x548C;&#x9500;&#x6BC1;&#x65B9;&#x6CD5;&#x521B;&#x5EFA;&#x548C;&#x9500;&#x6BC1;&#x5B9E;&#x4F53;&#x548C;&#x5173;&#x8282;<a href="https://box2d.org/documentation/classb2_world.html" target="_blank">b2World&#x516C;&#x53F8;</a>&#x73ED;&#x7EA7;</p>
</blockquote>
<p>&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x65CB;&#x8F6C;&#x5173;&#x8282;&#x7684;&#x5BFF;&#x547D;&#x793A;&#x4F8B;&#xFF1A;</p>
<pre><code class="lang-c++">b2World* myWorld;
b2RevoluteJointDef jointDef;
jointDef.bodyA = myBodyA;
jointDef.bodyB = myBodyB;
jointDef.anchorPoint = myBodyA-&gt;GetCenterPosition();

b2RevoluteJoint* joint = (b2RevoluteJoint*)myWorld-&gt;CreateJoint(&amp;jointDef);

<span class="hljs-comment">// ... do stuff ...</span>

myWorld-&gt;DestroyJoint(joint);
joint = <span class="hljs-literal">nullptr</span>;
</code></pre>
<p>&#x5F53;&#x4F60;&#x7684;&#x6307;&#x9488;&#x88AB;&#x9500;&#x6BC1;&#x540E;&#xFF0C;&#x6700;&#x597D;&#x5C06;&#x5176;&#x4F5C;&#x5E9F;&#x3002;&#x5982;&#x679C;&#x8BD5;&#x56FE;&#x91CD;&#x7528;&#x6307;&#x9488;&#xFF0C;&#x8FD9;&#x5C06;&#x4F7F;&#x7A0B;&#x5E8F;&#x4EE5;&#x53EF;&#x63A7;&#x65B9;&#x5F0F;&#x5D29;&#x6E83;&#x3002;</p>
<p>&#x5173;&#x8282;&#x7684;&#x5BFF;&#x547D;&#x5E76;&#x4E0D;&#x7B80;&#x5355;&#x3002;&#x6CE8;&#x610F;&#x8FD9;&#x4E2A;&#x8B66;&#x544A;&#xFF1A;</p>
<blockquote>
<p><strong>&#x6CE8;&#x610F;&#x5B89;&#x5168;</strong>&#xFF1A;&#x8FDE;&#x63A5;&#x7684;&#x5B9E;&#x4F53;&#x88AB;&#x7834;&#x574F;&#x65F6;&#xFF0C;&#x5173;&#x8282;&#x88AB;&#x7834;&#x574F;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x79CD;&#x9884;&#x9632;&#x63AA;&#x65BD;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x5FC5;&#x8981;&#x7684;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x7EC4;&#x7EC7;&#x4F60;&#x7684;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#xFF0C;&#x8FD9;&#x6837;&#x5173;&#x8282;&#x603B;&#x662F;&#x5728;&#x8FDE;&#x63A5;&#x7684;&#x8EAB;&#x4F53;&#x4E4B;&#x524D;&#x88AB;&#x7834;&#x574F;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x60A8;&#x4E0D;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x4FA6;&#x542C;&#x5668;&#x7C7B;&#x3002;&#x6709;&#x5173;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x89C1;&#x9690;&#x5F0F;&#x9500;&#x6BC1;&#x90E8;&#x5206;&#x3002;</p>
<h2 id="&#x4F7F;&#x7528;&#x5173;&#x8282;">&#x4F7F;&#x7528;&#x5173;&#x8282;</h2>
<p>&#x8BB8;&#x591A;&#x6A21;&#x62DF;&#x4F1A;&#x521B;&#x5EFA;&#x5173;&#x8282;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x5173;&#x8282;&#x88AB;&#x7834;&#x574F;&#x4E4B;&#x524D;&#x4E0D;&#x4F1A;&#x518D;&#x6B21;&#x8BBF;&#x95EE;&#x5B83;&#x4EEC;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD0;&#x52A8;&#x7C7B;&#x578B;&#x4E2D;&#x5305;&#x542B;&#x8BB8;&#x591A;&#x6709;&#x7528;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x521B;&#x5EFA;&#x4E30;&#x5BCC;&#x7684;&#x6A21;&#x62DF;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE;&#x5173;&#x8282;&#x83B7;&#x53D6;&#x5B9E;&#x4F53;&#x3001;&#x951A;&#x70B9;&#x548C;&#x7528;&#x6237;&#x6570;&#x636E;&#x3002;</p>
<pre><code class="lang-c++">b2Body* b2Joint::GetBodyA();
b2Body* b2Joint::GetBodyB();
b2Vec2 b2Joint::GetAnchorA();
b2Vec2 b2Joint::GetAnchorB();
<span class="hljs-keyword">void</span>* b2Joint::GetUserData();
</code></pre>
<p>&#x6240;&#x6709;&#x63A5;&#x5934;&#x90FD;&#x6709;&#x53CD;&#x4F5C;&#x7528;&#x529B;&#x548C;&#x626D;&#x77E9;&#x3002;&#x8FD9;&#x662F;&#x5728;&#x951A;&#x5B9A;&#x70B9;&#x5904;&#x4F5C;&#x7528;&#x4E8E;&#x4E3B;&#x4F53;2&#x7684;&#x53CD;&#x4F5C;&#x7528;&#x529B;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x53CD;&#x4F5C;&#x7528;&#x529B;&#x6765;&#x65AD;&#x5F00;&#x5173;&#x8282;&#x6216;&#x89E6;&#x53D1;&#x5176;&#x4ED6;&#x6E38;&#x620F;&#x4E8B;&#x4EF6;&#x3002;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x53EF;&#x80FD;&#x4F1A;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x8BA1;&#x7B97;&#xFF0C;&#x56E0;&#x6B64;&#x5982;&#x679C;&#x4E0D;&#x9700;&#x8981;&#x7ED3;&#x679C;&#xFF0C;&#x8BF7;&#x4E0D;&#x8981;&#x8C03;&#x7528;&#x5B83;&#x4EEC;&#x3002;</p>
<pre><code class="lang-c++">b2Vec2 b2Joint::GetReactionForce();
<span class="hljs-keyword">float</span> b2Joint::GetReactionTorque();
</code></pre>
<h2 id="&#x5B9A;&#x8DDD;&#x63A5;&#x5934;">&#x5B9A;&#x8DDD;&#x63A5;&#x5934;</h2>
<p>&#x6700;&#x7B80;&#x5355;&#x7684;&#x5173;&#x8282;&#x4E4B;&#x4E00;&#x662F;&#x8DDD;&#x79BB;&#x5173;&#x8282;&#xFF0C;&#x5B83;&#x8BF4;&#x4E24;&#x4E2A;&#x7269;&#x4F53;&#x4E0A;&#x4E24;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x5FC5;&#x987B;&#x662F;&#x6052;&#x5B9A;&#x7684;&#x3002;&#x6307;&#x5B9A;&#x8DDD;&#x79BB;&#x8FD0;&#x52A8;&#x7C7B;&#x578B;&#x65F6;&#xFF0C;&#x4E24;&#x4E2A;&#x5B9E;&#x4F53;&#x5E94;&#x8BE5;&#x5DF2;&#x7ECF;&#x5C31;&#x4F4D;&#x3002;&#x7136;&#x540E;&#x5728;&#x4E16;&#x754C;&#x5750;&#x6807;&#x7CFB;&#x4E2D;&#x6307;&#x5B9A;&#x4E24;&#x4E2A;&#x5B9A;&#x4F4D;&#x70B9;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x951A;&#x5B9A;&#x70B9;&#x8FDE;&#x63A5;&#x5230;&#x5B9E;&#x4F53;1&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x951A;&#x5B9A;&#x70B9;&#x8FDE;&#x63A5;&#x5230;&#x5B9E;&#x4F53;2&#x3002;&#x8FD9;&#x4E9B;&#x70B9;&#x8868;&#x793A;&#x8DDD;&#x79BB;&#x7EA6;&#x675F;&#x7684;&#x957F;&#x5EA6;&#x3002;</p>
<p><img src="images/anchor-length.png" alt="anchor-length"></p>
<p>&#x4EE5;&#x4E0B;&#x662F;&#x8DDD;&#x79BB;&#x8FD0;&#x52A8;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x7684;&#x793A;&#x4F8B;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x51B3;&#x5B9A;&#x8BA9;&#x7269;&#x4F53;&#x78B0;&#x649E;&#x3002;</p>
<pre><code class="lang-c++">b2DistanceJointDef jointDef;
jointDef.Initialize(myBodyA, myBodyB, worldAnchorOnBodyA,
worldAnchorOnBodyB);
jointDef.collideConnected = <span class="hljs-literal">true</span>;
</code></pre>
<p>&#x8DDD;&#x79BB;&#x63A5;&#x5934;&#x4E5F;&#x53EF;&#x4EE5;&#x5236;&#x6210;&#x8F6F;&#x63A5;&#x5934;&#xFF0C;&#x5982;&#x5F39;&#x7C27;-&#x963B;&#x5C3C;&#x5668;&#x8FDE;&#x63A5;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x6D4B;&#x8BD5;&#x5E8A;&#x4E2D;&#x7684;Web&#x793A;&#x4F8B;&#x4EE5;&#x4E86;&#x89E3;&#x5176;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x67D4;&#x8F6F;&#x5EA6;&#x662F;&#x901A;&#x8FC7;&#x8C03;&#x6574;&#x5B9A;&#x4E49;&#x4E2D;&#x7684;&#x4E24;&#x4E2A;&#x5E38;&#x6570;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#xFF1A;&#x521A;&#x5EA6;&#x548C;&#x963B;&#x5C3C;&#x3002;&#x76F4;&#x63A5;&#x8BBE;&#x7F6E;&#x8FD9;&#x4E9B;&#x503C;&#x662F;&#x4E0D;&#x76F4;&#x89C2;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x90FD;&#x662F;&#x4EE5;&#x725B;&#x987F;&#x4E3A;&#x5355;&#x4F4D;&#x7684;&#x3002;Box2D&#x63D0;&#x4F9B;&#x548C;API&#x6765;&#x8BA1;&#x7B97;&#x9891;&#x7387;&#x548C;&#x963B;&#x5C3C;&#x6BD4;&#x7684;&#x8FD9;&#x4E9B;&#x503C;&#x3002;</p>
<pre><code class="lang-c++"><span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">b2LinearStiffness</span><span class="hljs-params">(<span class="hljs-keyword">float</span>&amp; stiffness, <span class="hljs-keyword">float</span>&amp; damping,
    <span class="hljs-keyword">float</span> frequencyHertz, <span class="hljs-keyword">float</span> dampingRatio,
    <span class="hljs-keyword">const</span> b2Body* bodyA, <span class="hljs-keyword">const</span> b2Body* bodyB)</span></span>;
</code></pre>
<p>&#x628A;&#x9891;&#x7387;&#x60F3;&#x8C61;&#x6210;&#x8C10;&#x632F;&#x5B50;&#x7684;&#x9891;&#x7387;&#xFF08;&#x6BD4;&#x5982;&#x5409;&#x4ED6;&#x5F26;&#xFF09;&#x3002;&#x9891;&#x7387;&#x4EE5;&#x8D6B;&#x5179;&#x4E3A;&#x5355;&#x4F4D;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x9891;&#x7387;&#x5E94;&#x5C0F;&#x4E8E;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x9891;&#x7387;&#x7684;&#x4E00;&#x534A;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x7684;&#x662F;60Hz&#x7684;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#xFF0C;&#x5219;&#x8DDD;&#x79BB;&#x5173;&#x8282;&#x7684;&#x9891;&#x7387;&#x5E94;&#x5C0F;&#x4E8E;30Hz&#x3002;&#x539F;&#x56E0;&#x4E0E;&#x5948;&#x594E;&#x65AF;&#x7279;&#x9891;&#x7387;&#x6709;&#x5173;&#x3002;</p>
<p>&#x963B;&#x5C3C;&#x6BD4;&#x662F;&#x65E0;&#x91CF;&#x7EB2;&#x7684;&#xFF0C;&#x901A;&#x5E38;&#x4ECB;&#x4E8E;0&#x548C;1&#x4E4B;&#x95F4;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x66F4;&#x5927;&#x3002;&#x5728;1&#x65F6;&#xFF0C;&#x963B;&#x5C3C;&#x662F;&#x4E34;&#x754C;&#x7684;&#xFF08;&#x6240;&#x6709;&#x632F;&#x8361;&#x5E94;&#x6D88;&#x5931;&#xFF09;&#x3002;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">float</span> frequencyHz = <span class="hljs-number">4.0f</span>;
<span class="hljs-keyword">float</span> dampingRatio = <span class="hljs-number">0.5f</span>;
b2LinearStiffness(jointDef.stiffness, jointDef.damping, frequencyHz, dampingRatio, jointDef.bodyA, jointDef.bodyB);
</code></pre>
<p>&#x4E5F;&#x53EF;&#x4EE5;&#x4E3A;&#x5B9A;&#x8DDD;&#x63A5;&#x5934;&#x5B9A;&#x4E49;&#x6700;&#x5C0F;&#x548C;&#x6700;&#x5927;&#x957F;&#x5EA6;&#x3002;&#x770B;&#x5230;&#x4E86;&#x5417;<code>b2DistanceJointDef</code>&#x4E86;&#x89E3;&#x8BE6;&#x60C5;</p>
<h2 id="&#x65CB;&#x8F6C;&#x94F0;">&#x65CB;&#x8F6C;&#x94F0;</h2>
<p>&#x65CB;&#x8F6C;&#x5173;&#x8282;&#x8FEB;&#x4F7F;&#x4E24;&#x4E2A;&#x7269;&#x4F53;&#x5171;&#x7528;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x70B9;&#xFF0C;&#x901A;&#x5E38;&#x79F0;&#x4E3A;&#x94F0;&#x94FE;&#x70B9;&#x3002;&#x65CB;&#x8F6C;&#x5173;&#x8282;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x81EA;&#x7531;&#x5EA6;&#xFF1A;&#x4E24;&#x4E2A;&#x7269;&#x4F53;&#x7684;&#x76F8;&#x5BF9;&#x65CB;&#x8F6C;&#x3002;&#x8FD9;&#x79F0;&#x4E3A;&#x5173;&#x8282;&#x89D2;&#x3002;</p>
<p><img src="images/anchor-angle.png" alt="anchor-angle"></p>
<p>&#x8981;&#x6307;&#x5B9A;&#x65CB;&#x8F6C;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x4E16;&#x754C;&#x7A7A;&#x95F4;&#x4E2D;&#x63D0;&#x4F9B;&#x4E24;&#x4E2A;&#x5B9E;&#x4F53;&#x548C;&#x4E00;&#x4E2A;&#x5B9A;&#x4F4D;&#x70B9;&#x3002;&#x521D;&#x59CB;&#x5316;&#x51FD;&#x6570;&#x5047;&#x5B9A;&#x5B9E;&#x4F53;&#x5DF2;&#x5904;&#x4E8E;&#x6B63;&#x786E;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x4E24;&#x4E2A;&#x7269;&#x4F53;&#x901A;&#x8FC7;&#x7B2C;&#x4E00;&#x4E2A;&#x7269;&#x4F53;&#x8D28;&#x5FC3;&#x5904;&#x7684;&#x65CB;&#x8F6C;&#x5173;&#x8282;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x3002;</p>
<pre><code class="lang-c++">b2RevoluteJointDef jointDef;
jointDef.Initialize(myBodyA, myBodyB, myBodyA-&gt;GetWorldCenter());
</code></pre>
<p>&#x5F53;&#x8F66;&#x8EAB;B&#x56F4;&#x7ED5;&#x89D2;&#x5EA6;&#x70B9;&#x9006;&#x65F6;&#x9488;&#x65CB;&#x8F6C;&#x65F6;&#xFF0C;&#x65CB;&#x8F6C;&#x5173;&#x8282;&#x89D2;&#x5EA6;&#x4E3A;&#x6B63;&#x3002;&#x4E0E;Box2D&#x4E2D;&#x7684;&#x6240;&#x6709;&#x89D2;&#x5EA6;&#x4E00;&#x6837;&#xFF0C;&#x65CB;&#x8F6C;&#x89D2;&#x5EA6;&#x4EE5;&#x5F27;&#x5EA6;&#x5EA6;&#x91CF;&#x3002;&#x6839;&#x636E;&#x60EF;&#x4F8B;&#xFF0C;&#x4F7F;&#x7528;Initialize&#xFF08;&#xFF09;&#x521B;&#x5EFA;&#x5173;&#x8282;&#x65F6;&#xFF0C;&#x65CB;&#x8F6C;&#x5173;&#x8282;&#x89D2;&#x5EA6;&#x4E3A;&#x96F6;&#xFF0C;&#x800C;&#x4E0D;&#x7BA1;&#x4E24;&#x4E2A;&#x5B9E;&#x4F53;&#x5F53;&#x524D;&#x7684;&#x65CB;&#x8F6C;&#x65B9;&#x5411;&#x5982;&#x4F55;&#x3002;</p>
<p>&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x63A7;&#x5236;&#x5173;&#x8282;&#x89D2;&#x5EA6;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x65CB;&#x8F6C;&#x5173;&#x8282;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x6027;&#x5730;&#x6A21;&#x62DF;&#x5173;&#x8282;&#x9650;&#x5236;&#x548C;/&#x6216;&#x9A6C;&#x8FBE;&#x3002;</p>
<p>&#x5173;&#x8282;&#x9650;&#x5236;&#x5F3A;&#x5236;&#x5173;&#x8282;&#x89D2;&#x5EA6;&#x4FDD;&#x6301;&#x5728;&#x4E0B;&#x9650;&#x548C;&#x4E0A;&#x9650;&#x4E4B;&#x95F4;&#x3002;&#x8BE5;&#x9650;&#x5236;&#x5C06;&#x65BD;&#x52A0;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x626D;&#x77E9;&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x9650;&#x5236;&#x8303;&#x56F4;&#x5E94;&#x5305;&#x62EC;&#x96F6;&#xFF0C;&#x5426;&#x5219;&#x5728;&#x6A21;&#x62DF;&#x5F00;&#x59CB;&#x65F6;&#x5173;&#x8282;&#x5C06;&#x503E;&#x659C;&#x3002;</p>
<p>&#x5173;&#x8282;&#x9A6C;&#x8FBE;&#x5141;&#x8BB8;&#x60A8;&#x6307;&#x5B9A;&#x5173;&#x8282;&#x901F;&#x5EA6;&#xFF08;&#x89D2;&#x5EA6;&#x7684;&#x65F6;&#x95F4;&#x5BFC;&#x6570;&#xFF09;&#x3002;&#x901F;&#x5EA6;&#x53EF;&#x4EE5;&#x662F;&#x8D1F;&#x7684;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x6B63;&#x7684;&#x3002;&#x7535;&#x52A8;&#x673A;&#x53EF;&#x4EE5;&#x6709;&#x65E0;&#x7A77;&#x5927;&#x7684;&#x529B;&#xFF0C;&#x4F46;&#x8FD9;&#x901A;&#x5E38;&#x662F;&#x4E0D;&#x53EF;&#x53D6;&#x7684;&#x3002;&#x56DE;&#x60F3;&#x4E00;&#x4E2A;&#x6C38;&#x6052;&#x7684;&#x95EE;&#x9898;&#xFF1A;</p>
<blockquote>
<p><em>&#x5F53;&#x4E0D;&#x53EF;&#x6297;&#x62D2;&#x7684;&#x529B;&#x91CF;&#x9047;&#x5230;&#x4E0D;&#x53EF;&#x79FB;&#x52A8;&#x7684;&#x7269;&#x4F53;&#x65F6;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#xFF1F;</em></p>
</blockquote>
<p>&#x6211;&#x53EF;&#x4EE5;&#x544A;&#x8BC9;&#x4F60;&#x8FD9;&#x4E0D;&#x6F02;&#x4EAE;&#x3002;&#x6240;&#x4EE5;&#x4F60;&#x53EF;&#x4EE5;&#x4E3A;&#x5173;&#x8282;&#x9A6C;&#x8FBE;&#x63D0;&#x4F9B;&#x6700;&#x5927;&#x626D;&#x77E9;&#x3002;&#x9664;&#x975E;&#x6240;&#x9700;&#x626D;&#x77E9;&#x8D85;&#x8FC7;&#x89C4;&#x5B9A;&#x7684;&#x6700;&#x5927;&#x503C;&#xFF0C;&#x5426;&#x5219;&#x4E07;&#x5411;&#x8282;&#x7535;&#x673A;&#x5C06;&#x4FDD;&#x6301;&#x89C4;&#x5B9A;&#x7684;&#x901F;&#x5EA6;&#x3002;&#x5F53;&#x8D85;&#x8FC7;&#x6700;&#x5927;&#x626D;&#x77E9;&#x65F6;&#xFF0C;&#x63A5;&#x5934;&#x5C06;&#x51CF;&#x901F;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x53CD;&#x8F6C;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5173;&#x8282;&#x9A6C;&#x8FBE;&#x6765;&#x6A21;&#x62DF;&#x5173;&#x8282;&#x6469;&#x64E6;&#x529B;&#x3002;&#x53EA;&#x9700;&#x5C06;&#x5173;&#x8282;&#x901F;&#x5EA6;&#x8BBE;&#x7F6E;&#x4E3A;&#x96F6;&#xFF0C;&#x5E76;&#x5C06;&#x6700;&#x5927;&#x626D;&#x77E9;&#x8BBE;&#x7F6E;&#x4E3A;&#x67D0;&#x4E2A;&#x8F83;&#x5C0F;&#x4F46;&#x6709;&#x610F;&#x4E49;&#x7684;&#x503C;&#x3002;&#x7535;&#x673A;&#x5C06;&#x8BD5;&#x56FE;&#x9632;&#x6B62;&#x63A5;&#x5934;&#x65CB;&#x8F6C;&#xFF0C;&#x4F46;&#x4F1A;&#x5C48;&#x670D;&#x4E8E;&#x8F83;&#x5927;&#x7684;&#x8D1F;&#x8F7D;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x662F;&#x5BF9;&#x4E0A;&#x8FF0;&#x65CB;&#x8F6C;&#x5173;&#x8282;&#x5B9A;&#x4E49;&#x7684;&#x4FEE;&#x6B63;&#xFF1B;&#x8FD9;&#x4E00;&#x6B21;&#x5173;&#x8282;&#x6709;&#x4E00;&#x4E2A;&#x9650;&#x5236;&#x548C;&#x4E00;&#x4E2A;&#x9A6C;&#x8FBE;&#x542F;&#x7528;&#x3002;&#x7535;&#x673A;&#x8BBE;&#x7F6E;&#x4E3A;&#x6A21;&#x62DF;&#x5173;&#x8282;&#x6469;&#x64E6;&#x3002;</p>
<pre><code class="lang-c++">b2RevoluteJointDef jointDef;
jointDef.Initialize(bodyA, bodyB, myBodyA-&gt;GetWorldCenter());
jointDef.lowerAngle = <span class="hljs-number">-0.5</span>f * b2_pi; <span class="hljs-comment">// -90 degrees</span>
jointDef.upperAngle = <span class="hljs-number">0.25f</span> * b2_pi; <span class="hljs-comment">// 45 degrees</span>
jointDef.enableLimit = <span class="hljs-literal">true</span>;
jointDef.maxMotorTorque = <span class="hljs-number">10.0f</span>;
jointDef.motorSpeed = <span class="hljs-number">0.0f</span>;
jointDef.enableMotor = <span class="hljs-literal">true</span>;
</code></pre>
<p>&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x65CB;&#x8F6C;&#x5173;&#x8282;&#x7684;&#x89D2;&#x5EA6;&#x3001;&#x901F;&#x5EA6;&#x548C;&#x7535;&#x673A;&#x8F6C;&#x77E9;&#x3002;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">float</span> b2RevoluteJoint::GetJointAngle() <span class="hljs-keyword">const</span>;
<span class="hljs-keyword">float</span> b2RevoluteJoint::GetJointSpeed() <span class="hljs-keyword">const</span>;
<span class="hljs-keyword">float</span> b2RevoluteJoint::GetMotorTorque() <span class="hljs-keyword">const</span>;
</code></pre>
<p>&#x8FD8;&#x53EF;&#x4EE5;&#x66F4;&#x65B0;&#x6BCF;&#x4E2A;&#x6B65;&#x9AA4;&#x7684;&#x7535;&#x673A;&#x53C2;&#x6570;&#x3002;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">void</span> b2RevoluteJoint::SetMotorSpeed(<span class="hljs-keyword">float</span> speed);
<span class="hljs-keyword">void</span> b2RevoluteJoint::SetMaxMotorTorque(<span class="hljs-keyword">float</span> torque);
</code></pre>
<p>&#x8054;&#x5408;&#x53D1;&#x52A8;&#x673A;&#x6709;&#x4E00;&#x4E9B;&#x6709;&#x8DA3;&#x7684;&#x80FD;&#x529B;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x5728;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x66F4;&#x65B0;&#x5173;&#x8282;&#x901F;&#x5EA6;&#xFF0C;&#x4EE5;&#x4FBF;&#x53EF;&#x4EE5;&#x4F7F;&#x5173;&#x8282;&#x50CF;&#x6B63;&#x5F26;&#x6CE2;&#x4E00;&#x6837;&#x6765;&#x56DE;&#x79FB;&#x52A8;&#xFF0C;&#x6216;&#x8005;&#x6839;&#x636E;&#x60A8;&#x60F3;&#x8981;&#x7684;&#x4EFB;&#x4F55;&#x51FD;&#x6570;&#x3002;</p>
<pre><code class="lang-c++"><span class="hljs-comment">// ... Game Loop Begin ...</span>

myJoint-&gt;SetMotorSpeed(cosf(<span class="hljs-number">0.5f</span> * time));

<span class="hljs-comment">// ... Game Loop End ...</span>
</code></pre>
<p>&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5173;&#x8282;&#x9A6C;&#x8FBE;&#x6765;&#x8DDF;&#x8E2A;&#x6240;&#x9700;&#x7684;&#x5173;&#x8282;&#x89D2;&#x5EA6;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code class="lang-c++"><span class="hljs-comment">// ... Game Loop Begin ...</span>

<span class="hljs-keyword">float</span> angleError = myJoint-&gt;GetJointAngle() - angleTarget;
<span class="hljs-keyword">float</span> gain = <span class="hljs-number">0.1f</span>;
myJoint-&gt;SetMotorSpeed(-gain * angleError);

<span class="hljs-comment">// ... Game Loop End ...</span>
</code></pre>
<p>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x589E;&#x76CA;&#x53C2;&#x6570;&#x4E0D;&#x5E94;&#x8BE5;&#x592A;&#x5927;&#x3002;&#x5426;&#x5219;&#x4F60;&#x7684;&#x5173;&#x8282;&#x53EF;&#x80FD;&#x4F1A;&#x53D8;&#x5F97;&#x4E0D;&#x7A33;&#x5B9A;&#x3002;</p>
<h2 id="&#x68F1;&#x67F1;&#x72B6;&#x8282;&#x7406;">&#x68F1;&#x67F1;&#x72B6;&#x8282;&#x7406;</h2>
<p>&#x68F1;&#x67F1;&#x5173;&#x8282;&#x5141;&#x8BB8;&#x4E24;&#x4E2A;&#x7269;&#x4F53;&#x6CBF;&#x6307;&#x5B9A;&#x7684;&#x8F74;&#x76F8;&#x5BF9;&#x5E73;&#x79FB;&#x3002;&#x68F1;&#x67F1;&#x5F62;&#x5173;&#x8282;&#x53EF;&#x9632;&#x6B62;&#x76F8;&#x5BF9;&#x65CB;&#x8F6C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x68F1;&#x67F1;&#x8FD0;&#x52A8;&#x7C7B;&#x578B;&#x5177;&#x6709;&#x5355;&#x81EA;&#x7531;&#x5EA6;&#x3002;</p>
<p><img src="images/anchor-translation.png" alt="anchor-translation"></p>
<p>&#x68F1;&#x67F1;&#x5173;&#x8282;&#x7684;&#x5B9A;&#x4E49;&#x4E0E;&#x65CB;&#x8F6C;&#x5173;&#x8282;&#x7684;&#x63CF;&#x8FF0;&#x76F8;&#x4F3C;&#xFF1B;&#x7528;&#x5E73;&#x52A8;&#x4EE3;&#x66FF;&#x89D2;&#x5EA6;&#xFF0C;&#x7528;&#x529B;&#x4EE3;&#x66FF;&#x529B;&#x77E9;&#x3002;&#x4F7F;&#x7528;&#x6B64;&#x7C7B;&#x6BD4;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x5E26;&#x6709;&#x8FDE;&#x63A5;&#x9650;&#x5236;&#x548C;&#x6469;&#x64E6;&#x7535;&#x673A;&#x7684;&#x68F1;&#x67F1;&#x5F62;&#x8FDE;&#x63A5;&#x5B9A;&#x4E49;&#x793A;&#x4F8B;&#xFF1A;</p>
<pre><code class="lang-c++">b2PrismaticJointDef jointDef;
<span class="hljs-function">b2Vec2 <span class="hljs-title">worldAxis</span><span class="hljs-params">(<span class="hljs-number">1.0f</span>, <span class="hljs-number">0.0f</span>)</span></span>;
jointDef.Initialize(myBodyA, myBodyB, myBodyA-&gt;GetWorldCenter(), worldAxis);
jointDef.lowerTranslation = <span class="hljs-number">-5.0</span>f;
jointDef.upperTranslation = <span class="hljs-number">2.5f</span>;
jointDef.enableLimit = <span class="hljs-literal">true</span>;
jointDef.maxMotorForce = <span class="hljs-number">1.0f</span>;
jointDef.motorSpeed = <span class="hljs-number">0.0f</span>;
jointDef.enableMotor = <span class="hljs-literal">true</span>;
</code></pre>
<p>&#x65CB;&#x8F6C;&#x5173;&#x8282;&#x6709;&#x4E00;&#x4E2A;&#x9690;&#x5F0F;&#x8F74;&#x4ECE;&#x5C4F;&#x5E55;&#x51FA;&#x6765;&#x3002;&#x68F1;&#x67F1;&#x5173;&#x8282;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x4E0E;&#x5C4F;&#x5E55;&#x5E73;&#x884C;&#x7684;&#x663E;&#x5F0F;&#x8F74;&#x3002;&#x8FD9;&#x4E2A;&#x8F74;&#x56FA;&#x5B9A;&#x5728;&#x4E24;&#x4E2A;&#x7269;&#x4F53;&#x4E0A;&#xFF0C;&#x5E76;&#x8DDF;&#x968F;&#x5B83;&#x4EEC;&#x7684;&#x8FD0;&#x52A8;&#x3002;</p>
<p>&#x4E0E;&#x65CB;&#x8F6C;&#x5173;&#x8282;&#x4E00;&#x6837;&#xFF0C;&#x4F7F;&#x7528;Initialize&#xFF08;&#xFF09;&#x521B;&#x5EFA;&#x5173;&#x8282;&#x65F6;&#xFF0C;&#x68F1;&#x67F1;&#x5173;&#x8282;&#x5E73;&#x79FB;&#x4E3A;&#x96F6;&#x3002;&#x6240;&#x4EE5;&#x8981;&#x786E;&#x4FDD;&#x96F6;&#x5728;&#x4F60;&#x7684;&#x7FFB;&#x8BD1;&#x4E0A;&#x9650;&#x548C;&#x4E0B;&#x9650;&#x4E4B;&#x95F4;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x68F1;&#x67F1;&#x8FD0;&#x52A8;&#x7C7B;&#x578B;&#x4E0E;&#x4F7F;&#x7528;&#x65CB;&#x8F6C;&#x8FD0;&#x52A8;&#x7C7B;&#x578B;&#x7C7B;&#x4F3C;&#x3002;&#x4EE5;&#x4E0B;&#x662F;&#x76F8;&#x5173;&#x7684;&#x6210;&#x5458;&#x804C;&#x80FD;&#xFF1A;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">float</span> PrismaticJoint::GetJointTranslation() <span class="hljs-keyword">const</span>;
<span class="hljs-keyword">float</span> PrismaticJoint::GetJointSpeed() <span class="hljs-keyword">const</span>;
<span class="hljs-keyword">float</span> PrismaticJoint::GetMotorForce() <span class="hljs-keyword">const</span>;
<span class="hljs-keyword">void</span> PrismaticJoint::SetMotorSpeed(<span class="hljs-keyword">float</span> speed);
<span class="hljs-keyword">void</span> PrismaticJoint::SetMotorForce(<span class="hljs-keyword">float</span> force);
</code></pre>
<h2 id="&#x6ED1;&#x8F6E;&#x63A5;&#x5934;">&#x6ED1;&#x8F6E;&#x63A5;&#x5934;</h2>
<p>&#x6ED1;&#x8F6E;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x7406;&#x60F3;&#x5316;&#x7684;&#x6ED1;&#x8F6E;&#x3002;&#x6ED1;&#x8F6E;&#x628A;&#x4E24;&#x4E2A;&#x7269;&#x4F53;&#x8FDE;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x4E00;&#x4E2A;&#x8EAB;&#x4F53;&#x5411;&#x4E0A;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x8EAB;&#x4F53;&#x5411;&#x4E0B;&#x3002;&#x6ED1;&#x8F6E;&#x7EF3;&#x7684;&#x603B;&#x957F;&#x5EA6;&#x6839;&#x636E;&#x521D;&#x59CB;&#x914D;&#x7F6E;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x3002;</p>
<pre><code class="lang-c++">length1 + length2 == constant
</code></pre>
<p>&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x6A21;&#x62DF;&#x5757;&#x548C;&#x6ED1;&#x8F66;&#x7684;&#x6BD4;&#x7387;&#x3002;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x76AE;&#x5E26;&#x8F6E;&#x7684;&#x4E00;&#x4FA7;&#x6BD4;&#x53E6;&#x4E00;&#x4FA7;&#x5EF6;&#x4F38;&#x5F97;&#x66F4;&#x5FEB;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x4E00;&#x4FA7;&#x7684;&#x7EA6;&#x675F;&#x529B;&#x6BD4;&#x53E6;&#x4E00;&#x4FA7;&#x5C0F;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x5B83;&#x6765;&#x521B;&#x5EFA;&#x673A;&#x68B0;&#x6760;&#x6746;&#x3002;</p>
<pre><code class="lang-c++">length1 + ratio * length2 == constant
</code></pre>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x6BD4;&#x7387;&#x4E3A;2&#xFF0C;&#x5219;length1&#x5C06;&#x4EE5;length2&#x901F;&#x7387;&#x7684;&#x4E24;&#x500D;&#x53D8;&#x5316;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x8FDE;&#x63A5;&#x5230;&#x8F66;&#x8EAB;1&#x7684;&#x7EF3;&#x7D22;&#x4E2D;&#x7684;&#x529B;&#x5C06;&#x662F;&#x8FDE;&#x63A5;&#x5230;&#x8F66;&#x8EAB;2&#x7684;&#x7EF3;&#x7D22;&#x7684;&#x4E00;&#x534A;&#x7684;&#x7EA6;&#x675F;&#x529B;&#x3002;</p>
<p><img src="images/anchor-ground.png" alt="anchor-ground"></p>
<p>&#x5F53;&#x4E00;&#x4FA7;&#x5B8C;&#x5168;&#x4F38;&#x51FA;&#x65F6;&#xFF0C;&#x76AE;&#x5E26;&#x8F6E;&#x53EF;&#x80FD;&#x4F1A;&#x5F88;&#x9EBB;&#x70E6;&#x3002;&#x53E6;&#x4E00;&#x8FB9;&#x7684;&#x7EF3;&#x5B50;&#x957F;&#x5EA6;&#x4E3A;&#x96F6;&#x3002;&#x6B64;&#x65F6;&#x7EA6;&#x675F;&#x65B9;&#x7A0B;&#x53D8;&#x4E3A;&#x5947;&#x5F02;&#xFF08;bad&#xFF09;&#x3002;&#x60A8;&#x5E94;&#x8BE5;&#x914D;&#x7F6E;&#x51B2;&#x7A81;&#x5F62;&#x72B6;&#x4EE5;&#x9632;&#x6B62;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x53D1;&#x751F;&#x3002;</p>
<p>&#x4EE5;&#x4E0B;&#x662F;&#x76AE;&#x5E26;&#x8F6E;&#x5B9A;&#x4E49;&#x793A;&#x4F8B;&#xFF1A;</p>
<pre><code class="lang-c++">b2Vec2 anchor1 = myBody1-&gt;GetWorldCenter();
b2Vec2 anchor2 = myBody2-&gt;GetWorldCenter();

<span class="hljs-function">b2Vec2 <span class="hljs-title">groundAnchor1</span><span class="hljs-params">(p1.x, p1.y + <span class="hljs-number">10.0f</span>)</span></span>;
<span class="hljs-function">b2Vec2 <span class="hljs-title">groundAnchor2</span><span class="hljs-params">(p2.x, p2.y + <span class="hljs-number">12.0f</span>)</span></span>;

<span class="hljs-keyword">float</span> ratio = <span class="hljs-number">1.0f</span>;

b2PulleyJointDef jointDef;
jointDef.Initialize(myBody1, myBody2, groundAnchor1, groundAnchor2, anchor1, anchor2, ratio);
</code></pre>
<p>&#x6ED1;&#x8F6E;&#x63A5;&#x5934;&#x63D0;&#x4F9B;&#x5F53;&#x524D;&#x957F;&#x5EA6;&#x3002;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">float</span> PulleyJoint::GetLengthA() <span class="hljs-keyword">const</span>;
<span class="hljs-keyword">float</span> PulleyJoint::GetLengthB() <span class="hljs-keyword">const</span>;
</code></pre>
<h2 id="&#x9F7F;&#x8F6E;&#x63A5;&#x5934;">&#x9F7F;&#x8F6E;&#x63A5;&#x5934;</h2>
<p>&#x5982;&#x679C;&#x4F60;&#x60F3;&#x521B;&#x9020;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x673A;&#x68B0;&#x88C5;&#x7F6E;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x9F7F;&#x8F6E;&#x3002;&#x539F;&#x5219;&#x4E0A;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5728;Box2D&#x4E2D;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x590D;&#x5408;&#x5F62;&#x72B6;&#x6765;&#x5EFA;&#x6A21;&#x9F7F;&#x8F6E;&#x9F7F;&#x6765;&#x521B;&#x5EFA;&#x9F7F;&#x8F6E;&#x3002;&#x8FD9;&#x4E0D;&#x662F;&#x5F88;&#x6709;&#x6548;&#x7387;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x4E4F;&#x5473;&#x7684;&#x4F5C;&#x8005;&#x3002;&#x4F60;&#x8FD8;&#x5F97;&#x5C0F;&#x5FC3;&#x5730;&#x628A;&#x9F7F;&#x8F6E;&#x6392;&#x6210;&#x4E00;&#x884C;&#xFF0C;&#x8FD9;&#x6837;&#x7259;&#x9F7F;&#x624D;&#x80FD;&#x987A;&#x5229;&#x556E;&#x5408;&#x3002;Box2D&#x6709;&#x4E00;&#x79CD;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x521B;&#x5EFA;&#x9F7F;&#x8F6E;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;&#x9F7F;&#x8F6E;&#x8054;&#x63A5;&#x3002;</p>
<p><img src="images/joint.png" alt="joint"></p>
<p>&#x9F7F;&#x8F6E;&#x63A5;&#x5934;&#x53EA;&#x80FD;&#x8FDE;&#x63A5;&#x65CB;&#x8F6C;&#x548C;/&#x6216;&#x68F1;&#x67F1;&#x5F62;&#x63A5;&#x5934;&#x3002;</p>
<p>&#x4E0E;&#x76AE;&#x5E26;&#x8F6E;&#x4F20;&#x52A8;&#x6BD4;&#x4E00;&#x6837;&#xFF0C;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x4F20;&#x52A8;&#x6BD4;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F20;&#x52A8;&#x6BD4;&#x53EF;&#x80FD;&#x4E3A;&#x8D1F;&#x503C;&#x3002;&#x8FD8;&#x8981;&#x8BB0;&#x4F4F;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x5173;&#x8282;&#x662F;&#x65CB;&#x8F6C;&#x5173;&#x8282;&#xFF08;&#x89D2;&#xFF09;&#x800C;&#x53E6;&#x4E00;&#x4E2A;&#x5173;&#x8282;&#x662F;&#x68F1;&#x67F1;&#x5F62;&#xFF08;&#x5E73;&#x79FB;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x9F7F;&#x8F6E;&#x4F20;&#x52A8;&#x6BD4;&#x5C06;&#x6709;&#x957F;&#x5EA6;&#x5355;&#x4F4D;&#x6216;&#x4E00;&#x4E2A;&#x8D85;&#x957F;&#x5355;&#x4F4D;&#x3002;</p>
<pre><code>coordinate1 + ratio * coordinate2 == constant
</code></pre><p>&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x9F7F;&#x8F6E;&#x63A5;&#x5934;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x4E3B;&#x4F53;myBodyA&#x548C;myBodyB&#x662F;&#x6765;&#x81EA;&#x4E24;&#x4E2A;&#x5173;&#x8282;&#x7684;&#x4EFB;&#x4F55;&#x5B9E;&#x4F53;&#xFF0C;&#x53EA;&#x8981;&#x5B83;&#x4EEC;&#x4E0D;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x5B9E;&#x4F53;&#x3002;</p>
<pre><code class="lang-c++">b2GearJointDef jointDef;
jointDef.bodyA = myBodyA;
jointDef.bodyB = myBodyB;
jointDef.joint1 = myRevoluteJoint;
jointDef.joint2 = myPrismaticJoint;
jointDef.ratio = <span class="hljs-number">2.0f</span> * b2_pi / myLength;
</code></pre>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x9F7F;&#x8F6E;&#x63A5;&#x5934;&#x53D6;&#x51B3;&#x4E8E;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x63A5;&#x5934;&#x3002;&#x8FD9;&#x9020;&#x6210;&#x4E86;&#x4E00;&#x79CD;&#x8106;&#x5F31;&#x7684;&#x5C40;&#x9762;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x5173;&#x8282;&#x88AB;&#x5220;&#x9664;&#xFF0C;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#xFF1F;</p>
<blockquote>
<p><strong>&#x6CE8;&#x610F;&#x5B89;&#x5168;</strong>&#xFF1A;&#x59CB;&#x7EC8;&#x5728;&#x9F7F;&#x8F6E;&#x4E0A;&#x7684;&#x65CB;&#x8F6C;/&#x68F1;&#x67F1;&#x5F62;&#x63A5;&#x5934;&#x4E4B;&#x524D;&#x5220;&#x9664;&#x9F7F;&#x8F6E;&#x63A5;&#x5934;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x7531;&#x4E8E;&#x9F7F;&#x8F6E;&#x8054;&#x63A5;&#x4E2D;&#x7684;&#x5B64;&#x7ACB;&#x5173;&#x8282;&#x6307;&#x9488;&#xFF0C;&#x4EE3;&#x7801;&#x5C06;&#x4EE5;&#x7CDF;&#x7CD5;&#x7684;&#x65B9;&#x5F0F;&#x5D29;&#x6E83;&#x3002;&#x5728;&#x5220;&#x9664;&#x4EFB;&#x4F55;&#x76F8;&#x5173;&#x5B9E;&#x4F53;&#x4E4B;&#x524D;&#xFF0C;&#x8FD8;&#x5E94;&#x5220;&#x9664;&#x9F7F;&#x8F6E;&#x8054;&#x63A5;&#x3002;</p>
</blockquote>
<h2 id="&#x9F20;&#x6807;&#x5173;&#x8282;">&#x9F20;&#x6807;&#x5173;&#x8282;</h2>
<p>&#x5728;&#x8BD5;&#x9A8C;&#x53F0;&#x4E0A;&#x4F7F;&#x7528;&#x9F20;&#x6807;&#x5173;&#x8282;&#x6765;&#x64CD;&#x7EB5;&#x8EAB;&#x4F53;&#x3002;&#x5B83;&#x8BD5;&#x56FE;&#x5C06;&#x5B9E;&#x4F53;&#x4E0A;&#x7684;&#x4E00;&#x4E2A;&#x70B9;&#x63A8;&#x5411;&#x5149;&#x6807;&#x7684;&#x5F53;&#x524D;&#x4F4D;&#x7F6E;&#x3002;&#x65CB;&#x8F6C;&#x6CA1;&#x6709;&#x9650;&#x5236;&#x3002;</p>
<p>&#x9F20;&#x6807;&#x5173;&#x8282;&#x5B9A;&#x4E49;&#x5177;&#x6709;&#x76EE;&#x6807;&#x70B9;&#x3001;&#x6700;&#x5927;&#x529B;&#x3001;&#x9891;&#x7387;&#x548C;&#x963B;&#x5C3C;&#x6BD4;&#x3002;&#x76EE;&#x6807;&#x70B9;&#x6700;&#x521D;&#x4E0E;&#x5B9E;&#x4F53;&#x7684;&#x951A;&#x5B9A;&#x70B9;&#x91CD;&#x5408;&#x3002;&#x6700;&#x5927;&#x529B;&#x7528;&#x4E8E;&#x9632;&#x6B62;&#x591A;&#x4E2A;&#x52A8;&#x6001;&#x7269;&#x4F53;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x65F6;&#x7684;&#x5267;&#x70C8;&#x53CD;&#x5E94;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x8FD9;&#x4E2A;&#x5F04;&#x5927;&#x70B9;&#x3002;&#x9891;&#x7387;&#x548C;&#x963B;&#x5C3C;&#x6BD4;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x7C7B;&#x4F3C;&#x4E8E;&#x8DDD;&#x79BB;&#x5173;&#x8282;&#x7684;&#x5F39;&#x7C27;/&#x963B;&#x5C3C;&#x5668;&#x6548;&#x679C;&#x3002;</p>
<p>&#x8BB8;&#x591A;&#x7528;&#x6237;&#x90FD;&#x5C1D;&#x8BD5;&#x8FC7;&#x8BA9;&#x9F20;&#x6807;&#x5173;&#x8282;&#x9002;&#x5E94;&#x6E38;&#x620F;&#x3002;&#x7528;&#x6237;&#x5F80;&#x5F80;&#x5E0C;&#x671B;&#x5B9E;&#x73B0;&#x7CBE;&#x786E;&#x5B9A;&#x4F4D;&#x548C;&#x77AC;&#x65F6;&#x54CD;&#x5E94;&#x3002;&#x9F20;&#x6807;&#x5173;&#x8282;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x5DE5;&#x4F5C;&#x4E0D;&#x592A;&#x597D;&#x3002;&#x60A8;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x8003;&#x8651;&#x4F7F;&#x7528;&#x8FD0;&#x52A8;&#x5B66;&#x5B9E;&#x4F53;&#x3002;</p>
<h2 id="&#x8F66;&#x8F6E;&#x63A5;&#x5934;">&#x8F66;&#x8F6E;&#x63A5;&#x5934;</h2>
<p>&#x8F66;&#x8F6E;&#x63A5;&#x5934;&#x5C06;&#x8F66;&#x8EAB;B&#x4E0A;&#x7684;&#x4E00;&#x70B9;&#x9650;&#x5236;&#x4E3A;&#x8F66;&#x8EAB;a&#x4E0A;&#x7684;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#x3002;&#x8F66;&#x8F6E;&#x63A5;&#x5934;&#x8FD8;&#x63D0;&#x4F9B;&#x60AC;&#x67B6;&#x5F39;&#x7C27;&#x3002;&#x8BE6;&#x89C1;b2WheelJoint.h&#x548C;Car.h&#x3002;</p>
<p><img src="images/chelun.png" alt="chelun"></p>
<h2 id="&#x710A;&#x63A5;&#x63A5;&#x5934;">&#x710A;&#x63A5;&#x63A5;&#x5934;</h2>
<p>&#x710A;&#x63A5;&#x63A5;&#x5934;&#x8BD5;&#x56FE;&#x7EA6;&#x675F;&#x4E24;&#x4E2A;&#x5B9E;&#x4F53;&#x4E4B;&#x95F4;&#x7684;&#x6240;&#x6709;&#x76F8;&#x5BF9;&#x8FD0;&#x52A8;&#x3002;&#x67E5;&#x770B;&#x8BD5;&#x9A8C;&#x53F0;&#x4E0A;&#x7684;&#x60AC;&#x81C2;&#x6881;&#x3002;h&#xFF0C;&#x4EE5;&#x4E86;&#x89E3;&#x710A;&#x63A5;&#x63A5;&#x5934;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x710A;&#x63A5;&#x63A5;&#x5934;&#x6765;&#x5B9A;&#x4E49;&#x6613;&#x788E;&#x7ED3;&#x6784;&#x662F;&#x5F88;&#x6709;&#x8BF1;&#x60D1;&#x529B;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;Box2D&#x89E3;&#x7B97;&#x5668;&#x662F;&#x8FED;&#x4EE3;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5173;&#x8282;&#x6709;&#x70B9;&#x8F6F;&#x3002;&#x6240;&#x4EE5;&#x7531;&#x710A;&#x63A5;&#x63A5;&#x5934;&#x8FDE;&#x63A5;&#x7684;&#x8EAB;&#x4F53;&#x94FE;&#x4F1A;&#x5F2F;&#x66F2;&#x3002;</p>
<p>&#x76F8;&#x53CD;&#xFF0C;&#x6700;&#x597D;&#x4ECE;&#x5177;&#x6709;&#x591A;&#x4E2A;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x7684;&#x5355;&#x4E2A;&#x5B9E;&#x4F53;&#x5F00;&#x59CB;&#x521B;&#x5EFA;&#x53EF;&#x7834;&#x788E;&#x5B9E;&#x4F53;&#x3002;&#x5F53;&#x5B9E;&#x4F53;&#x65AD;&#x88C2;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x9500;&#x6BC1;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x5E76;&#x5728;&#x65B0;&#x5B9E;&#x4F53;&#x4E0A;&#x91CD;&#x65B0;&#x521B;&#x5EFA;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x6D4B;&#x8BD5;&#x5E8A;&#x4E2D;&#x7684;&#x53EF;&#x7834;&#x574F;&#x793A;&#x4F8B;&#x3002;</p>
<h2 id="&#x94A2;&#x4E1D;&#x7EF3;&#x63A5;&#x5934;">&#x94A2;&#x4E1D;&#x7EF3;&#x63A5;&#x5934;</h2>
<p>&#x7EF3;&#x63A5;&#x5934;&#x9650;&#x5236;&#x4E24;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x6700;&#x5927;&#x8DDD;&#x79BB;&#x3002;&#x8FD9;&#x6709;&#x52A9;&#x4E8E;&#x9632;&#x6B62;&#x8EAB;&#x4F53;&#x94FE;&#x62C9;&#x4F38;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x9AD8;&#x8D1F;&#x8377;&#x4E0B;&#x3002;&#x6709;&#x5173;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x89C1;b2RopeJoint.h&#x548C;rope_joint.cpp&#x3002;</p>
<h2 id="&#x6469;&#x64E6;&#x63A5;&#x5934;">&#x6469;&#x64E6;&#x63A5;&#x5934;</h2>
<p>&#x6469;&#x64E6;&#x63A5;&#x5934;&#x7528;&#x4E8E;&#x81EA;&#x4E0A;&#x800C;&#x4E0B;&#x7684;&#x6469;&#x64E6;&#x3002;&#x5173;&#x8282;&#x63D0;&#x4F9B;&#x4E8C;&#x7EF4;&#x5E73;&#x52A8;&#x6469;&#x64E6;&#x529B;&#x548C;&#x89D2;&#x6469;&#x64E6;&#x529B;&#x3002;&#x6709;&#x5173;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x89C1;b2FrictionJoint.h&#x548C;apply_force.cpp&#x3002;</p>
<h2 id="&#x7535;&#x52A8;&#x673A;&#x63A5;&#x5934;">&#x7535;&#x52A8;&#x673A;&#x63A5;&#x5934;</h2>
<p>&#x901A;&#x8FC7;&#x8FD0;&#x52A8;&#x5173;&#x8282;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6307;&#x5B9A;&#x76EE;&#x6807;&#x4F4D;&#x7F6E;&#x548C;&#x65CB;&#x8F6C;&#x504F;&#x79FB;&#x6765;&#x63A7;&#x5236;&#x5B9E;&#x4F53;&#x7684;&#x8FD0;&#x52A8;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x8FBE;&#x5230;&#x76EE;&#x6807;&#x4F4D;&#x7F6E;&#x548C;&#x65CB;&#x8F6C;&#x6240;&#x9700;&#x7684;&#x6700;&#x5927;&#x7535;&#x673A;&#x529B;&#x548C;&#x626D;&#x77E9;&#x3002;&#x5982;&#x679C;&#x8F66;&#x8EAB;&#x88AB;&#x963B;&#x6321;&#xFF0C;&#x5B83;&#x5C06;&#x505C;&#x6B62;&#xFF0C;&#x63A5;&#x89E6;&#x529B;&#x5C06;&#x4E0E;&#x6700;&#x5927;&#x7535;&#x673A;&#x529B;&#x548C;&#x626D;&#x77E9;&#x6210;&#x6BD4;&#x4F8B;&#x3002;&#x770B;&#x5230;&#x4E86;&#x5417;<a href="https://box2d.org/documentation/classb2_motor_joint.html" target="_blank"> b2MotorJoint&#x516C;&#x53F8;</a>&#x6709;&#x5173;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;motor\u joint.cpp&#x3002;</p>
<h2 id="&#x8F66;&#x8F6E;&#x63A5;&#x5934;">&#x8F66;&#x8F6E;&#x63A5;&#x5934;</h2>
<p>&#x8F66;&#x8F6E;&#x63A5;&#x5934;&#x662F;&#x4E13;&#x95E8;&#x4E3A;&#x8F66;&#x8F86;&#x8BBE;&#x8BA1;&#x7684;&#x3002;&#x5B83;&#x63D0;&#x4F9B;&#x5E73;&#x79FB;&#x548C;&#x65CB;&#x8F6C;&#x3002;&#x7FFB;&#x8BD1;&#x6709;&#x4E00;&#x4E2A;&#x5F39;&#x7C27;&#x548C;&#x51CF;&#x9707;&#x5668;&#x6765;&#x6A21;&#x62DF;&#x8F66;&#x8F86;&#x60AC;&#x67B6;&#x3002;&#x65CB;&#x8F6C;&#x4F7F;&#x8F66;&#x8F6E;&#x65CB;&#x8F6C;&#x3002;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x65CB;&#x8F6C;&#x7535;&#x673A;&#x6765;&#x9A71;&#x52A8;&#x8F66;&#x8F6E;&#x5E76;&#x5E94;&#x7528;&#x5236;&#x52A8;&#x3002;&#x770B;&#x5230;&#x4E86;&#x5417;<a href="https://box2d.org/documentation/classb2_wheel_joint.html" target="_blank">B2&#x8F66;&#x8F6E;&#x63A5;&#x5934;</a>&#xFF0C;wheel_joint.cpp&#x548C;car.cpp&#x4EE5;&#x83B7;&#x53D6;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x3002;</p>
<h1 id="&#x8054;&#x7EDC;">&#x8054;&#x7EDC;</h1>
<p>&#x89E6;&#x70B9;&#x662F;&#x7531;Box2D&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x7528;&#x4E8E;&#x7BA1;&#x7406;&#x4E24;&#x4E2A;&#x88C5;&#x7F6E;&#x4E4B;&#x95F4;&#x7684;&#x51B2;&#x7A81;&#x3002;&#x5982;&#x679C;&#x8BBE;&#x5907;&#x6709;&#x5B50;&#x8BBE;&#x5907;&#xFF0C;&#x4F8B;&#x5982;&#x94FE;&#x72B6;&#x5F62;&#x72B6;&#xFF0C;&#x5219;&#x6BCF;&#x4E2A;&#x76F8;&#x5173;&#x5B50;&#x8BBE;&#x5907;&#x90FD;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x63A5;&#x89E6;&#x3002;&#x6709;&#x4E0D;&#x540C;&#x79CD;&#x7C7B;&#x7684;&#x63A5;&#x89E6;<a href="https://box2d.org/documentation/classb2_contact.html" target="_blank">B2&#x8054;&#x7CFB;&#x4EBA;</a>&#xFF0C;&#x7528;&#x4E8E;&#x7BA1;&#x7406;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x5939;&#x5177;&#x4E4B;&#x95F4;&#x7684;&#x63A5;&#x89E6;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;contact&#x7C7B;&#x7528;&#x4E8E;&#x7BA1;&#x7406;&#x591A;&#x8FB9;&#x5F62;&#x591A;&#x8FB9;&#x5F62;&#x78B0;&#x649E;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;contact&#x7C7B;&#x7528;&#x4E8E;&#x7BA1;&#x7406;&#x5706;-&#x5706;&#x78B0;&#x649E;&#x3002;</p>
<p>&#x4EE5;&#x4E0B;&#x662F;&#x4E00;&#x4E9B;&#x4E0E;&#x8054;&#x7CFB;&#x4EBA;&#x76F8;&#x5173;&#x7684;&#x672F;&#x8BED;&#x3002;</p>
<h4 id="&#x63A5;&#x89E6;&#x70B9;">&#x63A5;&#x89E6;&#x70B9;</h4>
<p>&#x63A5;&#x89E6;&#x70B9;&#x662F;&#x4E24;&#x4E2A;&#x5F62;&#x72B6;&#x63A5;&#x89E6;&#x7684;&#x70B9;&#x3002;Box2D&#x8FD1;&#x4F3C;&#x4E8E;&#x4E0E;&#x5C11;&#x91CF;&#x70B9;&#x7684;&#x63A5;&#x89E6;&#x3002;</p>
<h4 id="&#x63A5;&#x89E6;&#x6CD5;&#x5411;">&#x63A5;&#x89E6;&#x6CD5;&#x5411;</h4>
<p>&#x63A5;&#x89E6;&#x6CD5;&#x7EBF;&#x662F;&#x4ECE;&#x4E00;&#x4E2A;&#x5F62;&#x72B6;&#x6307;&#x5411;&#x53E6;&#x4E00;&#x4E2A;&#x5F62;&#x72B6;&#x7684;&#x5355;&#x4F4D;&#x5411;&#x91CF;&#x3002;&#x6309;&#x7167;&#x60EF;&#x4F8B;&#xFF0C;&#x4ECE;fixtureA&#x5230;fixtureB&#x7684;&#x6CD5;&#x7EBF;&#x70B9;&#x3002;</p>
<h4 id="&#x89E6;&#x70B9;&#x5206;&#x79BB;">&#x89E6;&#x70B9;&#x5206;&#x79BB;</h4>
<p>&#x5206;&#x79BB;&#x4E0E;&#x6E17;&#x900F;&#x76F8;&#x53CD;&#x3002;&#x5F53;&#x5F62;&#x72B6;&#x91CD;&#x53E0;&#x65F6;&#xFF0C;&#x5206;&#x79BB;&#x4E3A;&#x8D1F;&#x3002;Box2D&#x7684;&#x672A;&#x6765;&#x7248;&#x672C;&#x53EF;&#x80FD;&#x4F1A;&#x521B;&#x5EFA;&#x5177;&#x6709;&#x6B63;&#x5206;&#x9694;&#x7684;&#x63A5;&#x89E6;&#x70B9;&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5728;&#x62A5;&#x544A;&#x63A5;&#x89E6;&#x70B9;&#x65F6;&#x68C0;&#x67E5;&#x6807;&#x5FD7;&#x3002;</p>
<h4 id="&#x63A5;&#x89E6;&#x6B67;&#x7BA1;">&#x63A5;&#x89E6;&#x6B67;&#x7BA1;</h4>
<p>&#x4E24;&#x4E2A;&#x51F8;&#x591A;&#x8FB9;&#x5F62;&#x4E4B;&#x95F4;&#x7684;&#x63A5;&#x89E6;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;&#x6700;&#x591A;2&#x4E2A;&#x63A5;&#x89E6;&#x70B9;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x70B9;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x6CD5;&#x7EBF;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x88AB;&#x5206;&#x7EC4;&#x5230;&#x4E00;&#x4E2A;&#x63A5;&#x89E6;&#x6D41;&#x5F62;&#x4E2D;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x8FDE;&#x7EED;&#x63A5;&#x89E6;&#x533A;&#x57DF;&#x7684;&#x8FD1;&#x4F3C;&#x503C;&#x3002;</p>
<h4 id="&#x6B63;&#x5E38;&#x8109;&#x51B2;">&#x6B63;&#x5E38;&#x8109;&#x51B2;</h4>
<p>&#x6CD5;&#x5411;&#x529B;&#x662F;&#x65BD;&#x52A0;&#x5728;&#x63A5;&#x89E6;&#x70B9;&#x4E0A;&#x7684;&#x529B;&#xFF0C;&#x4EE5;&#x9632;&#x6B62;&#x5F62;&#x72B6;&#x7A7F;&#x900F;&#x3002;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x8D77;&#x89C1;&#xFF0C;Box2D&#x4F7F;&#x7528;&#x8109;&#x51B2;&#x3002;&#x6CD5;&#x5411;&#x51B2;&#x91CF;&#x5C31;&#x662F;&#x6CD5;&#x5411;&#x529B;&#x4E58;&#x4EE5;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x3002;</p>
<h4 id="&#x5207;&#x5411;&#x8109;&#x51B2;">&#x5207;&#x5411;&#x8109;&#x51B2;</h4>
<p>&#x5207;&#x5411;&#x529B;&#x5728;&#x63A5;&#x89E6;&#x70B9;&#x5904;&#x4EA7;&#x751F;&#xFF0C;&#x4EE5;&#x6A21;&#x62DF;&#x6469;&#x64E6;&#x529B;&#x3002;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x8D77;&#x89C1;&#xFF0C;&#x8FD9;&#x88AB;&#x5B58;&#x50A8;&#x4E3A;&#x4E00;&#x4E2A;&#x8109;&#x51B2;&#x3002;</p>
<h4 id="&#x8054;&#x7CFB;&#x4EBA;id">&#x8054;&#x7CFB;&#x4EBA;ID</h4>
<p>Box2D&#x5C1D;&#x8BD5;&#x91CD;&#x65B0;&#x4F7F;&#x7528;&#x65F6;&#x95F4;&#x6B65;&#x7684;&#x63A5;&#x89E6;&#x529B;&#x7ED3;&#x679C;&#x4F5C;&#x4E3A;&#x4E0B;&#x4E00;&#x65F6;&#x95F4;&#x6B65;&#x7684;&#x521D;&#x59CB;&#x731C;&#x6D4B;&#x3002;Box2D&#x4F7F;&#x7528;&#x8054;&#x7CFB;&#x4EBA;id&#x8DE8;&#x65F6;&#x95F4;&#x70B9;&#x5339;&#x914D;&#x8054;&#x7CFB;&#x4EBA;&#x70B9;&#x3002;ID&#x5305;&#x542B;&#x6709;&#x52A9;&#x4E8E;&#x533A;&#x5206;&#x4E00;&#x4E2A;&#x63A5;&#x89E6;&#x70B9;&#x548C;&#x53E6;&#x4E00;&#x4E2A;&#x63A5;&#x89E6;&#x70B9;&#x7684;&#x51E0;&#x4F55;&#x7279;&#x5F81;&#x7D22;&#x5F15;&#x3002;</p>
<p>&#x5F53;&#x4E24;&#x4E2A;&#x5939;&#x5177;&#x7684;AABBs&#x91CD;&#x53E0;&#x65F6;&#xFF0C;&#x4F1A;&#x521B;&#x5EFA;&#x63A5;&#x89E6;&#x3002;&#x6709;&#x65F6;&#x78B0;&#x649E;&#x8FC7;&#x6EE4;&#x4F1A;&#x963B;&#x6B62;&#x521B;&#x5EFA;&#x63A5;&#x89E6;&#x3002;&#x968F;&#x7740;AABBs&#x505C;&#x6B62;&#x91CD;&#x53E0;&#xFF0C;&#x63A5;&#x89E6;&#x88AB;&#x7834;&#x574F;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x4E3A;&#x4E0D;&#x63A5;&#x89E6;&#x7684;&#x88C5;&#x7F6E;&#xFF08;&#x4EC5;&#x662F;&#x5B83;&#x4EEC;&#x7684;AABBs&#xFF09;&#x521B;&#x5EFA;&#x7684;&#x8054;&#x7CFB;&#x4EBA;&#x3002;&#x55EF;&#xFF0C;&#x8FD9;&#x662F;&#x5BF9;&#x7684;&#x3002;&#x8FD9;&#x662F;&#x4E2A;&#x201C;&#x9E21;&#x8FD8;&#x662F;&#x86CB;&#x201D;&#x7684;&#x95EE;&#x9898;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x77E5;&#x9053;&#x6211;&#x4EEC;&#x662F;&#x5426;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x63A5;&#x89E6;&#x5BF9;&#x8C61;&#xFF0C;&#x76F4;&#x5230;&#x4E00;&#x4E2A;&#x63A5;&#x89E6;&#x5BF9;&#x8C61;&#x88AB;&#x521B;&#x5EFA;&#x6765;&#x5206;&#x6790;&#x78B0;&#x649E;&#x3002;&#x5982;&#x679C;&#x5F62;&#x72B6;&#x4E0D;&#x63A5;&#x89E6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7ACB;&#x5373;&#x5220;&#x9664;&#x8054;&#x7CFB;&#x4EBA;&#xFF0C;&#x6216;&#x8005;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7B49;&#x5230;AABBs&#x505C;&#x6B62;&#x91CD;&#x53E0;&#x3002;Box2D&#x91C7;&#x7528;&#x540E;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5141;&#x8BB8;&#x7CFB;&#x7EDF;&#x7F13;&#x5B58;&#x4FE1;&#x606F;&#x4EE5;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#x3002;</p>
<h2 id="&#x63A5;&#x89E6;&#x7B49;&#x7EA7;">&#x63A5;&#x89E6;&#x7B49;&#x7EA7;</h2>
<p>&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;contact&#x7C7B;&#x7531;Box2D&#x521B;&#x5EFA;&#x548C;&#x9500;&#x6BC1;&#x3002;&#x8054;&#x7CFB;&#x4EBA;&#x5BF9;&#x8C61;&#x4E0D;&#x662F;&#x7531;&#x7528;&#x6237;&#x521B;&#x5EFA;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;contact&#x7C7B;&#x5E76;&#x4E0E;&#x5176;&#x4EA4;&#x4E92;&#x3002;</p>
<p>&#x60A8;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x539F;&#x59CB;&#x63A5;&#x89E6;&#x6B67;&#x7BA1;&#xFF1A;</p>
<pre><code class="lang-c++">b2Manifold* b2Contact::GetManifold();
<span class="hljs-keyword">const</span> b2Manifold* b2Contact::GetManifold() <span class="hljs-keyword">const</span>;
</code></pre>
<p>&#x60A8;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x6D41;&#x5F62;&#xFF0C;&#x4F46;&#x8FD9;&#x901A;&#x5E38;&#x4E0D;&#x53D7;&#x652F;&#x6301;&#xFF0C;&#x7528;&#x4E8E;&#x9AD8;&#x7EA7;&#x7528;&#x9014;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x6765;&#x83B7;&#x53D6;<code>b2WorldManifold</code> :</p>
<pre><code class="lang-c++"><span class="hljs-keyword">void</span> b2Contact::GetWorldManifold(b2WorldManifold* worldManifold) <span class="hljs-keyword">const</span>;
</code></pre>
<p>&#x8FD9;&#x5C06;&#x4F7F;&#x7528;&#x5B9E;&#x4F53;&#x7684;&#x5F53;&#x524D;&#x4F4D;&#x7F6E;&#x6765;&#x8BA1;&#x7B97;&#x63A5;&#x89E6;&#x70B9;&#x7684;&#x4E16;&#x754C;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x4F20;&#x611F;&#x5668;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x6B67;&#x7BA1;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x4F7F;&#x7528;&#xFF1A;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">bool</span> touching = sensorContact-&gt;IsTouching();
</code></pre>
<p>&#x6B64;&#x529F;&#x80FD;&#x4E5F;&#x9002;&#x7528;&#x4E8E;&#x975E;&#x4F20;&#x611F;&#x5668;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x4ECE;&#x8054;&#x7CFB;&#x4EBA;&#x90A3;&#x91CC;&#x5F97;&#x5230;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x3002;&#x4ECE;&#x90A3;&#x4E9B;&#x4F60;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x5C38;&#x4F53;&#x3002;</p>
<pre><code class="lang-c++">b2Fixture* fixtureA = myContact-&gt;GetFixtureA();
b2Body* bodyA = fixtureA-&gt;GetBody();
MyActor* actorA = (MyActor*)bodyA-&gt;GetUserData().pointer;
</code></pre>
<p>&#x60A8;&#x53EF;&#x4EE5;&#x7981;&#x7528;&#x8054;&#x7CFB;&#x4EBA;&#x3002;&#x8FD9;&#x53EA;&#x5728;<a href="https://box2d.org/documentation/classb2_contact_listener.html#a416f85eb45a1099053402b15a19a7de0" target="_blank"> b2ContactListener:&#xFF1A;&#x9884;&#x89E3;&#x51B3;</a>&#x4E8B;&#x4EF6;&#xFF0C;&#x8BA8;&#x8BBA;&#x5982;&#x4E0B;</p>
<h2 id="&#x8BBF;&#x95EE;&#x8054;&#x7CFB;&#x4EBA;">&#x8BBF;&#x95EE;&#x8054;&#x7CFB;&#x4EBA;</h2>
<p>&#x60A8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x591A;&#x79CD;&#x65B9;&#x5F0F;&#x8BBF;&#x95EE;&#x8054;&#x7CFB;&#x4EBA;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x4E16;&#x754C;&#x548C;&#x8EAB;&#x4F53;&#x7ED3;&#x6784;&#x7684;&#x63A5;&#x89E6;&#x3002;&#x60A8;&#x8FD8;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x8054;&#x7CFB;&#x4EBA;&#x4FA6;&#x542C;&#x5668;&#x3002;</p>
<p>&#x60A8;&#x53EF;&#x4EE5;&#x8FED;&#x4EE3;&#x4E16;&#x754C;&#x4E0A;&#x7684;&#x6240;&#x6709;&#x8054;&#x7CFB;&#x4EBA;&#xFF1A;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">for</span> (b2Contact* c = myWorld-&gt;GetContactList(); c; c = c-&gt;GetNext())
{
    <span class="hljs-comment">// process c</span>
}
</code></pre>
<p>&#x60A8;&#x8FD8;&#x53EF;&#x4EE5;&#x8FED;&#x4EE3;&#x5B9E;&#x4F53;&#x4E0A;&#x7684;&#x6240;&#x6709;&#x8054;&#x7CFB;&#x4EBA;&#x3002;&#x8FD9;&#x4E9B;&#x662F;&#x7528;&#x63A5;&#x89E6;&#x8FB9;&#x7ED3;&#x6784;&#x5B58;&#x50A8;&#x5728;&#x56FE;&#x5F62;&#x4E2D;&#x7684;&#x3002;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">for</span> (b2ContactEdge* ce = myBody-&gt;GetContactList(); ce; ce = ce-&gt;next)
{
    b2Contact* c = ce-&gt;contact;
    <span class="hljs-comment">// process c</span>
}
</code></pre>
<p>&#x60A8;&#x8FD8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E0B;&#x9762;&#x4ECB;&#x7ECD;&#x7684;&#x8054;&#x7CFB;&#x4EBA;&#x4FA6;&#x542C;&#x5668;&#x8BBF;&#x95EE;&#x8054;&#x7CFB;&#x4EBA;&#x3002;</p>
<blockquote>
<p><strong>&#x6CE8;&#x610F;&#x5B89;&#x5168;</strong>&#xFF1A;&#x5173;&#x95ED;&#x8BBF;&#x95EE;&#x8054;&#x7CFB;&#x4EBA;<a href="https://box2d.org/documentation/classb2_world.html" target="_blank">b2World&#x516C;&#x53F8;</a>&#x548C;<a href="https://box2d.org/documentation/classb2_body.html" target="_blank">b2Body&#x516C;&#x53F8;</a>&#x53EF;&#x80FD;&#x4F1A;&#x9519;&#x8FC7;&#x4E00;&#x4E9B;&#x5728;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x4E2D;&#x95F4;&#x51FA;&#x73B0;&#x7684;&#x77AC;&#x65F6;&#x63A5;&#x89E6;&#x3002;&#x4F7F;&#x7528;<a href="https://box2d.org/documentation/classb2_contact_listener.html" target="_blank"> b2ContactListener</a>&#x4EE5;&#x83B7;&#x5F97;&#x6700;&#x51C6;&#x786E;&#x7684;&#x7ED3;&#x679C;</p>
</blockquote>
<h2 id="&#x8054;&#x7CFB;&#x542C;&#x4F17;">&#x8054;&#x7CFB;&#x542C;&#x4F17;</h2>
<p>&#x60A8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B9E;&#x73B0;<a href="https://box2d.org/documentation/classb2_contact_listener.html" target="_blank"> b2ContactListener</a>. &#x8054;&#x7CFB;&#x4EBA;&#x4FA6;&#x542C;&#x5668;&#x652F;&#x6301;&#x51E0;&#x4E2A;&#x4E8B;&#x4EF6;&#xFF1A;&#x5F00;&#x59CB;&#x3001;&#x7ED3;&#x675F;&#x3001;&#x9884;&#x6C42;&#x89E3;&#x548C;&#x540E;&#x6C42;&#x89E3;&#x3002;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">class</span> MyContactListener : <span class="hljs-keyword">public</span> b2ContactListener
{
<span class="hljs-keyword">public</span>:

<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">BeginContact</span><span class="hljs-params">(b2Contact* contact)</span>
</span>{ <span class="hljs-comment">/* handle begin event */</span> }

<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">EndContact</span><span class="hljs-params">(b2Contact* contact)</span>
</span>{ <span class="hljs-comment">/* handle end event */</span> }

<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">PreSolve</span><span class="hljs-params">(b2Contact* contact, <span class="hljs-keyword">const</span> b2Manifold* oldManifold)</span>
</span>{ <span class="hljs-comment">/* handle pre-solve event */</span> }

<span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">PostSolve</span><span class="hljs-params">(b2Contact* contact, <span class="hljs-keyword">const</span> b2ContactImpulse* impulse)</span>
</span>{ <span class="hljs-comment">/* handle post-solve event */</span> }
};
</code></pre>
<blockquote>
<p><strong>&#x6CE8;&#x610F;&#x5B89;&#x5168;</strong>&#xFF1A;&#x4E0D;&#x8981;&#x4FDD;&#x7559;&#x5BF9;&#x53D1;&#x9001;&#x5230;&#x7684;&#x6307;&#x9488;&#x7684;&#x5F15;&#x7528;<a href="https://box2d.org/documentation/classb2_contact_listener.html" target="_blank"> b2ContactListener</a>. &#x76F8;&#x53CD;&#xFF0C;&#x5C06;&#x63A5;&#x89E6;&#x70B9;&#x6570;&#x636E;&#x7684;&#x6DF1;&#x5EA6;&#x526F;&#x672C;&#x653E;&#x5165;&#x81EA;&#x5DF1;&#x7684;&#x7F13;&#x51B2;&#x533A;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x5C55;&#x793A;&#x4E86;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x3002;</p>
</blockquote>
<p>&#x5728;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4FA6;&#x542C;&#x5668;&#x7684;&#x5B9E;&#x4F8B;&#x5E76;&#x5C06;&#x5176;&#x6CE8;&#x518C;&#x5230;<a href="https://box2d.org/documentation/classb2_world.html#a614549967fb8a1584b61c11e2d553d42" target="_blank"> B2World:&#xFF1A;SetContactListener</a>. &#x5F53;world&#x5BF9;&#x8C61;&#x5B58;&#x5728;&#x65F6;&#xFF0C;&#x786E;&#x4FDD;&#x4FA6;&#x542C;&#x5668;&#x4ECD;&#x5728;&#x4F5C;&#x7528;&#x57DF;&#x4E2D;&#x3002;</p>
<h3 id="&#x5F00;&#x59CB;&#x63A5;&#x89E6;&#x4E8B;&#x4EF6;">&#x5F00;&#x59CB;&#x63A5;&#x89E6;&#x4E8B;&#x4EF6;</h3>
<p>&#x5F53;&#x4E24;&#x4E2A;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x5F00;&#x59CB;&#x91CD;&#x53E0;&#x65F6;&#x79F0;&#x4E4B;&#x4E3A;&#x3002;&#x8FD9;&#x88AB;&#x79F0;&#x4E3A;&#x4F20;&#x611F;&#x5668;&#x548C;&#x975E;&#x4F20;&#x611F;&#x5668;&#x3002;&#x6B64;&#x4E8B;&#x4EF6;&#x53EA;&#x80FD;&#x5728;&#x65F6;&#x95F4;&#x70B9;&#x5185;&#x53D1;&#x751F;&#x3002;</p>
<h3 id="&#x7ED3;&#x675F;&#x63A5;&#x89E6;&#x4E8B;&#x4EF6;">&#x7ED3;&#x675F;&#x63A5;&#x89E6;&#x4E8B;&#x4EF6;</h3>
<p>&#x5F53;&#x4E24;&#x4E2A;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x505C;&#x6B62;&#x91CD;&#x53E0;&#x65F6;&#xFF0C;&#x79F0;&#x4E4B;&#x4E3A;&#x3002;&#x8FD9;&#x88AB;&#x79F0;&#x4E3A;&#x4F20;&#x611F;&#x5668;&#x548C;&#x975E;&#x4F20;&#x611F;&#x5668;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x7269;&#x4F53;&#x88AB;&#x6467;&#x6BC1;&#x65F6;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x4E8B;&#x4EF6;&#x53EF;&#x4EE5;&#x53D1;&#x751F;&#x5728;&#x65F6;&#x95F4;&#x6B65;&#x4E4B;&#x5916;&#x3002;</p>
<h3 id="&#x9884;&#x89E3;&#x51B3;&#x4E8B;&#x4EF6;">&#x9884;&#x89E3;&#x51B3;&#x4E8B;&#x4EF6;</h3>
<p>&#x8FD9;&#x5728;&#x78B0;&#x649E;&#x68C0;&#x6D4B;&#x4E4B;&#x540E;&#xFF0C;&#x4F46;&#x5728;&#x51B2;&#x7A81;&#x89E3;&#x51B3;&#x4E4B;&#x524D;&#x8C03;&#x7528;&#x3002;&#x8FD9;&#x4F7F;&#x60A8;&#x6709;&#x673A;&#x4F1A;&#x6839;&#x636E;&#x5F53;&#x524D;&#x914D;&#x7F6E;&#x7981;&#x7528;&#x8054;&#x7CFB;&#x4EBA;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6B64;&#x56DE;&#x8C03;&#x5E76;&#x8C03;&#x7528;b2Contact:&#xFF1A;SetEnabled&#xFF08;false&#xFF09;&#x6765;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x5355;&#x8FB9;&#x5E73;&#x53F0;&#x3002;&#x6BCF;&#x6B21;&#x901A;&#x8FC7;&#x51B2;&#x7A81;&#x5904;&#x7406;&#x90FD;&#x4F1A;&#x91CD;&#x65B0;&#x542F;&#x7528;&#x8BE5;&#x8054;&#x7CFB;&#x4EBA;&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x9700;&#x8981;&#x5728;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#x7981;&#x7528;&#x8BE5;&#x8054;&#x7CFB;&#x4EBA;&#x3002;&#x7531;&#x4E8E;&#x8FDE;&#x7EED;&#x7684;&#x78B0;&#x649E;&#x68C0;&#x6D4B;&#xFF0C;&#x9884;&#x89E3;&#x51B3;&#x4E8B;&#x4EF6;&#x53EF;&#x80FD;&#x5728;&#x6BCF;&#x4E2A;&#x63A5;&#x89E6;&#x7684;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x89E6;&#x53D1;&#x591A;&#x6B21;&#x3002;</p>
<pre><code class="lang-c++"><span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">PreSolve</span><span class="hljs-params">(b2Contact* contact, <span class="hljs-keyword">const</span> b2Manifold* oldManifold)</span>
</span>{
    b2WorldManifold worldManifold;
    contact-&gt;GetWorldManifold(&amp;worldManifold);
    <span class="hljs-keyword">if</span> (worldManifold.normal.y &lt; <span class="hljs-number">-0.5</span>f)
    {
        contact-&gt;SetEnabled(<span class="hljs-literal">false</span>);
    }
}
</code></pre>
<p>&#x9884;&#x89E3;&#x7B97;&#x4E8B;&#x4EF6;&#x4E5F;&#x662F;&#x786E;&#x5B9A;&#x78B0;&#x649E;&#x70B9;&#x72B6;&#x6001;&#x548C;&#x63A5;&#x8FD1;&#x901F;&#x5EA6;&#x7684;&#x597D;&#x5730;&#x65B9;&#x3002;</p>
<pre><code class="lang-c++"><span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">PreSolve</span><span class="hljs-params">(b2Contact* contact, <span class="hljs-keyword">const</span> b2Manifold* oldManifold)</span>
</span>{
    b2WorldManifold worldManifold;
    contact-&gt;GetWorldManifold(&amp;worldManifold);

    b2PointState state1[<span class="hljs-number">2</span>], state2[<span class="hljs-number">2</span>];
    b2GetPointStates(state1, state2, oldManifold, contact-&gt;GetManifold());

    <span class="hljs-keyword">if</span> (state2[<span class="hljs-number">0</span>] == b2_addState)
    {
        <span class="hljs-keyword">const</span> b2Body* bodyA = contact-&gt;GetFixtureA()-&gt;GetBody();
        <span class="hljs-keyword">const</span> b2Body* bodyB = contact-&gt;GetFixtureB()-&gt;GetBody();
        b2Vec2 point = worldManifold.points[<span class="hljs-number">0</span>];
        b2Vec2 vA = bodyA-&gt;GetLinearVelocityFromWorldPoint(point);
        b2Vec2 vB = bodyB-&gt;GetLinearVelocityFromWorldPoint(point);

        <span class="hljs-keyword">float</span> approachVelocity = b2Dot(vB -- vA, worldManifold.normal);

        <span class="hljs-keyword">if</span> (approachVelocity &gt; <span class="hljs-number">1.0f</span>)
        {
            MyPlayCollisionSound();
        }
    }
}
</code></pre>
<h3 id="&#x540E;&#x89E3;&#x51B3;&#x4E8B;&#x4EF6;">&#x540E;&#x89E3;&#x51B3;&#x4E8B;&#x4EF6;</h3>
<p>&#x5728;&#x201C;&#x540E;&#x6C42;&#x89E3;&#x201D;&#x4E8B;&#x4EF6;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x6536;&#x96C6;&#x78B0;&#x649E;&#x8109;&#x51B2;&#x7ED3;&#x679C;&#x3002;&#x5982;&#x679C;&#x60A8;&#x4E0D;&#x5173;&#x5FC3;&#x8109;&#x51B2;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x5E94;&#x8BE5;&#x53EA;&#x5B9E;&#x73B0;pre-solve&#x4E8B;&#x4EF6;&#x3002;</p>
<p>&#x5728;&#x8054;&#x7CFB;&#x4EBA;&#x56DE;&#x8C03;&#x4E2D;&#x5B9E;&#x73B0;&#x6539;&#x53D8;&#x7269;&#x7406;&#x4E16;&#x754C;&#x7684;&#x6E38;&#x620F;&#x903B;&#x8F91;&#x662F;&#x5F88;&#x8BF1;&#x4EBA;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x78B0;&#x649E;&#xFF0C;&#x8BE5;&#x78B0;&#x649E;&#x4F1A;&#x5E94;&#x7528;&#x635F;&#x5BB3;&#x5E76;&#x5C1D;&#x8BD5;&#x9500;&#x6BC1;&#x5173;&#x8054;&#x7684;&#x89D2;&#x8272;&#x53CA;&#x5176;&#x521A;&#x4F53;&#x3002;&#x4F46;&#x662F;&#xFF0C;Box2D&#x4E0D;&#x5141;&#x8BB8;&#x60A8;&#x5728;&#x56DE;&#x8C03;&#x4E2D;&#x66F4;&#x6539;&#x7269;&#x7406;&#x4E16;&#x754C;&#xFF0C;&#x56E0;&#x4E3A;&#x60A8;&#x53EF;&#x80FD;&#x4F1A;&#x7834;&#x574F;Box2D&#x5F53;&#x524D;&#x6B63;&#x5728;&#x5904;&#x7406;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x5B64;&#x7ACB;&#x6307;&#x9488;&#x3002;</p>
<p>&#x5904;&#x7406;&#x63A5;&#x89E6;&#x70B9;&#x7684;&#x63A8;&#x8350;&#x505A;&#x6CD5;&#x662F;&#x7F13;&#x51B2;&#x60A8;&#x5173;&#x5FC3;&#x7684;&#x6240;&#x6709;&#x8054;&#x7CFB;&#x4EBA;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x5728;&#x65F6;&#x95F4;&#x70B9;&#x4E4B;&#x540E;&#x5904;&#x7406;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x3002;&#x60A8;&#x5E94;&#x59CB;&#x7EC8;&#x5728;&#x65F6;&#x95F4;&#x6B65;&#x540E;&#x7ACB;&#x5373;&#x5904;&#x7406;&#x63A5;&#x89E6;&#x70B9;&#xFF1B;&#x5426;&#x5219;&#xFF0C;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x5BA2;&#x6237;&#x7AEF;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x4F1A;&#x6539;&#x53D8;&#x7269;&#x7406;&#x4E16;&#x754C;&#xFF0C;&#x4F7F;&#x8054;&#x7CFB;&#x4EBA;&#x7F13;&#x51B2;&#x533A;&#x5931;&#x6548;&#x3002;&#x5F53;&#x4F60;&#x5904;&#x7406;&#x63A5;&#x89E6;&#x7F13;&#x51B2;&#x533A;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x7269;&#x7406;&#x4E16;&#x754C;&#xFF0C;&#x4F46;&#x4F60;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x5C0F;&#x5FC3;&#xFF0C;&#x4F60;&#x4E0D;&#x8981;&#x5B64;&#x7ACB;&#x7684;&#x6307;&#x9488;&#x5B58;&#x50A8;&#x5728;&#x63A5;&#x89E6;&#x70B9;&#x7F13;&#x51B2;&#x533A;&#x3002;&#x8BE5;&#x6D4B;&#x8BD5;&#x53F0;&#x5177;&#x6709;&#x793A;&#x4F8B;&#x63A5;&#x89E6;&#x70B9;&#x5904;&#x7406;&#xFF0C;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x5B64;&#x7ACB;&#x6307;&#x9488;&#x3002;</p>
<p>CollisionProcessing&#x6D4B;&#x8BD5;&#x4E2D;&#x7684;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x5C55;&#x793A;&#x4E86;&#x5728;&#x5904;&#x7406;&#x63A5;&#x89E6;&#x7F13;&#x51B2;&#x533A;&#x65F6;&#x5982;&#x4F55;&#x5904;&#x7406;&#x5B64;&#x7ACB;&#x4F53;&#x3002;&#x8FD9;&#x662F;&#x8282;&#x9009;&#x3002;&#x8BF7;&#x52A1;&#x5FC5;&#x9605;&#x8BFB;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x6CE8;&#x91CA;&#x3002;&#x6B64;&#x4EE3;&#x7801;&#x5047;&#x5B9A;&#x6240;&#x6709;&#x63A5;&#x89E6;&#x70B9;&#x90FD;&#x5DF2;&#x7F13;&#x51B2;&#x5728;b2ContactPoint&#x6570;&#x7EC4;m_&#x70B9;&#x4E2D;&#x3002;</p>
<pre><code class="lang-c++"><span class="hljs-comment">// We are going to destroy some bodies according to contact</span>
<span class="hljs-comment">// points. We must buffer the bodies that should be destroyed</span>
<span class="hljs-comment">// because they may belong to multiple contact points.</span>
<span class="hljs-keyword">const</span> int32 k_maxNuke = <span class="hljs-number">6</span>;
b2Body* nuke[k_maxNuke];
int32 nukeCount = <span class="hljs-number">0</span>;

<span class="hljs-comment">// Traverse the contact buffer. Destroy bodies that</span>
<span class="hljs-comment">// are touching heavier bodies.</span>
<span class="hljs-keyword">for</span> (int32 i = <span class="hljs-number">0</span>; i &lt; m_pointCount; ++i)
{
    ContactPoint* point = m_points + i;
    b2Body* bodyA = point-&gt;fixtureA-&gt;GetBody();
    b2Body* bodyB = point-&gt;FixtureB-&gt;GetBody();
    <span class="hljs-keyword">float</span> massA = bodyA-&gt;GetMass();
    <span class="hljs-keyword">float</span> massB = bodyB-&gt;GetMass();

    <span class="hljs-keyword">if</span> (massA &gt; <span class="hljs-number">0.0f</span> &amp;&amp; massB &gt; <span class="hljs-number">0.0f</span>)
    {
        <span class="hljs-keyword">if</span> (massB &gt; massA)
        {
            nuke[nukeCount++] = bodyA;
        }
        <span class="hljs-keyword">else</span>
        {
            nuke[nukeCount++] = bodyB;
        }

        <span class="hljs-keyword">if</span> (nukeCount == k_maxNuke)
        {
            <span class="hljs-keyword">break</span>;
        }
    }
}

<span class="hljs-comment">// Sort the nuke array to group duplicates.</span>
<span class="hljs-built_in">std</span>::sort(nuke, nuke + nukeCount);

<span class="hljs-comment">// Destroy the bodies, skipping duplicates.</span>
int32 i = <span class="hljs-number">0</span>;
<span class="hljs-keyword">while</span> (i &lt; nukeCount)
{
    b2Body* b = nuke[i++];
    <span class="hljs-keyword">while</span> (i &lt; nukeCount &amp;&amp; nuke[i] == b)
    {
        ++i;
    }

    m_world-&gt;DestroyBody(b);
}
</code></pre>
<h2 id="&#x63A5;&#x89E6;&#x8FC7;&#x6EE4;">&#x63A5;&#x89E6;&#x8FC7;&#x6EE4;</h2>
<p>&#x901A;&#x5E38;&#x5728;&#x6E38;&#x620F;&#x4E2D;&#x4F60;&#x4E0D;&#x5E0C;&#x671B;&#x6240;&#x6709;&#x7684;&#x7269;&#x4F53;&#x90FD;&#x78B0;&#x649E;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x53EA;&#x6709;&#x7279;&#x5B9A;&#x5B57;&#x7B26;&#x624D;&#x80FD;&#x901A;&#x8FC7;&#x7684;&#x95E8;&#x3002;&#x8FD9;&#x53EB;&#x505A;&#x63A5;&#x89E6;&#x8FC7;&#x6EE4;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x4E9B;&#x4EA4;&#x4E92;&#x4F5C;&#x7528;&#x88AB;&#x8FC7;&#x6EE4;&#x6389;&#x4E86;&#x3002;</p>
<p>Box2D&#x5141;&#x8BB8;&#x60A8;&#x901A;&#x8FC7;&#x5B9E;&#x73B0;<a href="https://box2d.org/documentation/classb2_contact_filter.html" target="_blank"> b2ContactFilter&#x516C;&#x53F8;</a>&#x73ED;&#x7EA7;&#x3002;&#x6B64;&#x7C7B;&#x8981;&#x6C42;&#x60A8;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;ShouldCollide&#x51FD;&#x6570;&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x63A5;&#x6536;&#x4E24;&#x4E2A;<a href="https://box2d.org/documentation/classb2_shape.html" target="_blank">B2&#x5F62;&#x72B6;</a>&#x6307;&#x9488;&#x3002;&#x5982;&#x679C;&#x5F62;&#x72B6;&#x53D1;&#x751F;&#x78B0;&#x649E;&#xFF0C;&#x5219;&#x51FD;&#x6570;&#x8FD4;&#x56DE;true&#x3002;</p>
<p>ShouldCollide&#x7684;&#x9ED8;&#x8BA4;&#x5B9E;&#x73B0;&#x4F7F;&#x7528;&#x7B2C;6&#x7AE0;fixture&#x4E2D;&#x5B9A;&#x4E49;&#x7684;b2FilterData&#x3002;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">bool</span> b2ContactFilter::ShouldCollide(b2Fixture* fixtureA, b2Fixture* fixtureB)
{
    <span class="hljs-keyword">const</span> b2Filter&amp; filterA = fixtureA-&gt;GetFilterData();
    <span class="hljs-keyword">const</span> b2Filter&amp; filterB = fixtureB-&gt;GetFilterData();

    <span class="hljs-keyword">if</span> (filterA.groupIndex == filterB.groupIndex &amp;&amp; filterA.groupIndex != <span class="hljs-number">0</span>)
    {
        <span class="hljs-keyword">return</span> filterA.groupIndex &gt; <span class="hljs-number">0</span>;
    }

    <span class="hljs-keyword">bool</span> collideA = (filterA.maskBits &amp; filterB.categoryBits) != <span class="hljs-number">0</span>;
    <span class="hljs-keyword">bool</span> collideB = (filterA.categoryBits &amp; filterB.maskBits) != <span class="hljs-number">0</span>
    <span class="hljs-keyword">bool</span> collide =  collideA &amp;&amp; collideB;
    <span class="hljs-keyword">return</span> collide;
}
</code></pre>
<p>&#x5728;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x8054;&#x7CFB;&#x4EBA;&#x7B5B;&#x9009;&#x5668;&#x7684;&#x5B9E;&#x4F8B;&#x5E76;&#x5C06;&#x5176;&#x6CE8;&#x518C;&#x5230;<a href="https://box2d.org/documentation/classb2_world.html#a85e6e1e911c7d6366f8c7d57a12b72ff" target="_blank"> b2World:&#xFF1A;SetContactFilter</a>. &#x5F53;&#x4E16;&#x754C;&#x5B58;&#x5728;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x786E;&#x4FDD;&#x4F60;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#x5728;&#x8303;&#x56F4;&#x5185;&#x3002;</p>
<pre><code class="lang-c++">MyContactFilter filter;
world-&gt;SetContactFilter(&amp;filter);
<span class="hljs-comment">// filter remains in scope ...</span>
</code></pre>
<h1 id="&#x4E16;&#x754C;">&#x4E16;&#x754C;</h1>
<p>&#x8FD9;&#x4E2A;<code>b2World</code>&#x7C7B;&#x5305;&#x542B;&#x5B9E;&#x4F53;&#x548C;&#x5173;&#x8282;&#x3002;&#x5B83;&#x7BA1;&#x7406;&#x6A21;&#x62DF;&#x7684;&#x6240;&#x6709;&#x65B9;&#x9762;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;&#x5F02;&#x6B65;&#x67E5;&#x8BE2;&#xFF08;&#x5982;AABB&#x67E5;&#x8BE2;&#x548C;&#x5149;&#x7EBF;&#x6295;&#x5C04;&#xFF09;&#x3002;&#x60A8;&#x4E0E;Box2D&#x7684;&#x5927;&#x90E8;&#x5206;&#x4EA4;&#x4E92;&#x90FD;&#x5C06;&#x4E0E;<a href="https://box2d.org/documentation/classb2_world.html" target="_blank">b2World&#x516C;&#x53F8;</a>&#x5BF9;&#x8C61;</p>
<h2 id="&#x521B;&#x9020;&#x548C;&#x6BC1;&#x706D;&#x4E16;&#x754C;">&#x521B;&#x9020;&#x548C;&#x6BC1;&#x706D;&#x4E16;&#x754C;</h2>
<p>&#x521B;&#x9020;&#x4E00;&#x4E2A;&#x4E16;&#x754C;&#x662F;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x7684;&#x3002;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x91CD;&#x529B;&#x5411;&#x91CF;&#x548C;&#x4E00;&#x4E2A;&#x5E03;&#x5C14;&#x503C;&#x6765;&#x6307;&#x793A;&#x8EAB;&#x4F53;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x7761;&#x89C9;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x60A8;&#x5C06;&#x4F7F;&#x7528;&#x201C;&#x65B0;&#x5EFA;&#x201D;&#x548C;&#x201C;&#x5220;&#x9664;&#x201D;&#x6765;&#x521B;&#x5EFA;&#x548C;&#x9500;&#x6BC1;&#x4E00;&#x4E2A;&#x4E16;&#x754C;&#x3002;</p>
<pre><code class="lang-c++">b2World* myWorld = <span class="hljs-keyword">new</span> b2World(gravity, doSleep);

<span class="hljs-comment">// ... do stuff ...</span>

<span class="hljs-keyword">delete</span> myWorld;
</code></pre>
<h2 id="&#x5229;&#x7528;&#x4E16;&#x754C;">&#x5229;&#x7528;&#x4E16;&#x754C;</h2>
<p>&#x4E16;&#x754C;&#x7EA7;&#x5305;&#x62EC;&#x5236;&#x9020;&#x548C;&#x7834;&#x574F;&#x8EAB;&#x4F53;&#x548C;&#x5173;&#x8282;&#x7684;&#x5DE5;&#x5382;&#x3002;&#x8FD9;&#x4E9B;&#x5DE5;&#x5382;&#x5C06;&#x5728;&#x540E;&#x9762;&#x6709;&#x5173;&#x8F66;&#x8EAB;&#x548C;&#x63A5;&#x5934;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#x8BA8;&#x8BBA;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x4E0E;<a href="https://box2d.org/documentation/classb2_world.html" target="_blank">b2World&#x516C;&#x53F8;</a>&#x6211;&#x73B0;&#x5728;&#x5C31;&#x6765;&#x62A5;&#x9053;</p>
<h2 id="&#x6A21;&#x62DF;">&#x6A21;&#x62DF;</h2>
<p>&#x4E16;&#x754C;&#x7EA7;&#x7684;&#x6C7D;&#x8F66;&#x88AB;&#x7528;&#x6765;&#x9A71;&#x52A8;&#x6A21;&#x62DF;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x65F6;&#x95F4;&#x70B9;&#x4EE5;&#x53CA;&#x901F;&#x5EA6;&#x548C;&#x4F4D;&#x7F6E;&#x8FED;&#x4EE3;&#x8BA1;&#x6570;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">float</span> timeStep = <span class="hljs-number">1.0f</span> / <span class="hljs-number">60.f</span>;
int32 velocityIterations = <span class="hljs-number">10</span>;
int32 positionIterations = <span class="hljs-number">8</span>;
myWorld-&gt;Step(timeStep, velocityIterations, positionIterations);
</code></pre>
<p>&#x65F6;&#x95F4;&#x70B9;&#x8FC7;&#x540E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x68C0;&#x67E5;&#x4F60;&#x7684;&#x8EAB;&#x4F53;&#x548C;&#x5173;&#x8282;&#xFF0C;&#x4EE5;&#x83B7;&#x53D6;&#x4FE1;&#x606F;&#x3002;&#x6700;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x662F;&#x4F60;&#x4F1A;&#x4ECE;&#x8EAB;&#x4F53;&#x4E0A;&#x6293;&#x53D6;&#x4F4D;&#x7F6E;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x66F4;&#x65B0;&#x4F60;&#x7684;&#x6F14;&#x5458;&#x5E76;&#x6E32;&#x67D3;&#x4ED6;&#x4EEC;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x6E38;&#x620F;&#x5FAA;&#x73AF;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x6B65;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x4E8B;&#x60C5;&#x7684;&#x987A;&#x5E8F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x83B7;&#x53D6;&#x8BE5;&#x5E27;&#x4E2D;&#x65B0;&#x5B9E;&#x4F53;&#x7684;&#x78B0;&#x649E;&#x7ED3;&#x679C;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x5728;&#x65F6;&#x95F4;&#x70B9;&#x4E4B;&#x524D;&#x521B;&#x5EFA;&#x5B9E;&#x4F53;&#x3002;</p>
<p>&#x6B63;&#x5982;&#x6211;&#x5728;&#x4E0A;&#x9762;&#x7684;HelloWorld&#x6559;&#x7A0B;&#x4E2D;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x56FA;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x3002;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x8F83;&#x5927;&#x7684;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5728;&#x4F4E;&#x5E27;&#x901F;&#x7387;&#x60C5;&#x51B5;&#x4E0B;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#x3002;&#x4F46;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x4E0D;&#x8D85;&#x8FC7;1/30&#x79D2;&#x7684;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x3002;1/60&#x79D2;&#x7684;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x6A21;&#x62DF;&#x3002;</p>
<p>&#x8FED;&#x4EE3;&#x8BA1;&#x6570;&#x63A7;&#x5236;&#x7EA6;&#x675F;&#x89E3;&#x7B97;&#x5668;&#x626B;&#x63CF;&#x4E16;&#x754C;&#x4E0A;&#x6240;&#x6709;&#x63A5;&#x89E6;&#x548C;&#x5173;&#x8282;&#x7684;&#x6B21;&#x6570;&#x3002;&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#x8D8A;&#x591A;&#xFF0C;&#x6A21;&#x62DF;&#x6548;&#x679C;&#x8D8A;&#x597D;&#x3002;&#x4F46;&#x662F;&#x4E0D;&#x8981;&#x7528;&#x4E00;&#x4E2A;&#x5C0F;&#x7684;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x6765;&#x6362;&#x53D6;&#x5927;&#x91CF;&#x7684;&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#x3002;10&#x8D6B;&#x5179;&#x548C;60&#x8D6B;&#x5179;&#x7684;&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#x6BD4;20&#x8D6B;&#x5179;&#x8981;&#x597D;&#x5F97;&#x591A;&#x3002;</p>
<p>&#x8E0F;&#x6B65;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x6E05;&#x9664;&#x4F60;&#x65BD;&#x52A0;&#x5728;&#x4F60;&#x8EAB;&#x4F53;&#x4E0A;&#x7684;&#x4EFB;&#x4F55;&#x529B;&#x91CF;&#x3002;&#x8FD9;&#x662F;&#x901A;&#x8FC7;&#x547D;&#x4EE4;&#x5B8C;&#x6210;&#x7684;<code>b2World::ClearForces</code>. &#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x529B;&#x573A;&#x6267;&#x884C;&#x591A;&#x4E2A;&#x5B50;&#x6B65;&#x9AA4;&#x3002;</p>
<pre><code class="lang-c++">myWorld-&gt;ClearForces();
</code></pre>
<h2 id="&#x63A2;&#x7D22;&#x4E16;&#x754C;">&#x63A2;&#x7D22;&#x4E16;&#x754C;</h2>
<p>&#x4E16;&#x754C;&#x662F;&#x8EAB;&#x4F53;&#x3001;&#x63A5;&#x89E6;&#x548C;&#x5173;&#x8282;&#x7684;&#x5BB9;&#x5668;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x4ECE;&#x4E16;&#x754C;&#x5404;&#x5730;&#x6293;&#x53D6;body&#x3001;contact&#x548C;joint&#x5217;&#x8868;&#x5E76;&#x5728;&#x5B83;&#x4EEC;&#x4E0A;&#x8FED;&#x4EE3;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x5524;&#x9192;&#x4E86;&#x4E16;&#x754C;&#x4E0A;&#x6240;&#x6709;&#x7684;&#x8EAB;&#x4F53;&#xFF1A;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">for</span> (b2Body* b = myWorld-&gt;GetBodyList(); b; b = b-&gt;GetNext())
{
    b-&gt;SetAwake(<span class="hljs-literal">true</span>);
}
</code></pre>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x771F;&#x6B63;&#x7684;&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x66F4;&#x590D;&#x6742;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#x88AB;&#x7834;&#x574F;&#xFF1A;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">for</span> (b2Body* b = myWorld-&gt;GetBodyList(); b; b = b-&gt;GetNext())
{
    GameActor* myActor = (GameActor*)b-&gt;GetUserData().pointer;
    <span class="hljs-keyword">if</span> (myActor-&gt;IsDead())
    {
        myWorld-&gt;DestroyBody(b); <span class="hljs-comment">// ERROR: now GetNext returns garbage.</span>
    }
}
</code></pre>
<p>&#x5728;&#x5C38;&#x4F53;&#x88AB;&#x6467;&#x6BC1;&#x4E4B;&#x524D;&#x4E00;&#x5207;&#x90FD;&#x4F1A;&#x597D;&#x8D77;&#x6765;&#x7684;&#x3002;&#x4E00;&#x65E6;&#x4E00;&#x4E2A;&#x5B9E;&#x4F53;&#x88AB;&#x9500;&#x6BC1;&#xFF0C;&#x5B83;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#x5C31;&#x5931;&#x6548;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x6253;&#x7535;&#x8BDD;&#x7ED9;<code>b2Body::GetNext()</code>&#x5C06;&#x8FD4;&#x56DE;&#x5783;&#x573E;&#x3002;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x662F;&#x5728;&#x9500;&#x6BC1;&#x4E3B;&#x4F53;&#x4E4B;&#x524D;&#x590D;&#x5236;&#x4E0B;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#x3002;</p>
<pre><code class="lang-c++">b2Body* node = myWorld-&gt;GetBodyList();
<span class="hljs-keyword">while</span> (node)
{
    b2Body* b = node;
    node = node-&gt;GetNext();

    GameActor* myActor = (GameActor*)b-&gt;GetUserData().pointer;
    <span class="hljs-keyword">if</span> (myActor-&gt;IsDead())
    {
        myWorld-&gt;DestroyBody(b);
    }
}
</code></pre>
<p>&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5730;&#x6467;&#x6BC1;&#x5F53;&#x524D;&#x7684;&#x8EAB;&#x4F53;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x8C03;&#x7528;&#x4E00;&#x4E2A;&#x53EF;&#x80FD;&#x4F1A;&#x6467;&#x6BC1;&#x591A;&#x4E2A;&#x5B9E;&#x4F53;&#x7684;&#x6E38;&#x620F;&#x51FD;&#x6570;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x975E;&#x5E38;&#x5C0F;&#x5FC3;&#x3002;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x7279;&#x5B9A;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x5C06;&#x5C55;&#x793A;&#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<pre><code class="lang-c++">b2Body* node = myWorld-&gt;GetBodyList();
<span class="hljs-keyword">while</span> (node)
{
    b2Body* b = node;
    node = node-&gt;GetNext();

    GameActor* myActor = (GameActor*)b-&gt;GetUserData().pointer;
    <span class="hljs-keyword">if</span> (myActor-&gt;IsDead())
    {
        <span class="hljs-keyword">bool</span> otherBodiesDestroyed = GameCrazyBodyDestroyer(b);
        <span class="hljs-keyword">if</span> (otherBodiesDestroyed)
        {
            node = myWorld-&gt;GetBodyList();
        }
    }
}
</code></pre>
<p>&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x8981;&#x60F3;&#x8BA9;&#x5B83;&#x6210;&#x529F;&#xFF0C;GameCrazyBodyDestroyer&#x5FC5;&#x987B;&#x8BDA;&#x5B9E;&#x5730;&#x8BF4;&#x51FA;&#x5B83;&#x6240;&#x6467;&#x6BC1;&#x7684;&#x4E00;&#x5207;&#x3002;</p>
<h2 id="aabb&#x67E5;&#x8BE2;">AABB&#x67E5;&#x8BE2;</h2>
<p>&#x6709;&#x65F6;&#x9700;&#x8981;&#x786E;&#x5B9A;&#x533A;&#x57DF;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5F62;&#x72B6;&#x3002;&#x8FD9;&#x4E2A;<a href="https://box2d.org/documentation/classb2_world.html" target="_blank">b2World&#x516C;&#x53F8;</a>&#x7C7B;&#x6709;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;&#x5BBD;&#x9636;&#x6BB5;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x5FEB;&#x901F;&#x65E5;&#x5FD7;&#xFF08;N&#xFF09;&#x65B9;&#x6CD5;&#x3002;&#x5728;&#x4E16;&#x754C;&#x5750;&#x6807;&#x7CFB;&#x4E2D;&#x63D0;&#x4F9B;AABB&#x548C;<a href="https://box2d.org/documentation/classb2_query_callback.html" target="_blank"> b2QueryCallback&#x516C;&#x53F8;</a>. &#x4E16;&#x754C;&#x8C03;&#x7528;&#x4F60;&#x7684;&#x7C7B;&#xFF0C;&#x6BCF;&#x4E2A;fixture&#x7684;AABB&#x4E0E;&#x67E5;&#x8BE2;AABB&#x91CD;&#x53E0;&#x3002;&#x8FD4;&#x56DE;true&#x7EE7;&#x7EED;&#x67E5;&#x8BE2;&#xFF0C;&#x5426;&#x5219;&#x8FD4;&#x56DE;false&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x67E5;&#x627E;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x4E0E;&#x6307;&#x5B9A;AABB&#x76F8;&#x4EA4;&#x7684;&#x88C5;&#x7F6E;&#xFF0C;&#x5E76;&#x5524;&#x9192;&#x6240;&#x6709;&#x5173;&#x8054;&#x7684;&#x5B9E;&#x4F53;&#x3002;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">class</span> MyQueryCallback : <span class="hljs-keyword">public</span> b2QueryCallback
{
<span class="hljs-keyword">public</span>:
    <span class="hljs-function"><span class="hljs-keyword">bool</span> <span class="hljs-title">ReportFixture</span><span class="hljs-params">(b2Fixture* fixture)</span>
    </span>{
        b2Body* body = fixture-&gt;GetBody();
        body-&gt;SetAwake(<span class="hljs-literal">true</span>);

        <span class="hljs-comment">// Return true to continue the query.</span>
        <span class="hljs-keyword">return</span> <span class="hljs-literal">true</span>;
    }
};

<span class="hljs-comment">// Elsewhere ...</span>
MyQueryCallback callback;
b2AABB aabb;

aabb.lowerBound.Set(<span class="hljs-number">-1.0</span>f, <span class="hljs-number">-1.0</span>f);
aabb.upperBound.Set(<span class="hljs-number">1.0f</span>, <span class="hljs-number">1.0f</span>);
myWorld-&gt;Query(&amp;callback, aabb);
</code></pre>
<p>&#x4F60;&#x4E0D;&#x80FD;&#x5BF9;&#x56DE;&#x8C03;&#x7684;&#x987A;&#x5E8F;&#x505A;&#x4EFB;&#x4F55;&#x5047;&#x8BBE;&#x3002;</p>
<h2 id="&#x5149;&#x7EBF;&#x6295;&#x5C04;">&#x5149;&#x7EBF;&#x6295;&#x5C04;</h2>
<p>&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5149;&#x7EBF;&#x6295;&#x5C04;&#x6765;&#x6267;&#x884C;&#x89C6;&#x7EBF;&#x68C0;&#x67E5;&#x3001;&#x5C04;&#x51FB;&#x7B49;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B9E;&#x73B0;&#x56DE;&#x8C03;&#x7C7B;&#x5E76;&#x63D0;&#x4F9B;&#x8D77;&#x70B9;&#x548C;&#x7EC8;&#x70B9;&#x6765;&#x6267;&#x884C;&#x5149;&#x7EBF;&#x6295;&#x5C04;&#x3002;&#x4E16;&#x754C;&#x7EA7;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x8D5B;&#x7A0B;&#x90FD;&#x4F1A;&#x88AB;&#x5C04;&#x7EBF;&#x51FB;&#x4E2D;&#x3002;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x63D0;&#x4F9B;&#x4E86;fixture&#x3001;&#x4EA4;&#x70B9;&#x3001;&#x5355;&#x4F4D;&#x6CD5;&#x5411;&#x91CF;&#x548C;&#x6CBF;&#x5149;&#x7EBF;&#x7684;&#x5206;&#x6570;&#x8DDD;&#x79BB;&#x3002;&#x4F60;&#x4E0D;&#x80FD;&#x5BF9;&#x56DE;&#x8C03;&#x7684;&#x987A;&#x5E8F;&#x505A;&#x4EFB;&#x4F55;&#x5047;&#x8BBE;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x8FD4;&#x56DE;&#x5206;&#x6570;&#x6765;&#x63A7;&#x5236;&#x5149;&#x7EBF;&#x6295;&#x5C04;&#x7684;&#x6301;&#x7EED;&#x6027;&#x3002;&#x8FD4;&#x56DE;&#x96F6;&#x503C;&#x8868;&#x793A;&#x5E94;&#x7EC8;&#x6B62;&#x5149;&#x7EBF;&#x6295;&#x5C04;&#x3002;1&#x7684;&#x5206;&#x6570;&#x8868;&#x793A;&#x5149;&#x7EBF;&#x6295;&#x5C04;&#x5E94;&#x8BE5;&#x7EE7;&#x7EED;&#xFF0C;&#x5C31;&#x50CF;&#x6CA1;&#x6709;&#x53D1;&#x751F;&#x547D;&#x4E2D;&#x4E00;&#x6837;&#x3002;&#x5982;&#x679C;&#x4ECE;&#x53C2;&#x6570;&#x5217;&#x8868;&#x8FD4;&#x56DE;&#x5206;&#x6570;&#xFF0C;&#x5149;&#x7EBF;&#x5C06;&#x88AB;&#x526A;&#x88C1;&#x5230;&#x5F53;&#x524D;&#x4EA4;&#x70B9;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5149;&#x7EBF;&#x6295;&#x5C04;&#x4EFB;&#x4F55;&#x5F62;&#x72B6;&#xFF0C;&#x5149;&#x7EBF;&#x6295;&#x5C04;&#x6240;&#x6709;&#x5F62;&#x72B6;&#xFF0C;&#x6216;&#x901A;&#x8FC7;&#x8FD4;&#x56DE;&#x9002;&#x5F53;&#x7684;&#x5206;&#x6570;&#x6765;&#x5149;&#x7EBF;&#x6295;&#x5C04;&#x6700;&#x8FD1;&#x7684;&#x5F62;&#x72B6;&#x3002;</p>
<p>&#x4E5F;&#x53EF;&#x4EE5;&#x8FD4;&#x56DE;-1&#x7684;&#x5206;&#x6570;&#x6765;&#x8FC7;&#x6EE4;&#x8BBE;&#x5907;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x5149;&#x7EBF;&#x6295;&#x5C04;&#x5C06;&#x7EE7;&#x7EED;&#x8FDB;&#x884C;&#xFF0C;&#x5C31;&#x50CF;&#x8BBE;&#x5907;&#x4E0D;&#x5B58;&#x5728;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code class="lang-c++"><span class="hljs-comment">// This class captures the closest hit shape.</span>
<span class="hljs-keyword">class</span> MyRayCastCallback : <span class="hljs-keyword">public</span> b2RayCastCallback
{
<span class="hljs-keyword">public</span>:
    MyRayCastCallback()
    {
        m_fixture = <span class="hljs-literal">NULL</span>;
    }

    <span class="hljs-function"><span class="hljs-keyword">float</span> <span class="hljs-title">ReportFixture</span><span class="hljs-params">(b2Fixture* fixture, <span class="hljs-keyword">const</span> b2Vec2&amp; point,
                        <span class="hljs-keyword">const</span> b2Vec2&amp; normal, <span class="hljs-keyword">float</span> fraction)</span>
    </span>{
        m_fixture = fixture;
        m_point = point;
        m_normal = normal;
        m_fraction = fraction;
        <span class="hljs-keyword">return</span> fraction;
    }

    b2Fixture* m_fixture;
    b2Vec2 m_point;
    b2Vec2 m_normal;
    <span class="hljs-keyword">float</span> m_fraction;
};

<span class="hljs-comment">// Elsewhere ...</span>
MyRayCastCallback callback;
<span class="hljs-function">b2Vec2 <span class="hljs-title">point1</span><span class="hljs-params">(<span class="hljs-number">-1.0</span>f, <span class="hljs-number">0.0f</span>)</span></span>;
<span class="hljs-function">b2Vec2 <span class="hljs-title">point2</span><span class="hljs-params">(<span class="hljs-number">3.0f</span>, <span class="hljs-number">1.0f</span>)</span></span>;
myWorld-&gt;RayCast(&amp;callback, point1, point2);
</code></pre>
<blockquote>
<p><strong>&#x6CE8;&#x610F;&#x5B89;&#x5168;</strong>&#xFF1A;&#x7531;&#x4E8E;&#x820D;&#x5165;&#x9519;&#x8BEF;&#xFF0C;&#x5149;&#x7EBF;&#x6295;&#x5C04;&#x53EF;&#x4EE5;&#x5728;&#x9759;&#x6001;&#x73AF;&#x5883;&#x4E2D;&#x901A;&#x8FC7;&#x591A;&#x8FB9;&#x5F62;&#x4E4B;&#x95F4;&#x7684;&#x5C0F;&#x88C2;&#x7F1D;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x4E0D;&#x53EF;&#x63A5;&#x53D7;&#xFF0C;&#x8BF7;&#x5C1D;&#x8BD5;&#x7A0D;&#x5FAE;&#x91CD;&#x53E0;&#x591A;&#x8FB9;&#x5F62;&#x3002;</p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="collision-module.html" class="navigation navigation-prev " aria-label="Previous page: 碰撞模块">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="loose-ends.html" class="navigation navigation-next " aria-label="Next page: 松散的末端">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"动力学模块","level":"1.7","depth":1,"next":{"title":"松散的末端","level":"1.8","depth":1,"path":"loose-ends.md","ref":"loose-ends.md","articles":[]},"previous":{"title":"碰撞模块","level":"1.6","depth":1,"path":"collision-module.md","ref":"collision-module.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["expandable-chapters"],"pluginsConfig":{"expandable-chapters":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"dynamics-module.md","mtime":"2021-05-25T07:37:21.014Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-25T07:41:08.923Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

