
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>你好，Box2D · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="testbed.html" />
    
    
    <link rel="prev" href="overview.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="overview.html">
            
                <a href="overview.html">
            
                    
                    概述
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="hello-box2d.html">
            
                <a href="hello-box2d.html">
            
                    
                    你好，Box2D
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="testbed.html">
            
                <a href="testbed.html">
            
                    
                    试验台
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="common-module.html">
            
                <a href="common-module.html">
            
                    
                    通用模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="collision-module.html">
            
                <a href="collision-module.html">
            
                    
                    碰撞模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="dynamics-module.html">
            
                <a href="dynamics-module.html">
            
                    
                    动力学模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="loose-ends.html">
            
                <a href="loose-ends.html">
            
                    
                    松散的末端
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" >
            
                <span>
            
                    
                    工具书类
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="faq.html">
            
                <a href="faq.html">
            
                    
                    FAQ
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >你好，Box2D</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x4F60;&#x597D;&#xFF0C;box2d">&#x4F60;&#x597D;&#xFF0C;Box2D</h2>
<p>&#x5728;Box2D&#x7684;&#x53D1;&#x884C;&#x7248;&#x4E2D;&#x662F;&#x4E00;&#x4E2A;Hello World&#x9879;&#x76EE;&#x3002;&#x7A0B;&#x5E8F;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x5730;&#x9762;&#x76D2;&#x548C;&#x4E00;&#x4E2A;&#x5C0F;&#x7684;&#x52A8;&#x6001;&#x76D2;&#x3002;&#x6B64;&#x4EE3;&#x7801;&#x4E0D;&#x5305;&#x542B;&#x4EFB;&#x4F55;&#x56FE;&#x5F62;&#x3002;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x60A8;&#x5C06;&#x770B;&#x5230;&#x6587;&#x672C;&#x8F93;&#x51FA;&#x5728;&#x6587;&#x672C;&#x6846;&#x4F4D;&#x7F6E;&#x7684;&#x63A7;&#x5236;&#x53F0;&#x4E2D;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x5982;&#x4F55;&#x4F7F;&#x7528;Box2D&#x542F;&#x52A8;&#x548C;&#x8FD0;&#x884C;&#x7684;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x793A;&#x4F8B;&#x3002;</p>
<h2 id="&#x521B;&#x9020;&#x4E00;&#x4E2A;&#x4E16;&#x754C;">&#x521B;&#x9020;&#x4E00;&#x4E2A;&#x4E16;&#x754C;</h2>
<p>&#x6BCF;&#x4E2A;Box2D&#x7A0B;&#x5E8F;&#x90FD;&#x4EE5;&#x521B;&#x5EFA;<a href="https://box2d.org/documentation/classb2_world.html" target="_blank">b2World&#x516C;&#x53F8;</a>&#x5BF9;&#x8C61;<a href="https://box2d.org/documentation/classb2_world.html" target="_blank">b2World&#x516C;&#x53F8;</a>&#x662F;&#x7BA1;&#x7406;&#x5185;&#x5B58;&#x3001;&#x5BF9;&#x8C61;&#x548C;&#x6A21;&#x62DF;&#x7684;&#x7269;&#x7406;&#x4E2D;&#x5FC3;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x5728;&#x5806;&#x6808;&#x3001;&#x5806;&#x6216;&#x6570;&#x636E;&#x90E8;&#x5206;&#x5206;&#x914D;&#x7269;&#x7406;&#x4E16;&#x754C;&#x3002;</p>
<p>&#x521B;&#x5EFA;Box2D&#x4E16;&#x754C;&#x5F88;&#x5BB9;&#x6613;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x91CD;&#x529B;&#x5411;&#x91CF;&#x3002;</p>
<pre><code class="lang-c++"><span class="hljs-function">b2Vec2 <span class="hljs-title">gravity</span><span class="hljs-params">(<span class="hljs-number">0.0f</span>, <span class="hljs-number">-10.0</span>f)</span></span>;
</code></pre>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E16;&#x754C;&#x5BF9;&#x8C61;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x6211;&#x4EEC;&#x6B63;&#x5728;&#x5806;&#x6808;&#x4E0A;&#x521B;&#x5EFA;&#x4E16;&#x754C;&#xFF0C;&#x56E0;&#x6B64;&#x4E16;&#x754C;&#x5FC5;&#x987B;&#x4FDD;&#x6301;&#x5728;&#x8303;&#x56F4;&#x5185;&#x3002;</p>
<pre><code class="lang-c++"><span class="hljs-function">b2World <span class="hljs-title">world</span><span class="hljs-params">(gravity)</span></span>;
</code></pre>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6709;&#x4E86;&#x7269;&#x7406;&#x4E16;&#x754C;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x6DFB;&#x52A0;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x3002;</p>
<h2 id="&#x521B;&#x5EFA;&#x5730;&#x9762;&#x76D2;">&#x521B;&#x5EFA;&#x5730;&#x9762;&#x76D2;</h2>
<p>&#x4F7F;&#x7528;&#x4EE5;&#x4E0B;&#x6B65;&#x9AA4;&#x6784;&#x5EFA;&#x5B9E;&#x4F53;&#xFF1A;</p>
<ol>
<li>&#x7528;&#x4F4D;&#x7F6E;&#x3001;&#x963B;&#x5C3C;&#x7B49;&#x6765;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x7269;&#x4F53;&#x3002;</li>
<li>&#x4F7F;&#x7528;&#x4E16;&#x754C;&#x5BF9;&#x8C61;&#x521B;&#x5EFA;&#x5B9E;&#x4F53;&#x3002;</li>
<li>&#x7528;&#x5F62;&#x72B6;&#x3001;&#x6469;&#x64E6;&#x529B;&#x3001;&#x5BC6;&#x5EA6;&#x7B49;&#x5B9A;&#x4E49;&#x5939;&#x5177;&#x3002;</li>
<li>&#x5728;&#x4E3B;&#x4F53;&#x4E0A;&#x521B;&#x5EFA;&#x88C5;&#x7F6E;</li>
</ol>
<p>&#x5BF9;&#x4E8E;&#x6B65;&#x9AA4;1&#xFF0C;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x5730;&#x9762;&#x5B9E;&#x4F53;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8EAB;&#x4F53;&#x5B9A;&#x4E49;&#x3002;&#x6839;&#x636E;&#x7269;&#x4F53;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x6211;&#x4EEC;&#x6307;&#x5B9A;&#x4E86;&#x5730;&#x9762;&#x7269;&#x4F53;&#x7684;&#x521D;&#x59CB;&#x4F4D;&#x7F6E;&#x3002;</p>
<pre><code class="lang-c++">b2BodyDef groundBodyDef;
groundBodyDef.position.Set(<span class="hljs-number">0.0f</span>, <span class="hljs-number">-10.0</span>f);
</code></pre>
<p>&#x5BF9;&#x4E8E;&#x6B65;&#x9AA4;2&#xFF0C;&#x5C06;&#x5B9E;&#x4F53;&#x5B9A;&#x4E49;&#x4F20;&#x9012;&#x7ED9;world&#x5BF9;&#x8C61;&#x4EE5;&#x521B;&#x5EFA;&#x5730;&#x9762;&#x5B9E;&#x4F53;&#x3002;&#x4E16;&#x754C;&#x5BF9;&#x8C61;&#x4E0D;&#x4FDD;&#x7559;&#x5BF9;&#x5B9E;&#x4F53;&#x5B9A;&#x4E49;&#x7684;&#x5F15;&#x7528;&#x3002;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B9E;&#x4F53;&#x662F;&#x9759;&#x6001;&#x7684;&#x3002;&#x9759;&#x6B62;&#x7269;&#x4F53;&#x4E0D;&#x4F1A;&#x4E0E;&#x5176;&#x4ED6;&#x9759;&#x6B62;&#x7269;&#x4F53;&#x78B0;&#x649E;&#xFF0C;&#x5E76;&#x4E14;&#x662F;&#x4E0D;&#x53EF;&#x79FB;&#x52A8;&#x7684;&#x3002;</p>
<pre><code class="lang-c++">b2Body* groundBody = world.CreateBody(&amp;groundBodyDef);
</code></pre>
<p>&#x5BF9;&#x4E8E;&#x6B65;&#x9AA4;3&#xFF0C;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5730;&#x9762;&#x591A;&#x8FB9;&#x5F62;&#x3002;&#x6211;&#x4EEC;&#x4F7F;&#x7528;SetAsBox&#x5FEB;&#x6377;&#x65B9;&#x5F0F;&#x5C06;&#x5730;&#x9762;&#x591A;&#x8FB9;&#x5F62;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x957F;&#x65B9;&#x4F53;&#x5F62;&#x72B6;&#xFF0C;&#x957F;&#x65B9;&#x4F53;&#x4EE5;&#x7236;&#x4F53;&#x7684;&#x539F;&#x70B9;&#x4E3A;&#x4E2D;&#x5FC3;&#x3002;</p>
<pre><code class="lang-c++">b2PolygonShape groundBox;
groundBox.SetAsBox(<span class="hljs-number">50.0f</span>, <span class="hljs-number">10.0f</span>);
</code></pre>
<p>SetAsBox&#x51FD;&#x6570;&#x63A5;&#x53D7;<strong>&#x4E00;&#x534A;</strong>-<strong>&#x5BBD;&#x5EA6;</strong>&#x548C;<strong>&#x4E00;&#x534A;</strong>-<strong>&#x9AD8;&#x5EA6;</strong>&#xFF08;&#x8303;&#x56F4;&#xFF09;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x63A5;&#x5730;&#x76D2;&#x662F;100&#x4E2A;&#x5355;&#x4F4D;&#x5BBD;&#xFF08;x&#x8F74;&#xFF09;&#x548C;20&#x4E2A;&#x5355;&#x4F4D;&#x9AD8;&#xFF08;y&#x8F74;&#xFF09;&#x3002;Box2D&#x9488;&#x5BF9;&#x7C73;&#x3001;&#x516C;&#x65A4;&#x548C;&#x79D2;&#x8FDB;&#x884C;&#x4E86;&#x8C03;&#x6574;&#x3002;&#x6240;&#x4EE5;&#x4F60;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4EE5;&#x7C73;&#x4E3A;&#x5355;&#x4F4D;&#x7684;&#x8303;&#x56F4;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x5F53;&#x5BF9;&#x8C61;&#x7684;&#x5927;&#x5C0F;&#x4E0E;&#x771F;&#x5B9E;&#x4E16;&#x754C;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x76F8;&#x540C;&#x65F6;&#xFF0C;Box2D&#x7684;&#x6548;&#x679C;&#x6700;&#x597D;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x6876;&#x5927;&#x7EA6;&#x6709;1&#x7C73;&#x9AD8;&#x3002;&#x7531;&#x4E8E;&#x6D6E;&#x70B9;&#x7B97;&#x6CD5;&#x7684;&#x5C40;&#x9650;&#x6027;&#xFF0C;&#x7528;Box2D&#x6765;&#x6A21;&#x62DF;&#x51B0;&#x5DDD;&#x6216;&#x5C18;&#x57C3;&#x7C92;&#x5B50;&#x7684;&#x8FD0;&#x52A8;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x4E3B;&#x610F;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5728;&#x6B65;&#x9AA4;4&#x4E2D;&#x901A;&#x8FC7;&#x521B;&#x5EFA;&#x5F62;&#x72B6;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x6765;&#x5B8C;&#x6210;&#x5730;&#x4F53;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E00;&#x6B65;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x6377;&#x5F84;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x66F4;&#x6539;&#x9ED8;&#x8BA4;&#x7684;&#x8BBE;&#x5907;&#x6750;&#x8D28;&#x5C5E;&#x6027;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5C06;&#x5F62;&#x72B6;&#x4F20;&#x9012;&#x7ED9;&#x5B9E;&#x4F53;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x521B;&#x5EFA;&#x8BBE;&#x5907;&#x5B9A;&#x4E49;&#x3002;&#x7A0D;&#x540E;&#x6211;&#x4EEC;&#x5C06;&#x4E86;&#x89E3;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x5939;&#x5177;&#x5B9A;&#x4E49;&#x81EA;&#x5B9A;&#x4E49;&#x6750;&#x6599;&#x5C5E;&#x6027;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x5F62;&#x72B6;&#x5BC6;&#x5EA6;&#xFF0C;&#x5355;&#x4F4D;&#x4E3A;&#x5343;&#x514B;&#x6BCF;&#x5E73;&#x65B9;&#x7C73;&#x3002;&#x9759;&#x6001;&#x7269;&#x4F53;&#x7684;&#x8D28;&#x91CF;&#x5B9A;&#x4E49;&#x4E3A;&#x96F6;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x4E0D;&#x4F7F;&#x7528;&#x5BC6;&#x5EA6;&#x3002;</p>
<pre><code class="lang-c++">groundBody-&gt;CreateFixture(&amp;groundBox, <span class="hljs-number">0.0f</span>);
</code></pre>
<p>Box2D&#x4E0D;&#x4FDD;&#x7559;&#x5BF9;&#x5F62;&#x72B6;&#x7684;&#x5F15;&#x7528;&#x3002;&#x5B83;&#x5C06;&#x6570;&#x636E;&#x514B;&#x9686;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x7684;<a href="https://box2d.org/documentation/classb2_shape.html" target="_blank">B2&#x5F62;&#x72B6;</a>&#x5BF9;&#x8C61;</p>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x6BCF;&#x4E2A;fixture&#x90FD;&#x5FC5;&#x987B;&#x6709;&#x4E00;&#x4E2A;&#x7236;&#x5B9E;&#x4F53;&#xFF0C;&#x5373;&#x4F7F;fixture&#x662F;&#x9759;&#x6001;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x6240;&#x6709;&#x9759;&#x6001;&#x88C5;&#x7F6E;&#x9644;&#x7740;&#x5230;&#x5355;&#x4E2A;&#x9759;&#x6001;&#x4E3B;&#x4F53;&#x4E0A;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x5C06;&#x5F62;&#x72B6;&#x9644;&#x7740;&#x5230;&#x5B9E;&#x4F53;&#x65F6;&#xFF0C;&#x5F62;&#x72B6;&#x7684;&#x5750;&#x6807;&#x5C06;&#x6210;&#x4E3A;&#x5B9E;&#x4F53;&#x7684;&#x5C40;&#x90E8;&#x5750;&#x6807;&#x3002;&#x6240;&#x4EE5;&#x5F53;&#x8EAB;&#x4F53;&#x79FB;&#x52A8;&#x65F6;&#xFF0C;&#x5F62;&#x72B6;&#x4E5F;&#x4F1A;&#x968F;&#x4E4B;&#x53D8;&#x5316;&#x3002;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x7684;&#x4E16;&#x754C;&#x53D8;&#x6362;&#x662F;&#x4ECE;&#x7236;&#x5B9E;&#x4F53;&#x7EE7;&#x627F;&#x7684;&#x3002;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x6CA1;&#x6709;&#x72EC;&#x7ACB;&#x4E8E;&#x5B9E;&#x4F53;&#x7684;&#x53D8;&#x6362;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x5728;&#x8EAB;&#x4F53;&#x4E0A;&#x79FB;&#x52A8;&#x4E00;&#x4E2A;&#x5F62;&#x72B6;&#x3002;&#x4E0D;&#x652F;&#x6301;&#x79FB;&#x52A8;&#x6216;&#x4FEE;&#x6539;&#x5B9E;&#x4F53;&#x4E0A;&#x7684;&#x5F62;&#x72B6;&#x3002;&#x539F;&#x56E0;&#x5F88;&#x7B80;&#x5355;&#xFF1A;&#x5177;&#x6709;&#x53D8;&#x5F62;&#x5F62;&#x72B6;&#x7684;&#x5B9E;&#x4F53;&#x4E0D;&#x662F;&#x521A;&#x4F53;&#xFF0C;&#x4F46;Box2D&#x662F;&#x521A;&#x4F53;&#x5F15;&#x64CE;&#x3002;Box2D&#x4E2D;&#x7684;&#x8BB8;&#x591A;&#x5047;&#x8BBE;&#x90FD;&#x57FA;&#x4E8E;&#x521A;&#x4F53;&#x6A21;&#x578B;&#x3002;&#x5982;&#x679C;&#x8FDD;&#x53CD;&#x4E86;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x90FD;&#x4F1A;&#x7834;&#x88C2;</p>
<h2 id="&#x521B;&#x5EFA;&#x52A8;&#x6001;&#x5B9E;&#x4F53;">&#x521B;&#x5EFA;&#x52A8;&#x6001;&#x5B9E;&#x4F53;</h2>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x5730;&#x4F53;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x540C;&#x6837;&#x7684;&#x6280;&#x672F;&#x6765;&#x521B;&#x9020;&#x4E00;&#x4E2A;&#x52A8;&#x6001;&#x7684;&#x8EAB;&#x4F53;&#x3002;&#x9664;&#x4E86;&#x5C3A;&#x5BF8;&#x4E4B;&#x5916;&#xFF0C;&#x4E3B;&#x8981;&#x7684;&#x533A;&#x522B;&#x662F;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5EFA;&#x7ACB;&#x52A8;&#x6001;&#x7269;&#x4F53;&#x7684;&#x8D28;&#x91CF;&#x7279;&#x6027;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;CreateBody&#x521B;&#x5EFA;&#x5B9E;&#x4F53;&#x3002;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B9E;&#x4F53;&#x662F;&#x9759;&#x6001;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5728;&#x6784;&#x9020;&#x65F6;&#x8BBE;&#x7F6E;b2BodyType&#xFF0C;&#x4F7F;&#x5B9E;&#x4F53;&#x6210;&#x4E3A;&#x52A8;&#x6001;&#x7684;&#x3002;</p>
<pre><code class="lang-c++">b2BodyDef bodyDef;
bodyDef.type = b2_dynamicBody;
bodyDef.position.Set(<span class="hljs-number">0.0f</span>, <span class="hljs-number">4.0f</span>);
b2Body* body = world.CreateBody(&amp;bodyDef);
</code></pre>
<blockquote>
<p><strong>&#x6CE8;&#x610F;&#x5B89;&#x5168;</strong>&#xFF1A;&#x5982;&#x679C;&#x8981;&#x4F7F;&#x5B9E;&#x4F53;&#x54CD;&#x5E94;&#x529B;&#x800C;&#x79FB;&#x52A8;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x5C06;&#x201C;&#x8EAF;&#x5E72;&#x7C7B;&#x578B;&#x201D;&#x8BBE;&#x7F6E;&#x4E3A;&#x201C;b2&#x201D;dynamicBody&#x3002;</p>
</blockquote>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x8BBE;&#x5907;&#x5B9A;&#x4E49;&#x521B;&#x5EFA;&#x5E76;&#x9644;&#x52A0;&#x4E00;&#x4E2A;&#x591A;&#x8FB9;&#x5F62;&#x5F62;&#x72B6;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x957F;&#x65B9;&#x4F53;&#x5F62;&#x72B6;&#xFF1A;</p>
<pre><code class="lang-c++">b2PolygonShape dynamicBox;
dynamicBox.SetAsBox(<span class="hljs-number">1.0f</span>, <span class="hljs-number">1.0f</span>);
</code></pre>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x957F;&#x65B9;&#x4F53;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;fixture&#x5B9A;&#x4E49;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x201C;&#x5BC6;&#x5EA6;&#x201D;&#xFF08;density&#xFF09;&#x8BBE;&#x7F6E;&#x4E3A;1&#x3002;&#x9ED8;&#x8BA4;&#x7684;&#x201C;&#x5BC6;&#x5EA6;&#x201D;&#xFF08;density&#xFF09;&#x4E3A;&#x96F6;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5F62;&#x72B6;&#x4E0A;&#x7684;&#x6469;&#x64E6;&#x529B;&#x8BBE;&#x7F6E;&#x4E3A;0.3&#x3002;</p>
<pre><code class="lang-c++">b2FixtureDef fixtureDef;
fixtureDef.shape = &amp;dynamicBox;
fixtureDef.density = <span class="hljs-number">1.0f</span>;
fixtureDef.friction = <span class="hljs-number">0.3f</span>;
</code></pre>
<p>&#x4F7F;&#x7528;fixture&#x5B9A;&#x4E49;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;fixture&#x3002;&#x8FD9;&#x4F1A;&#x81EA;&#x52A8;&#x66F4;&#x65B0;&#x5B9E;&#x4F53;&#x7684;&#x8D28;&#x91CF;&#x3002;&#x53EF;&#x4EE5;&#x5411;&#x5B9E;&#x4F53;&#x6DFB;&#x52A0;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x90FD;&#x5360;&#x603B;&#x8D28;&#x91CF;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<pre><code class="lang-c++">body-&gt;CreateFixture(&amp;fixtureDef);
</code></pre>
<p>&#x8FD9;&#x5C31;&#x662F;&#x521D;&#x59CB;&#x5316;&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x6A21;&#x62DF;&#x4E86;&#x3002;</p>
<h2 id="&#x6A21;&#x62DF;&#x4E16;&#x754C;">&#x6A21;&#x62DF;&#x4E16;&#x754C;</h2>
<p>&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x521D;&#x59CB;&#x5316;&#x4E86;&#x5730;&#x76D2;&#x548C;&#x52A8;&#x6001;&#x76D2;&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x51C6;&#x5907;&#x597D;&#x505A;&#x725B;&#x987F;&#x7684;&#x4E8B;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x6709;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#x8981;&#x8003;&#x8651;&#x3002;</p>
<p>Box2D&#x4F7F;&#x7528;&#x4E00;&#x79CD;&#x79F0;&#x4E3A;&#x79EF;&#x5206;&#x5668;&#x7684;&#x8BA1;&#x7B97;&#x7B97;&#x6CD5;&#x3002;&#x79EF;&#x5206;&#x5668;&#x5728;&#x79BB;&#x6563;&#x65F6;&#x95F4;&#x70B9;&#x6A21;&#x62DF;&#x7269;&#x7406;&#x65B9;&#x7A0B;&#x3002;&#x8FD9;&#x4E0E;&#x4F20;&#x7EDF;&#x7684;&#x6E38;&#x620F;&#x5FAA;&#x73AF;&#x76F8;&#x7ED3;&#x5408;&#xFF0C;&#x6211;&#x4EEC;&#x57FA;&#x672C;&#x4E0A;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x6709;&#x4E00;&#x672C;&#x5173;&#x4E8E;&#x8FD0;&#x52A8;&#x7684;&#x7FFB;&#x9875;&#x4E66;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E3A;Box2D&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x7269;&#x7406;&#x5F15;&#x64CE;&#x7684;&#x6E38;&#x620F;&#xFF0C;&#x50CF;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x81F3;&#x5C11;&#x5FEB;&#x5230;60&#x8D6B;&#x5179;&#x6216;1/60&#x79D2;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x907F;&#x5F00;&#x66F4;&#x5927;&#x7684;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#xFF0C;&#x4F46;&#x4F60;&#x5FC5;&#x987B;&#x66F4;&#x52A0;&#x5C0F;&#x5FC3;&#x5730;&#x4E3A;&#x4F60;&#x7684;&#x4E16;&#x754C;&#x8BBE;&#x7F6E;&#x5B9A;&#x4E49;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x4E0D;&#x559C;&#x6B22;&#x65F6;&#x95F4;&#x7684;&#x53D8;&#x5316;&#x592A;&#x5927;&#x3002;&#x53EF;&#x53D8;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x4F1A;&#x4EA7;&#x751F;&#x53D8;&#x91CF;&#x7ED3;&#x679C;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x8C03;&#x8BD5;&#x53D8;&#x5F97;&#x56F0;&#x96BE;&#x3002;&#x6240;&#x4EE5;&#x4E0D;&#x8981;&#x628A;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x548C;&#x5E27;&#x901F;&#x7387;&#x8054;&#x7CFB;&#x5728;&#x4E00;&#x8D77;&#xFF08;&#x9664;&#x975E;&#x4F60;&#x771F;&#x7684;&#xFF0C;&#x771F;&#x7684;&#x5FC5;&#x987B;&#x8FD9;&#x4E48;&#x505A;&#xFF09;&#x3002;&#x4E0D;&#x7528;&#x591A;&#x8D39;&#x5439;&#x7070;&#x4E4B;&#x529B;&#xFF0C;&#x8FD9;&#x91CC;&#x662F;&#x65F6;&#x95F4;&#x6B65;&#x3002;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">float</span> timeStep = <span class="hljs-number">1.0f</span> / <span class="hljs-number">60.0f</span>;
</code></pre>
<p>&#x9664;&#x4E86;&#x79EF;&#x5206;&#x5668;&#x4E4B;&#x5916;&#xFF0C;Box2D&#x8FD8;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A;&#x7EA6;&#x675F;&#x6C42;&#x89E3;&#x5668;&#x7684;&#x8F83;&#x5927;&#x4EE3;&#x7801;&#x4F4D;&#x3002;&#x7EA6;&#x675F;&#x89E3;&#x7B97;&#x5668;&#x4E00;&#x6B21;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x6A21;&#x62DF;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x7EA6;&#x675F;&#x3002;&#x5355;&#x4E2A;&#x7EA6;&#x675F;&#x53EF;&#x4EE5;&#x5B8C;&#x7F8E;&#x5730;&#x89E3;&#x51B3;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x7EA6;&#x675F;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x7A0D;&#x5FAE;&#x7834;&#x574F;&#x5176;&#x4ED6;&#x7EA6;&#x675F;&#x3002;&#x4E3A;&#x4E86;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8FED;&#x4EE3;&#x6240;&#x6709;&#x7EA6;&#x675F;&#x591A;&#x6B21;&#x3002;</p>
<p>&#x7EA6;&#x675F;&#x89E3;&#x7B97;&#x5668;&#x6709;&#x4E24;&#x4E2A;&#x9636;&#x6BB5;&#xFF1A;&#x901F;&#x5EA6;&#x9636;&#x6BB5;&#x548C;&#x4F4D;&#x7F6E;&#x9636;&#x6BB5;&#x3002;&#x5728;&#x901F;&#x5EA6;&#x9636;&#x6BB5;&#xFF0C;&#x89E3;&#x7B97;&#x5668;&#x8BA1;&#x7B97;&#x7269;&#x4F53;&#x6B63;&#x786E;&#x79FB;&#x52A8;&#x6240;&#x9700;&#x7684;&#x8109;&#x51B2;&#x3002;&#x5728;&#x4F4D;&#x7F6E;&#x9636;&#x6BB5;&#xFF0C;&#x89E3;&#x7B97;&#x5668;&#x8C03;&#x6574;&#x8EAB;&#x4F53;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4EE5;&#x51CF;&#x5C11;&#x91CD;&#x53E0;&#x548C;&#x5173;&#x8282;&#x5206;&#x79BB;&#x3002;&#x6BCF;&#x4E2A;&#x9636;&#x6BB5;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x8FED;&#x4EE3;&#x8BA1;&#x6570;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x8BEF;&#x5DEE;&#x5F88;&#x5C0F;&#xFF0C;&#x4F4D;&#x7F6E;&#x9636;&#x6BB5;&#x53EF;&#x80FD;&#x4F1A;&#x63D0;&#x524D;&#x9000;&#x51FA;&#x8FED;&#x4EE3;&#x3002;</p>
<p>Box2D&#x7684;&#x5EFA;&#x8BAE;&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#x662F;&#x901F;&#x5EA6;8&#x6B21;&#xFF0C;&#x4F4D;&#x7F6E;3&#x6B21;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x559C;&#x597D;&#x8C03;&#x6574;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x4F46;&#x8981;&#x8BB0;&#x4F4F;&#x8FD9;&#x5728;&#x6027;&#x80FD;&#x548C;&#x51C6;&#x786E;&#x6027;&#x4E4B;&#x95F4;&#x6709;&#x4E00;&#x4E2A;&#x6298;&#x8877;&#x3002;&#x4F7F;&#x7528;&#x8F83;&#x5C11;&#x7684;&#x8FED;&#x4EE3;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#xFF0C;&#x4F46;&#x7CBE;&#x5EA6;&#x4F1A;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x4F7F;&#x7528;&#x66F4;&#x591A;&#x7684;&#x8FED;&#x4EE3;&#x4F1A;&#x964D;&#x4F4E;&#x6027;&#x80FD;&#xFF0C;&#x4F46;&#x4F1A;&#x63D0;&#x9AD8;&#x6A21;&#x62DF;&#x7684;&#x8D28;&#x91CF;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x592A;&#x591A;&#x7684;&#x8FED;&#x4EE3;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x7684;&#x8FED;&#x4EE3;&#x8BA1;&#x6570;&#x3002;</p>
<pre><code class="lang-c++">int32 velocityIterations = <span class="hljs-number">6</span>;
int32 positionIterations = <span class="hljs-number">2</span>;
</code></pre>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x548C;&#x8FED;&#x4EE3;&#x8BA1;&#x6570;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#x3002;&#x8FED;&#x4EE3;&#x4E0D;&#x662F;&#x5B50;&#x6B65;&#x9AA4;&#x3002;&#x4E00;&#x4E2A;&#x89E3;&#x7B97;&#x5668;&#x8FED;&#x4EE3;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x5185;&#x5BF9;&#x6240;&#x6709;&#x7EA6;&#x675F;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x8FED;&#x4EE3;&#x3002;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#x5185;&#x5BF9;&#x7EA6;&#x675F;&#x8FDB;&#x884C;&#x591A;&#x6B21;&#x4F20;&#x9012;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x6A21;&#x62DF;&#x5FAA;&#x73AF;&#x4E86;&#x3002;&#x5728;&#x6E38;&#x620F;&#x4E2D;&#xFF0C;&#x6A21;&#x62DF;&#x5FAA;&#x73AF;&#x53EF;&#x4EE5;&#x4E0E;&#x6E38;&#x620F;&#x5FAA;&#x73AF;&#x5408;&#x5E76;&#x3002;&#x5728;&#x6BCF;&#x6B21;&#x901A;&#x8FC7;&#x4F60;&#x7684;&#x6E38;&#x620F;&#x5FAA;&#x73AF;&#x4F60;&#x8C03;&#x7528;<a href="https://box2d.org/documentation/classb2_world.html#a82c081319af9a47e282dde807e4cd7b8" target="_blank">b2World:&#xFF1A;&#x6B65;&#x9AA4;</a>. &#x53EA;&#x8981;&#x4E00;&#x4E2A;&#x7535;&#x8BDD;&#x5C31;&#x8DB3;&#x591F;&#x4E86;&#xFF0C;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x7684;&#x5E27;&#x901F;&#x7387;&#x548C;&#x4F60;&#x7684;&#x7269;&#x7406;&#x65F6;&#x95F4;&#x6B65;&#x957F;&#x3002;</p>
<p>Hello World&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x5F97;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x56E0;&#x6B64;&#x6CA1;&#x6709;&#x56FE;&#x5F62;&#x8F93;&#x51FA;&#x3002;&#x4EE3;&#x7801;&#x6253;&#x5370;&#x51FA;&#x52A8;&#x6001;&#x4F53;&#x7684;&#x4F4D;&#x7F6E;&#x548C;&#x65CB;&#x8F6C;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x6A21;&#x62DF;&#x5FAA;&#x73AF;&#xFF0C;&#x5B83;&#x6A21;&#x62DF;60&#x4E2A;&#x65F6;&#x95F4;&#x6B65;&#xFF0C;&#x603B;&#x5171;&#x6A21;&#x62DF;1&#x79D2;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<pre><code class="lang-c++"><span class="hljs-keyword">for</span> (int32 i = <span class="hljs-number">0</span>; i &lt; <span class="hljs-number">60</span>; ++i)
{
    world.Step(timeStep, velocityIterations, positionIterations);
    b2Vec2 position = body-&gt;GetPosition();
    <span class="hljs-keyword">float</span> angle = body-&gt;GetAngle();
    <span class="hljs-built_in">printf</span>(<span class="hljs-string">&quot;%4.2f %4.2f %4.2f\n&quot;</span>, position.x, position.y, angle);
}
</code></pre>
<p>&#x8F93;&#x51FA;&#x663E;&#x793A;&#x7BB1;&#x5B50;&#x6389;&#x843D;&#x5E76;&#x843D;&#x5728;&#x5730;&#x9762;&#x4E0A;&#x3002;&#x60A8;&#x7684;&#x8F93;&#x51FA;&#x5E94;&#x8BE5;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code>0.00 4.00 0.00
0.00 3.99 0.00
0.00 3.98 0.00
...
0.00 1.25 0.00
0.00 1.13 0.00
0.00 1.01 0.00
</code></pre><h2 id="&#x6E05;&#x7406;">&#x6E05;&#x7406;</h2>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x4E16;&#x754C;&#x79BB;&#x5F00;&#x4F5C;&#x7528;&#x57DF;&#x6216;&#x901A;&#x8FC7;&#x5728;&#x6307;&#x9488;&#x4E0A;&#x8C03;&#x7528;delete&#x5220;&#x9664;&#x65F6;&#xFF0C;&#x4E3A;&#x5B9E;&#x4F53;&#x3001;&#x88C5;&#x7F6E;&#x548C;&#x5173;&#x8282;&#x4FDD;&#x7559;&#x7684;&#x6240;&#x6709;&#x5185;&#x5B58;&#x90FD;&#x5C06;&#x88AB;&#x91CA;&#x653E;&#x3002;&#x8BA9;&#x4F60;&#x7684;&#x751F;&#x6D3B;&#x53D8;&#x5F97;&#x66F4;&#x8F7B;&#x677E;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x60A8;&#x5C06;&#x9700;&#x8981;&#x4F7F;&#x60A8;&#x62E5;&#x6709;&#x7684;&#x4EFB;&#x4F55;&#x4E3B;&#x4F53;&#x3001;&#x56FA;&#x5B9A;&#x88C5;&#x7F6E;&#x6216;&#x5173;&#x8282;&#x6307;&#x9488;&#x65E0;&#x6548;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x5C06;&#x53D8;&#x5F97;&#x65E0;&#x6548;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="overview.html" class="navigation navigation-prev " aria-label="Previous page: 概述">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="testbed.html" class="navigation navigation-next " aria-label="Next page: 试验台">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"你好，Box2D","level":"1.3","depth":1,"next":{"title":"试验台","level":"1.4","depth":1,"path":"testbed.md","ref":"testbed.md","articles":[]},"previous":{"title":"概述","level":"1.2","depth":1,"path":"overview.md","ref":"overview.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["expandable-chapters"],"pluginsConfig":{"expandable-chapters":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"hello-box2d.md","mtime":"2021-05-25T06:27:37.354Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-25T07:41:08.923Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

